<!DOCTYPE html><html lang="zh-TW"><head><meta name="generator" content="Hexo 3.9.0"><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><meta property="og:image" content="https://avatars2.githubusercontent.com/u/5959524?v=3&amp;s=300"><meta property="og:description" content="WeiYuan Note | 資料科學團隊的角色與配置"><meta property="og:title" content="資料科學團隊的角色與配置"><title>資料科學團隊的角色與配置 | 資料科學家的工作日常</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"><link rel="stylesheet" type="text/css" href="/css/pure-min.css"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css"><link rel="stylesheet" type="text/css" href="/css/profile-card.css"><link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.4.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"><link href="//cdn-images.mailchimp.com/embedcode/slim-10_7.css" rel="stylesheet" type="text/css"><script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><script><!-- hexo-inject:begin --><!-- hexo-inject:end -->(adsbygoogle = window.adsbygoogle || []).push({
google_ad_client: "ca-pub-7913880396333307",
enable_page_level_ads: true
});


</script><!-- hexo-inject:begin --><!-- hexo-inject:end --></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">資料科學團隊的角色與配置</h1><a id="logo" href="https://v123582.github.io">資料科學家的工作日常</a><p class="description">#遠端 #斜槓 #教學 #資料科學 #網站開發</p></div><div id="nav-menu"><a href="https://v123582.github.io/about"><i class="icon-about"> 關於</i></a><a href="https://v123582.github.io/project"><i class="fa fa-tasks"> 專案</i></a><a href="https://v123582.github.io/blog"><i class="icon-archive"> 技術</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post post-page"><h1 class="post-title"><span><i class="fa fa-star"></i></span>資料科學團隊的角色與配置</h1><div class="post-meta">2022-01-21 | WeiYuan (@v123582)</div><a data-url="https://blog.v12358.tw/2022/01/21/資料科學團隊的職涯指南與配置/" data-id="clrhddt7a006bvsobwni91333" class="article-share-link">Share</a><div class="post-content"><p>&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x6D6A;&#x6F6E;&#x66F4;&#x5C07;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x63A8;&#x5230;&#x7B2C;&#x4E00;&#x7DDA;&#xFF0C;&#x8A31;&#x591A;&#x7522;&#x696D;&#x90FD;&#x80FD;&#x770B;&#x5230;&#x300C;&#x8CC7;&#x6599;&#x300D;&#x7684;&#x5F71;&#x5B50;&#x8207;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x4F46;&#x662F;&#x5C0D;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8077;&#x6DAF;&#x6709;&#x8208;&#x8DA3;&#x7684;&#x4EBA;&#xFF0C;&#x8A72;&#x600E;&#x9EBC;&#x77E5;&#x9053;&#x300C;&#x54EA;&#x88E1;&#x6709;&#x9069;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x4F4D;&#x7F6E;&#x300D;&#x4E26;&#x300C;&#x64DA;&#x4EE5;&#x898F;&#x5283;&#x81EA;&#x5DF1;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8077;&#x6DAF;&#x300D;&#x5462;&#xFF1F;&#x7531;&#x65BC;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9700;&#x6C42;&#x6642;&#x5E38;&#x662F;&#x500B;&#x5F88;&#x9F90;&#x5927;&#x7684;&#x4EFB;&#x52D9;&#xFF0C;&#x5BE6;&#x969B;&#x4E0A;&#x6703;&#x9700;&#x8981;&#x4E00;&#x500B;&#x5718;&#x968A;&#x4F86;&#x5BE6;&#x73FE;&#x3002;&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x5C31;&#x5F9E;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x51FA;&#x767C;&#xFF0C;&#x89E3;&#x6790;&#x5176;&#x4E2D;&#x7684;&#x4EFB;&#x52D9;&#x5167;&#x5BB9;&#x3001;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x3001;&#x9700;&#x6C42;&#x914D;&#x7F6E;&#x8207;&#x548C;&#x5354;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x4E00;&#x6B65;&#x6B65;&#x5730;&#x6D1E;&#x5BDF;&#x8207;&#x8CBC;&#x8FD1;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x4E00;&#x7ABA;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x7684;&#x6A23;&#x8C8C;&#x3002;</p>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><ul>
<li>&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x7684;&#x5DE5;&#x4F5C;&#x5167;&#x5BB9;&#x8207;&#x6D41;&#x7A0B;</li>
<li>&#x8CC7;&#x6599;&#x5718;&#x968A;&#x4E2D;&#x89D2;&#x8272;&#x7684;&#x6280;&#x80FD;&#x8207;&#x4EFB;&#x52D9;</li>
<li>&#x9010;&#x6B65;&#x6210;&#x9577;&#x7684;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x914D;&#x7F6E;</li>
</ul>
<h2 id="&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x7684;&#x5DE5;&#x4F5C;&#x5167;&#x5BB9;&#x8207;&#x6D41;&#x7A0B;"><a href="#&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x7684;&#x5DE5;&#x4F5C;&#x5167;&#x5BB9;&#x8207;&#x6D41;&#x7A0B;" class="headerlink" title="&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x7684;&#x5DE5;&#x4F5C;&#x5167;&#x5BB9;&#x8207;&#x6D41;&#x7A0B;"></a>&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x7684;&#x5DE5;&#x4F5C;&#x5167;&#x5BB9;&#x8207;&#x6D41;&#x7A0B;</h2><p>&#x4E00;&#x500B;&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x6703;&#x7D93;&#x904E;&#x300C;&#x53D6;&#x5F97;&#x8CC7;&#x6599;&#x300D;&#x3001;&#x300C;&#x8CC7;&#x6599;&#x524D;&#x8655;&#x7406;&#x300D;&#x3001;&#x300C;&#x8A13;&#x7DF4;&#x6A21;&#x578B;&#x300D;&#x3001;&#x300C;&#x6A21;&#x578B;&#x8A55;&#x4F30;&#x300D;&#x3001;&#x300C;&#x6C7A;&#x7B56;&#x61C9;&#x7528;&#x300D;&#x4E94;&#x500B;&#x6D41;&#x7A0B;&#x3002;</p>
<p><img src="https://imgur.com/XAVx3H0.png" alt="https://towardsdatascience.com/wtf-is-machine-learning-a-quick-guide-39457e49c65b"></p>
<p>&#x9996;&#x5148;&#x7684;&#x6B65;&#x9A5F;&#x662F;&#x300C;&#x53D6;&#x5F97;&#x8CC7;&#x6599;&#x300D;&#x8207;&#x300C;&#x8CC7;&#x6599;&#x524D;&#x8655;&#x7406;&#x300D;&#xFF0C;&#x9019;&#x662F;&#x6574;&#x500B;&#x6D41;&#x7A0B;&#x4E2D;&#x6700;&#x82B1;&#x6642;&#x9593;&#x7684;&#x90E8;&#x5206;&#x3002;&#x7279;&#x5225;&#x5728;&#x8CC7;&#x6599;&#x91CF;&#x8F03;&#x5927;&#x6216;&#x8F03;&#x591A;&#x5143;&#x6642;&#xFF0C;&#x8CC7;&#x6599;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x7E3D;&#x662F;&#x5F88;&#x8CBB;&#x529F;&#x592B;&#x3002;&#x63A5;&#x4E0B;&#x4F86;&#xFF0C;&#x6211;&#x5011;&#x8981;&#x5F9E;&#x8CC7;&#x6599;&#x4E2D;&#x5B78;&#x7FD2;&#x3001;&#x4E26;&#x627E;&#x5230;&#x898F;&#x5247;&#xFF0C;&#x9019;&#x4FBF;&#x662F;&#x300C;&#x6A21;&#x578B;&#x300D;&#x6216;&#x300C;&#x6F14;&#x7B97;&#x6CD5;&#x300D;&#x7684;&#x968E;&#x6BB5;&#x3002;&#x800C;&#x6A21;&#x578B;&#x7684;&#x6982;&#x5FF5;&#x6709;&#x9EDE;&#x50CF;&#x500B;&#x795E;&#x7955;&#x7684;&#x9ED1;&#x76D2;&#x5B50;&#xFF0C;&#x5C0D;&#x540C;&#x6A23;&#x7684;&#x8CC7;&#x6599;&#x3001;&#x80FD;&#x5920;&#x554F;&#x4E0D;&#x540C;&#x554F;&#x984C;&#xFF0C;&#x6700;&#x5F8C;&#x5E0C;&#x671B;&#x80FD;&#x7372;&#x5F97;&#x6211;&#x5011;&#x60F3;&#x8981;&#x77E5;&#x9053;&#x7684;&#x95DC;&#x4FC2;&#x6216;&#x7B54;&#x6848;&#x3002;&#x6700;&#x5F8C;&#xFF0C;&#x5C07;&#x6A21;&#x578B;&#x7684;&#x7D50;&#x679C;&#x63D0;&#x4F9B;&#x6C7A;&#x7B56;&#x61C9;&#x7528;&#x7522;&#x751F;&#x6700;&#x7D42;&#x7684;&#x6548;&#x76CA;&#x3002;&#x63DB;&#x53E5;&#x8A71;&#x8AAA;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x672C;&#x8CEA;&#x662F;&#x5229;&#x7528;&#x6A21;&#x578B;&#x53BB;&#x89E3;&#x8B80;&#x4E0D;&#x540C;&#x7684;&#x8CC7;&#x6599;&#x8207;&#x5176;&#x610F;&#x6DB5;&#xFF0C;&#x800C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x5FEB;&#x901F;&#x767C;&#x5C55;&#x6B63;&#x5728;&#x6539;&#x8B8A;&#x77E5;&#x8B58;&#x6216;&#x6C7A;&#x7B56;&#x7684;&#x7522;&#x751F;&#x65B9;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x6A5F;&#x5668;&#x7684;&#x512A;&#x52E2;&#x4F86;&#x8F49;&#x63DB;&#x77E5;&#x8B58;&#xFF0C;&#x964D;&#x4F4E;&#x5C0D;&#x7D93;&#x9A57;&#x7684;&#x4F9D;&#x8CF4;&#xFF0C;&#x90A3;&#x4EBA;&#x5011;&#x5C31;&#x5F97;&#x4EE5;&#x66F4;&#x52A0;&#x5C08;&#x6CE8;&#x65BC;&#x300C;&#x6C7A;&#x7B56;&#x300D;&#x3002;</p>
<h2 id="&#x8CC7;&#x6599;&#x5718;&#x968A;&#x4E2D;&#x89D2;&#x8272;&#x7684;&#x6280;&#x80FD;&#x8207;&#x4EFB;&#x52D9;"><a href="#&#x8CC7;&#x6599;&#x5718;&#x968A;&#x4E2D;&#x89D2;&#x8272;&#x7684;&#x6280;&#x80FD;&#x8207;&#x4EFB;&#x52D9;" class="headerlink" title="&#x8CC7;&#x6599;&#x5718;&#x968A;&#x4E2D;&#x89D2;&#x8272;&#x7684;&#x6280;&#x80FD;&#x8207;&#x4EFB;&#x52D9;"></a>&#x8CC7;&#x6599;&#x5718;&#x968A;&#x4E2D;&#x89D2;&#x8272;&#x7684;&#x6280;&#x80FD;&#x8207;&#x4EFB;&#x52D9;</h2><p>&#x8B1B;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5718;&#x968A;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x6703;&#x60F3;&#x5230;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x300C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#xFF08;Data Scientist&#xFF09;&#x300D;&#x3002;&#x4F46;&#x662F;&#x5BE6;&#x969B;&#x4E0A;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x5176;&#x5BE6;&#x662F;&#x6BD4;&#x8F03;&#x8CC7;&#x6599;/&#x9032;&#x968E;&#x7684;&#x8077;&#x7A2E;&#xFF0C;&#x901A;&#x5E38;&#x7D44;&#x7E54;&#x6703;&#x5F9E;&#x300C;&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x300D;&#x7684;&#x5BE6;&#x73FE;&#x4F86;&#x8A2D;&#x8A08;&#x5718;&#x968A;&#xFF0C;&#x900F;&#x904E;&#x4E0D;&#x540C;&#x7684;&#x5C08;&#x9577;&#x7D44;&#x5408;&#x6210;&#x4E00;&#x500B;&#x5B8C;&#x6574;&#x7684;&#x5718;&#x968A;&#xFF0C;&#x800C;&#x975E;&#x914D;&#x7F6E;&#x5F88;&#x591A;&#x500B;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x3002;</p>
<h3 id="&#x4E09;&#x7A2E;&#x6280;&#x80FD;&#x7684;&#x7C21;&#x55AE;&#x5206;&#x5DE5;"><a href="#&#x4E09;&#x7A2E;&#x6280;&#x80FD;&#x7684;&#x7C21;&#x55AE;&#x5206;&#x5DE5;" class="headerlink" title="&#x4E09;&#x7A2E;&#x6280;&#x80FD;&#x7684;&#x7C21;&#x55AE;&#x5206;&#x5DE5;"></a>&#x4E09;&#x7A2E;&#x6280;&#x80FD;&#x7684;&#x7C21;&#x55AE;&#x5206;&#x5DE5;</h3><p>&#x4E00;&#x822C;&#x4F86;&#x8AAA;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x4F9D;&#x7167;&#x6280;&#x80FD;&#x8207;&#x5DE5;&#x4F5C;&#x7C21;&#x55AE;&#x5206;&#x6210;&#x300C;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x300D;&#x3001;&#x300C;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x548C;&#x300C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x300D;&#x4E09;&#x7A2E;&#x89D2;&#x8272;&#x3002;</p>
<p><img src="https://imgur.com/xhWYhnm.png" alt></p>
<p><strong>&#x8CC7;&#x6599;&#x5206;&#x6790;</strong>&#x5E2B;&#x64C5;&#x9577;&#x5206;&#x6790;&#x61C9;&#x7528;&#xFF0C;&#x8981;&#x627E;&#x8CC7;&#x6599;&#x3001;&#x554F;&#x554F;&#x984C;&#xFF0C;&#x4E3B;&#x8981;&#x4EFB;&#x52D9;&#x662F;&#x627E;&#x5230;&#x5C0D;&#x7684;&#x8CC7;&#x6599;&#x4E26;&#x5F9E;&#x4E2D;&#x767C;&#x73FE;&#x60F3;&#x8981;&#x77E5;&#x9053;&#x7684;&#x95DC;&#x4FC2;&#x3002;&#x5176;&#x95DC;&#x9375;&#x80FD;&#x529B;&#xFF0C;&#x662F;&#x627E;&#x5230;&#x9069;&#x5408;&#x7684;&#x8CC7;&#x6599;&#x4F86;&#x89E3;&#x6C7A;&#x554F;&#x984C;&#x3002;&#x6545;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x9700;&#x8981;&#x6709;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x8CC7;&#x6599;&#x7406;&#x89E3;&#x529B;&#x3001;&#x8207;&#x5B9A;&#x7FA9;&#x554F;&#x984C;&#x7684;&#x654F;&#x92B3;&#x5EA6;&#x3002;<strong>&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;</strong>&#x64C5;&#x9577;&#x7A0B;&#x5F0F;&#x5BE6;&#x4F5C;&#xFF0C;&#x8981;&#x63D0;&#x4F9B;&#x597D;&#x7528;&#x7684;&#x8CC7;&#x6599;&#xFF0C;&#x80FD;&#x5920;&#x628A;&#x8CC7;&#x6599;&#x8B8A;&#x6210;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x6A23;&#x5B50;&#x3001;&#x6216;&#x63D0;&#x4F9B;&#x597D;&#x7528;&#x7684;&#x8CC7;&#x6599;&#x3002;&#x76F8;&#x95DC;&#x4EFB;&#x52D9;&#x5305;&#x62EC;&#x81EA;&#x52D5;&#x5316;&#x8490;&#x96C6;&#x8CC7;&#x6599;&#x3001;&#x81EA;&#x52D5;&#x5316;&#x5206;&#x6790;&#x8CC7;&#x6599;&#x7B49;&#x3002;&#x82E5;&#x672C;&#x8EAB;&#x5DF2;&#x7D93;&#x662F;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x6709;&#x8F03;&#x597D;&#x7684;&#x7A0B;&#x5F0F;&#x638C;&#x63E1;&#x80FD;&#x529B;&#xFF0C;&#x53EF;&#x8003;&#x616E;&#x5F9E;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x958B;&#x555F;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8077;&#x6DAF;&#x3002;<strong>&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;</strong>&#x6703;&#x5C0D;&#x8CC7;&#x6599;&#x554F;&#x51FA;&#x66F4;&#x6DF1;&#x3001;&#x66F4;&#x591A;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x4E26;&#x9032;&#x800C;&#x627E;&#x51FA;&#x66F4;&#x8907;&#x96DC;&#x7684;&#x95DC;&#x4FC2;&#x3002;&#x9019;&#x500B;&#x89D2;&#x8272;&#x9069;&#x5408;&#x672C;&#x8EAB;&#x6709;&#x6578;&#x7406;&#x80CC;&#x666F;&#x3001;&#x5C0D;&#x6A21;&#x578B;&#x7684;&#x638C;&#x63E1;&#x5EA6;&#x8F03;&#x9AD8;&#x7684;&#x4EBA;&#x3002;&#x800C;&#x76F8;&#x8F03;&#x65BC;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x662F;&#x6BD4;&#x8F03;&#x8CC7;&#x6DF1;/&#x9032;&#x968E;&#x7684;&#x89D2;&#x8272;&#x3002;</p>
<p>&#x76F8;&#x5C0D;&#x65BC;&#x8207;&#x5DE5;&#x7A0B;&#x6216;&#x6578;&#x7406;&#x80CC;&#x666F;&#x9023;&#x7D50;&#x6027;&#x8F03;&#x5F37;&#x7684;&#x300C;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x8207;&#x300C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x300D;&#xFF0C;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x662F;&#x500B;&#x80FD;&#x8207;&#x66F4;&#x591A;&#x5143;&#x6280;&#x80FD;&#x7D50;&#x5408;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x5982;&#x7522;&#x54C1;&#x3001;&#x884C;&#x92B7;&#x7B49;&#x3002;&#x6545;&#x672C;&#x8EAB;&#x6709;&#x65E2;&#x6709;&#x5C08;&#x7CBE;&#x9818;&#x57DF;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x8003;&#x616E;&#x5F9E;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#xFF0C;&#x958B;&#x59CB;&#x77AD;&#x89E3;&#x8207;&#x898F;&#x5283;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8077;&#x6DAF;&#x3002;</p>
<h3 id="&#x66F4;&#x52A0;&#x5F48;&#x6027;&#x7684;&#x5718;&#x968A;&#x89D2;&#x8272;"><a href="#&#x66F4;&#x52A0;&#x5F48;&#x6027;&#x7684;&#x5718;&#x968A;&#x89D2;&#x8272;" class="headerlink" title="&#x66F4;&#x52A0;&#x5F48;&#x6027;&#x7684;&#x5718;&#x968A;&#x89D2;&#x8272;"></a>&#x66F4;&#x52A0;&#x5F48;&#x6027;&#x7684;&#x5718;&#x968A;&#x89D2;&#x8272;</h3><p>&#x4E0D;&#x904E;&#x6211;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x6587;&#x7AE0; <a href="https://blog.v123582.tw/2020/10/31/%E7%9C%9F%E3%83%BB%E8%B3%87%E6%96%99%E5%9C%98%E9%9A%8A%E8%88%87%E5%88%86%E5%B7%A5/" target="_blank" rel="noopener">&#x771F;&#xFF0E;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x8207;&#x5206;&#x5DE5;</a> &#x4E5F;&#x6709;&#x63D0;&#x5230;&#x5BE6;&#x969B;&#x4E0A;&#x7684;&#x5206;&#x5DE5;&#x8207;&#x8077;&#x80FD;&#x5176;&#x5BE6;&#x6703;&#x66F4;&#x52A0;&#x8907;&#x96DC;&#x4E00;&#x9EDE;&#xFF0C;&#x539F;&#x672C;&#x7684;&#x5206;&#x5DE5;&#x592A;&#x7D30;&#x7684;&#x72C0;&#x6CC1;&#x4E0B;&#x53EF;&#x80FD;&#x6703;&#x9020;&#x6210;&#x89D2;&#x8272;&#x5B58;&#x5728; GAP &#x8207;&#x4E92;&#x8E22;&#x76AE;&#x7403;&#x7684;&#x72C0;&#x6CC1;&#x3002;&#x56E0;&#x6B64;&#x5E38;&#x898B;&#x6709;&#x4EE5;&#x4E0B;&#x5E7E;&#x7A2E;&#x66FF;&#x4EE3;&#x7684;&#x6280;&#x80FD;&#x8077;&#x7A2E;&#xFF1A;</p>
<p><strong>&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;</strong>&#x9019;&#x662F;&#x4E00;&#x500B;&#x5EF6;&#x4F38;&#x81EA;&#x5206;&#x6790;&#x5E2B;&#x8207;&#x5DE5;&#x7A0B;&#x5E2B;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x904E;&#x53BB;&#x6211;&#x5011;&#x53EF;&#x80FD;&#x6703;&#x62C6;&#x6210;&#x5169;&#x500B;&#x5718;&#x968A;&#x5229;&#x7528;&#x6A21;&#x7D44;&#x7684;&#x65B9;&#x5F0F;&#x4F86;&#x5206;&#x5DE5;&#x3002;&#x4F46;&#x5982;&#x679C;&#x5206;&#x6790;&#x5718;&#x968A;&#x8207;&#x5DE5;&#x7A0B;&#x5718;&#x968A;&#x4EA4;&#x63A5;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x554F;&#x984C;&#x600E;&#x9EBC;&#x8FA6;&#xFF1F;&#x5F88;&#x5BB9;&#x6613;&#x5C31;&#x6703;&#x9677;&#x5165;&#x5169;&#x65B9;&#x90FD;&#x96E3;&#x4EE5;&#x89E3;&#x6C7A;&#x7684;&#x56F0;&#x5883;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x8207;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x9593;&#x884D;&#x4F38;&#x51FA;&#x300C;ML &#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x9019;&#x6A23;&#x7684;&#x8077;&#x7A2E;&#xFF0C;&#x7565;&#x7A2E;&#x4E00;&#x9EDE;&#x6A21;&#x578B;&#x4E5F;&#x7565;&#x61C2;&#x4E00;&#x9EDE;&#x5DE5;&#x7A0B;&#x7684;&#x5B83;&#x80FD;&#x5920;&#x4F5C;&#x70BA;&#x5169;&#x8005;&#x9593;&#x7684;&#x6A4B;&#x6A11;&#x3002;&#x53E6;&#x4E00;&#x500B;&#x5E38;&#x898B;&#x7684;&#x60C5;&#x5883;&#x662F;&#xFF0C;&#x6700;&#x7D42;&#x5C07;&#x6A21;&#x578B;&#x4EA4;&#x7531;&#x5DE5;&#x7A0B;&#x5E2B;&#x90E8;&#x7F72;&#x4E0A;&#x7DDA;&#x4E4B;&#x5F8C;&#x3002;&#x53EF;&#x80FD;&#x6703;&#x9047;&#x5230;&#x91CD;&#x8981;&#x7684;&#x932F;&#x8AA4;&#x51FA;&#x73FE;&#x6216;&#x9700;&#x8981;&#x9031;&#x671F;&#x6027;&#x7684;&#x66F4;&#x65B0;&#x6642;&#xFF0C;&#x5F80;&#x5F80;&#x90FD;&#x6703;&#x9700;&#x8981;&#x6574;&#x500B;&#x6D41;&#x7A0B;&#x91CD;&#x65B0;&#x8DD1;&#x4E00;&#x6B21;&#x3002;&#x5728;&#x50B3;&#x7D71;&#x7684;&#x958B;&#x767C;&#x6A21;&#x5F0F;&#x7576;&#x4E2D;&#xFF0C;&#x6703;&#x6709;&#x7DAD;&#x904B;&#x7684;&#x5DE5;&#x7A0B;&#x5E2B;&#x8CA0;&#x8CAC;&#x5F9E;&#x958B;&#x767C;&#x5230;&#x4E0A;&#x7DDA;&#x81EA;&#x52D5;&#x5316;&#x7684;&#x878D;&#x5408;&#x6210;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5DE5;&#x4F5C;&#x7DDA;&#x3002;&#x9019;&#x6A23;&#x7684;&#x60F3;&#x6CD5;&#x8F49;&#x79FB;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x60C5;&#x5883;&#x7576;&#x4E2D;&#xFF0C;&#x88AB;&#x7A31;&#x70BA;&#x662F; <strong>MLOPs &#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x7DAD;&#x904B;&#x5DE5;&#x7A0B;&#x5E2B;</strong>&#xFF0C;&#x4E3B;&#x8981;&#x6982;&#x5FF5;&#x662F;&#x5C07;&#x6A21;&#x578B;&#x7684;&#x8A13;&#x7DF4;&#x8207;&#x90E8;&#x7F72;&#x66F4;&#x52A0;&#x7DCA;&#x7DCA;&#x7684;&#x81EA;&#x52D5;&#x5316;&#x3002;</p>
<p><img src="https://imgur.com/NPmpIsp.png" alt="https://www.oreilly.com/radar/data-engineers-vs-data-scientists/"></p>
<p>&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x7684;&#x4E5F;&#x6709;&#x5169;&#x7A2E;&#x4E0D;&#x540C;&#x9762;&#x5411;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#xFF1A;&#x300C;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x548C;&#x300C;&#x5546;&#x696D;&#x5206;&#x6790;&#x5E2B;&#x300D;&#x3002;<strong>&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5DE5;&#x7A0B;&#x5E2B;</strong>&#xFF08;Analytics Engineers&#xFF09;&#x662F;&#x4ECB;&#x65BC;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x8207;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x6BD4;&#x8D77;&#x50B3;&#x7D71;&#x7684;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x66F4;&#x591A;&#x4E86;&#x4E00;&#x9EDE;&#x5206;&#x6790;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x5F9E;&#x8077;&#x80FD;&#x4F86;&#x89E3;&#x8B80;&#x300C;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x7684;&#x8A71;&#xFF0C;&#x66F4;&#x5C08;&#x6CE8;&#x5728;&#x7522;&#x51FA;&#x53EF;&#x7528;&#x7684;&#x8CC7;&#x6599;&#x63D0;&#x4F9B;&#x5206;&#x6790;&#xFF08;&#x66F4;&#x591A;&#x7D30;&#x7BC0;&#x53EF;&#x4EE5;&#x53C3;&#x8003; <a href="https://www.facebook.com/modernanalyticseng" target="_blank" rel="noopener">&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5DE5;&#x7A0B;&#x624B;&#x672D;&#x7C89;&#x5C08;</a>&#xFF09;&#x3002;<strong>&#x5546;&#x696D;&#x5206;&#x6790;&#x5E2B;</strong>&#x662F;&#x8655;&#x7406;&#x5546;&#x696D;&#x554F;&#x984C;&#x7684;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#xFF0C;&#x64C1;&#x6709;&#x6FC3;&#x539A;&#x7684;&#x8DE8;&#x9818;&#x57DF;&#x8272;&#x5F69;&#xFF0C;&#x4E5F;&#x8CA0;&#x8CAC;&#x8F49;&#x8B6F;&#x7684;&#x4EFB;&#x52D9;&#x3002;&#x5F9E;&#x8CC7;&#x6599;&#x6280;&#x80FD;&#x7684;&#x89D2;&#x5EA6;&#x4F86;&#x770B;&#x6703;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x5167;&#x5BB9;&#x8DDF;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x91CD;&#x758A;&#xFF0C;&#x4F46;&#x5F9E;&#x4F7F;&#x7528;&#x5834;&#x666F;&#x4F86;&#x770B;&#x53EF;&#x4EE5;&#x660E;&#x986F;&#x770B;&#x51FA;&#x5DEE;&#x7570;&#x3002;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x6BD4;&#x8F03;&#x5F37;&#x8ABF;&#x7684;&#x662F;&#x300C;&#x5982;&#x4F55;&#x627E;&#x5230;&#x9069;&#x5408;&#x8CC7;&#x6599;&#x53EF;&#x4EE5;&#x89E3;&#x6C7A;&#x7684;&#x554F;&#x984C;&#x300D;&#xFF0C;&#x5C0D;&#x8CC7;&#x6599;&#x7406;&#x89E3;&#x8207;&#x5B9A;&#x7FA9;&#x554F;&#x984C;&#x7684;&#x654F;&#x92B3;&#x5EA6;&#x3002;&#x5C31;&#x6211;&#x6240;&#x77E5;&#xFF0C;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x5728;&#x8CC7;&#x6599;&#x63A2;&#x7D22;&#x53CA;&#x8CC7;&#x6599;&#x8996;&#x89BA;&#x5316;&#x7684;&#x8981;&#x6C42;&#x6703;&#x9AD8;&#x4E00;&#x9EDE;&#x3002;&#x800C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x5247;&#x66F4;&#x91CD;&#x8996;&#x6A21;&#x578B;&#x8207;&#x7406;&#x8AD6;&#xFF0C;&#x9700;&#x8981;&#x6BD4;&#x8F03;&#x5B8C;&#x6574;&#x7684;&#x8CC7;&#x6599;&#x77E5;&#x8B58;&#x9AD4;&#x7CFB;&#xFF0C;&#x4F8B;&#x5982;&#x7D71;&#x8A08;&#xFF0C;&#x6700;&#x4F73;&#x5316;&#x53CA;&#x8CC7;&#x6599;&#x6A21;&#x578B;&#x9019;&#x65B9;&#x4FBF;&#x7684;&#x4E86;&#x89E3;&#x3002;</p>
<p><img src="https://imgur.com/U9AnhZr.png" alt="https://blog.getdbt.com/how-to-find-a-role-in-analytics-engineering/"></p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x56E0;&#x61C9;&#x4E0D;&#x540C;&#x7684;&#x5718;&#x968A;&#x5834;&#x5F71;&#x4E5F;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8077;&#x7A2E;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5BE6;&#x73FE;&#x8CC7;&#x6599;&#x6536;&#x96C6;&#x7684;&#x81EA;&#x52D5;&#x5316;&#x7684;&#x300C;&#x722C;&#x87F2;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;</li>
<li>&#x7D9C;&#x5408;&#x5DE5;&#x7A0B;&#x5E2B;&#x8207;&#x6578;&#x7406;&#x6A21;&#x578B;&#x7684;&#x300C;&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;</li>
<li>&#x61C9;&#x7528;&#x65BC;&#x4E0D;&#x540C;&#x9818;&#x57DF;&#x7684;&#x300C;&#x751F;&#x91AB;&#x7D71;&#x8A08;&#x5B78;&#x5BB6;&#x300D;&#x3001;&#x300C;&#x91D1;&#x878D;/&#x8A08;&#x91CF;&#x5206;&#x6790;&#x5E2B;&#x300D;</li>
<li>&#x7814;&#x7A76;&#x65BC;&#x7279;&#x5B9A;&#x6A21;&#x578B;&#x7684;&#x300C;&#x96FB;&#x8166;&#x8996;&#x89BA;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x6216;&#x300C;&#x81EA;&#x7136;&#x8A9E;&#x8A00;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;</li>
</ul>
<h2 id="&#x9010;&#x6B65;&#x6210;&#x9577;&#x7684;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x914D;&#x7F6E;"><a href="#&#x9010;&#x6B65;&#x6210;&#x9577;&#x7684;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x914D;&#x7F6E;" class="headerlink" title="&#x9010;&#x6B65;&#x6210;&#x9577;&#x7684;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x914D;&#x7F6E;"></a>&#x9010;&#x6B65;&#x6210;&#x9577;&#x7684;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x914D;&#x7F6E;</h2><p>&#x8CC7;&#x6599;&#x5718;&#x968A;&#x53EF;&#x4EE5;&#x6839;&#x64DA;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x62C6;&#x6210;&#x56DB;&#x500B;&#x4E3B;&#x8981;&#x7684;&#x4EFB;&#x52D9;&#xFF1A;&#x8CC7;&#x6599;&#x63A2;&#x7D22;&#x3001;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x3001;&#x5206;&#x6790;&#x6A21;&#x578B;&#x8207;&#x7406;&#x8AD6;&#x7814;&#x7A76;&#x3002;&#x4F46;&#x5BE6;&#x52D9;&#x4E0A;&#xFF0C;&#x5247;&#x6703;&#x4F9D;&#x64DA;&#x5718;&#x968A;&#x7684;&#x898F;&#x6A21;&#x8207;&#x767C;&#x5C55;&#x968E;&#x6BB5;&#x52A0;&#x5165;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x5F88;&#x96E3;&#x5728;&#x521D;&#x671F;&#x5C0E;&#x5165;&#x5C31;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x6700;&#x5F8C;&#x4E00;&#x6BB5;&#x60F3;&#x804A;&#x804A;&#xFF0C;&#x904E;&#x53BB;&#x770B;&#x5230;&#x7684;&#x5E7E;&#x7A2E;&#x5718;&#x968A;&#x914D;&#x7F6E;&#x65B9;&#x5F0F;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x6253;&#x9020;&#x9010;&#x6B65;&#x6210;&#x9577;&#x7684;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x3002;</p>
<p><img src="https://imgur.com/SlF7M7Q.png" alt></p>
<h3 id="&#x525B;&#x8D77;&#x6B65;&#x7684;&#x4E00;&#x4EBA;&#x8CC7;&#x6599;&#x5718;&#x968A;"><a href="#&#x525B;&#x8D77;&#x6B65;&#x7684;&#x4E00;&#x4EBA;&#x8CC7;&#x6599;&#x5718;&#x968A;" class="headerlink" title="&#x525B;&#x8D77;&#x6B65;&#x7684;&#x4E00;&#x4EBA;&#x8CC7;&#x6599;&#x5718;&#x968A;"></a>&#x525B;&#x8D77;&#x6B65;&#x7684;&#x4E00;&#x4EBA;&#x8CC7;&#x6599;&#x5718;&#x968A;</h3><p>&#x7576;&#x5718;&#x968A;&#x53EA;&#x6709;&#x4E00;&#x4EBA;&#x6642;&#xFF0C;&#x901F;&#x5EA6;&#x6642;&#x5E38;&#x6703;&#x6BD4;&#x5B8C;&#x6574;&#x5EA6;&#x9084;&#x8981;&#x91CD;&#x8981;&#x3002;&#x800C;&#x5728;&#x6B64;&#x968E;&#x6BB5;&#xFF0C;&#x6703;&#x8996;&#x662F;&#x5426;&#x6709;&#x6A21;&#x578B;&#x9700;&#x6C42;&#xFF0C;&#x4F86;&#x6C7A;&#x5B9A;&#x8981;&#x4E0D;&#x8981;&#x627E;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x6216;&#x5DE5;&#x7A0B;&#x5E2B;&#x3002;&#x5982;&#x679C;&#x516C;&#x53F8;&#x5DF2;&#x7D93;&#x6709;&#x8CC7;&#x6599;&#x3001;&#x8CC7;&#x6599;&#x5EAB;&#x7CFB;&#x7D71;&#x6642;&#xFF0C;&#x9700;&#x8981;&#x5C0D;&#x73FE;&#x6709;&#x8CC7;&#x6599;&#x9032;&#x884C;&#x63A2;&#x7D22;&#x6216;&#x5206;&#x6790;&#x7684;&#x8A71;&#xFF0C;&#x53EF;&#x4EE5;&#x4E00;&#x500B;&#x914D;&#x7F6E;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x6216;&#x5546;&#x696D;&#x5206;&#x6790;&#x5E2B;&#x3002;&#x6709;&#x5546;&#x696D;&#x8207;&#x5206;&#x6790;&#x89C0;&#x5FF5;&#x7684;&#x5206;&#x6790;&#x5E2B;&#xFF0C;&#x80FD;&#x5920;&#x642D;&#x914D;&#x5DE5;&#x5177;&#x5C0D;&#x8CC7;&#x6599;&#x9032;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x5FEB;&#x901F;&#x6EFF;&#x8DB3;&#x300C;&#x7522;&#x51FA;&#x6709;&#x6548;&#x7684;&#x6D1E;&#x5BDF;&#x300D;&#x3002;</p>
<p><img src="https://imgur.com/rWZ0eK4.png" alt></p>
<p>&#x800C;&#x5982;&#x679C;&#x516C;&#x53F8;&#x662F;&#x6C92;&#x6709;&#x8CC7;&#x6599;&#x5EAB;&#x6216;&#x5C1A;&#x672A;&#x6574;&#x5408;&#x5916;&#x90E8;&#x8CC7;&#x6599;&#x4F86;&#x6E90;&#x6642;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x975E;&#x8CC7;&#x6599;&#x80CC;&#x666F;&#x7684;&#x540C;&#x4E8B;&#x6709;&#x4E00;&#x5957;&#x642D;&#x914D;&#x5DE5;&#x5177;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x5DE5;&#x5177;&#x8655;&#x7406;&#x5DE5;&#x4F5C;&#x65E5;&#x5E38;&#x3002;&#x9019;&#x500B;&#x6642;&#x5019;&#x53EF;&#x80FD;&#x6703;&#x9700;&#x8981;&#x5F9E;&#x300C;&#x8CC7;&#x6599;&#x7BA1;&#x7DDA;&#x300D;&#x7684;&#x57FA;&#x790E;&#x9762;&#x958B;&#x59CB;&#x5EFA;&#x7F6E;&#x6642;&#xFF0C;&#x300C;&#x5DE5;&#x7A0B;&#x300D;&#x7684;&#x9700;&#x6C42;&#x5C31;&#x986F;&#x5F97;&#x66F4;&#x70BA;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x6B64;&#x9996;&#x9078;&#x5C31;&#x6703;&#x662F;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x6216;&#x7684;&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;&#x3002;</p>
<h3 id="&#x5F9E;&#x63A2;&#x7D22;&#x5230;&#x81EA;&#x52D5;&#x5316;&#x7684;&#x5169;&#x4EBA;&#x5718;&#x968A;"><a href="#&#x5F9E;&#x63A2;&#x7D22;&#x5230;&#x81EA;&#x52D5;&#x5316;&#x7684;&#x5169;&#x4EBA;&#x5718;&#x968A;" class="headerlink" title="&#x5F9E;&#x63A2;&#x7D22;&#x5230;&#x81EA;&#x52D5;&#x5316;&#x7684;&#x5169;&#x4EBA;&#x5718;&#x968A;"></a>&#x5F9E;&#x63A2;&#x7D22;&#x5230;&#x81EA;&#x52D5;&#x5316;&#x7684;&#x5169;&#x4EBA;&#x5718;&#x968A;</h3><p>&#x96A8;&#x8457;&#x300C;&#x8CC7;&#x6599;&#x300D;&#x7684;&#x6548;&#x76CA;&#x63D0;&#x5347;&#x6642;&#xFF0C;&#x53EF;&#x80FD;&#x958B;&#x59CB;&#x9700;&#x8981;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x7684;&#x7D44;&#x6210;&#x3002;&#x901A;&#x5E38;&#x53EA;&#x662F;&#x300C;&#x6709;&#x8CC7;&#x6599;&#x300D;&#x4E14;&#x300C;&#x6709;&#x9700;&#x6C42;&#x300D;&#x5169;&#x500B;&#x689D;&#x4EF6;&#x90FD;&#x6210;&#x7ACB;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#x3002;&#x9019;&#x500B;&#x6642;&#x5019;&#x5176;&#x4E2D;&#x4E00;&#x500B;&#x89D2;&#x8272;&#x6703;&#x662F;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#xFF0C;&#x5C08;&#x6CE8;&#x5728;&#x8CC7;&#x6599;&#x63A2;&#x7D22;&#xFF1B;&#x800C;&#x53E6;&#x4E00;&#x500B;&#x89D2;&#x8272;&#x5247;&#x662F;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x5C08;&#x6CE8;&#x5728;&#x5982;&#x4F55;&#x7528;&#x81EA;&#x52D5;&#x5316;&#x7522;&#x751F;&#x7D50;&#x679C;&#x3002;</p>
<p><img src="https://imgur.com/fWmpUxU.png" alt></p>
<p>&#x5169;&#x4EBA;&#x6578;&#x64DA;&#x5718;&#x968A;&#x901A;&#x5E38;&#x76EE;&#x6A19;&#x5728;&#x65BC;&#x80FD;&#x5920;&#x81EA;&#x52D5;&#x5316;&#x6536;&#x96C6;&#x8CC7;&#x6599;&#x4E14;&#x7522;&#x51FA;&#x8CC7;&#x6599;&#xFF0C;&#x6700;&#x5E38;&#x898B;&#x7684;&#x61C9;&#x7528;&#x53EF;&#x80FD;&#x662F;&#x5167;&#x90E8;&#x7684;&#x8CC7;&#x6599;&#x770B;&#x677F;&#xFF08;Dashboard&#xFF09;&#x6216;&#x9031;&#x671F;&#x6027;&#x7684;&#x5831;&#x8868;&#x3002;&#x9019;&#x500B;&#x968E;&#x6BB5;&#x5C0D;&#x65BC;&#x6A21;&#x578B;&#x9084;&#x5728;&#x6BD4;&#x8F03;&#x5617;&#x8A66;&#x6216;&#x662F;&#x89C0;&#x671B;&#x7684;&#x968E;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5957;&#x4EF6;&#x7522;&#x51FA;&#x7D50;&#x679C;&#xFF0C;&#x4F46;&#x80FD;&#x5B8C;&#x6574;&#x8CC7;&#x6599;&#x9A45;&#x52D5;&#x7684;&#x6548;&#x76CA;&#x4E0A;&#x4E0D;&#x660E;&#x78BA;&#x3002;</p>
<h3 id="&#x5C0E;&#x5165;&#x5206;&#x6790;&#x6A21;&#x578B;&#x7684;&#x5718;&#x968A;"><a href="#&#x5C0E;&#x5165;&#x5206;&#x6790;&#x6A21;&#x578B;&#x7684;&#x5718;&#x968A;" class="headerlink" title="&#x5C0E;&#x5165;&#x5206;&#x6790;&#x6A21;&#x578B;&#x7684;&#x5718;&#x968A;"></a>&#x5C0E;&#x5165;&#x5206;&#x6790;&#x6A21;&#x578B;&#x7684;&#x5718;&#x968A;</h3><p>&#x6700;&#x7D42;&#x7576;&#x5718;&#x968A;&#x60F3;&#x5C0E;&#x5165;&#x66F4;&#x8907;&#x96DC;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x5C31;&#x6703;&#x9700;&#x8981;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x6216;&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;&#x7684;&#x89D2;&#x8272;&#x3002;&#x9019;&#x500B;&#x6642;&#x5019;&#x9664;&#x4E86;&#x5FC5;&#x9808;&#x8981;&#x6709;&#x300C;&#x8CC7;&#x6599;&#x9762;&#x300D;&#x3001;&#x300C;&#x5206;&#x6790;&#x9762;&#x300D;&#x7684;&#x6280;&#x80FD;&#x4E4B;&#x5916;&#xFF0C;&#x6709;&#x9700;&#x8981;&#x6709;&#x5C0D;&#x5916;&#x4E4B;&#x53EF;&#x80FD;&#x6027;&#x63A2;&#x7D22;&#x7684;&#x7A7A;&#x9593;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x80FD;&#x5920;&#x5F9E;&#x8CC7;&#x6599;&#x4E2D;&#x554F;&#x51FA;&#x6709;&#x610F;&#x7FA9;&#x6709;&#x50F9;&#x503C;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x9032;&#x800C;&#x4F7F;&#x7528;&#x5408;&#x9069;&#x7684;&#x6A21;&#x578B;&#x9032;&#x884C;&#x5206;&#x6790;&#x3002;</p>
<p><img src="https://imgur.com/9bUePyJ.png" alt></p>
<p>&#x300C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x300D;&#x8207;&#x300C;&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x5728;&#x9019;&#x88E1;&#x7684;&#x5DEE;&#x5225;&#x4E3B;&#x8981;&#x662F;&#x7814;&#x7A76;&#x7A0B;&#x5EA6;&#x7684;&#x591A;&#x5BE1;&#xFF0C;&#x4E0D;&#x7136;&#x5728;&#x5DE5;&#x4F5C;&#x4EFB;&#x52D9;&#x4E0A;&#x5176;&#x5BE6;&#x4E0D;&#x6703;&#x5DEE;&#x592A;&#x591A;&#x3002;</p>
<h2 id="&#x8CC7;&#x6599;&#x5718;&#x968A;&#x5DF2;&#x5C31;&#x4F4D;&#x7136;&#x5F8C;&#x5462;"><a href="#&#x8CC7;&#x6599;&#x5718;&#x968A;&#x5DF2;&#x5C31;&#x4F4D;&#xFF0C;&#x7136;&#x5F8C;&#x5462;&#xFF1F;" class="headerlink" title="&#x8CC7;&#x6599;&#x5718;&#x968A;&#x5DF2;&#x5C31;&#x4F4D;&#xFF0C;&#x7136;&#x5F8C;&#x5462;&#xFF1F;"></a>&#x8CC7;&#x6599;&#x5718;&#x968A;&#x5DF2;&#x5C31;&#x4F4D;&#xFF0C;&#x7136;&#x5F8C;&#x5462;&#xFF1F;</h2><p>&#x5F9E;&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x3001;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x7684;&#x89D2;&#x8272;&#x5206;&#x5DE5;&#x4EE5;&#x53CA;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x6703;&#x5982;&#x4F55;&#x914D;&#x7F6E;&#xFF0C;&#x4E09;&#x500B;&#x9762;&#x5411;&#x89E3;&#x6790;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x7684;&#x7684;&#x914D;&#x7F6E;&#x3002;&#x4F46;&#x6709;&#x4E86;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x662F;&#x4EC0;&#x9EBC;&#xFF1F;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x8981;&#x600E;&#x9EBC;&#x6A23;&#x624D;&#x80FD;&#x767C;&#x63EE;&#x66F4;&#x5927;&#x7684;&#x6548;&#x76CA;&#x5462;&#xFF1F;&#x9019;&#x4E9B;&#x90FD;&#x662F;&#x6709;&#x4E86;&#x5718;&#x968A;&#x4E4B;&#x5F8C;&#x9700;&#x8981;&#x7169;&#x60F1;&#x7684;&#x8B70;&#x984C;&#x3002;&#x6240;&#x4EE5;&#x5EFA;&#x7ACB;&#x8CC7;&#x6599;&#x5718;&#x968A;&#x53EA;&#x662F;&#x516C;&#x53F8;&#x5C0D;&#x65BC;&#x8CC7;&#x6599;&#x6587;&#x5316;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x6311;&#x6230;&#x624D;&#x6B63;&#x8981;&#x958B;&#x59CB;&#x3002;</p>
<p><br></p>
<!-- Begin Mailchimp Signup Form -->
<p><div id="mc_embed_signup"><form action="https://accupass.us6.list-manage.com/subscribe/post?u=840b112be5bede36036e19d3e&amp;id=d23f3a8e3a" method="post" id="mc-embedded-subscribe-form" name="mc-embedded-subscribe-form" class="validate" target="_blank" novalidate><div id="mc_embed_signup_scroll"><label for="mce-EMAIL">&#x5982;&#x679C;&#x60F3;&#x7372;&#x5F97;&#x6700;&#x65B0;&#x7684;&#x6280;&#x8853;&#x8CC7;&#x8A0A;&#xFF0C;&#x6B61;&#x8FCE;&#x8A02;&#x95B1;&#x8FFD;&#x8E64;&#xFF1A;</label><input type="email" value name="EMAIL" class="email" id="mce-EMAIL" placeholder="email address" required><div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_840b112be5bede36036e19d3e_d23f3a8e3a" tabindex="-1" value></div><div class="clear"><input type="submit" value="Subscribe" name="subscribe" id="mc-embedded-subscribe" class="button"></div></div></form></div><br><!--End mc_embed_signup--></p>
<hr>
<p style="color: #6d9eeb"><br>&#x55E8;&#xFF0C;&#x6211;&#x662F;&#x7DAD;&#x5143;&#xFF0C;&#x8FD1;&#x671F;&#x63A8;&#x51FA;&#x4E00;&#x500B;&#x5168;&#x65B0;&#x578B;&#x614B;&#x7684;&#x3010; Python &#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x6559;&#x5B78;&#x5BE6;&#x6230;&#x71DF; &#x3011;&#xFF0C;&#x7D50;&#x5408;&#x591A;&#x5143;&#x6559;&#x5B78;&#x5F62;&#x5F0F;&#x53CA;&#x8C50;&#x5BCC;&#x8AB2;&#x7A0B;&#x7D93;&#x9A57;&#x5E6B;&#x52A9;&#x4F60;&#x66F4;&#x6709;&#x6548;&#x5730;&#x5B78;&#x7FD2;&#x3002;&#x65B0;&#x8AB2;&#x7A0B;&#x300C;<a href="https://dscareer.kolable.app/" style="color: #ff0000; font-weight: bold; text-decoration: underline;" target="_blank" rel="noopener"> Python &#x7A0B;&#x5F0F;&#x8A2D;&#x8A08;&#x57FA;&#x790E;&#x990A;&#x6210; </a>&#x300D;&#x6B63;&#x5728;&#x65E9;&#x9CE5;&#x52DF;&#x8CC7;&#x4E2D;&#xFF0C;&#x6B61;&#x8FCE;&#x4F60;&#x4E00;&#x8D77;&#x52A0;&#x5165;&#x8CC7;&#x6599;&#x9818;&#x57DF;&#xFF01;&#x8AA0;&#x646F;&#x7684;&#x9080;&#x8ACB;&#x4F60;&#x8DDF;&#x8457;&#x6211;&#x5011;&#x4E00;&#x8D77;&#x5F9E; Python &#x5165;&#x9580;&#x958B;&#x59CB;&#xFF0C;&#x8D70;&#x9032;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x4E16;&#x754C; &#x1F64C;<br><br><img src="https://imgur.com/Auy0xA3.png" alt><br><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://dscareer.kolable.app/" target="_blank" rel="noopener">https://dscareer.kolable.app/</a><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://dscareer.kolable.app/" target="_blank" rel="noopener">https://dscareer.kolable.app/</a><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://dscareer.kolable.app/" target="_blank" rel="noopener">https://dscareer.kolable.app/</a><br><br></p>

<hr>
<h2 id="license"><a href="#License" class="headerlink" title="License"></a>License</h2><p><img src="http://i.creativecommons.org/l/by-sa/3.0/88x31.png" style="    margin: 0;"><br>&#x672C;&#x8457;&#x4F5C;&#x7531;<a href="https://www.facebook.com/v123582" target="_blank" rel="noopener">Chang Wei-Yaun (v123582)</a>&#x88FD;&#x4F5C;&#xFF0C;<br>&#x4EE5;<a href="http://creativecommons.org/licenses/by-sa/3.0/deed.zh_TW" target="_blank" rel="noopener">&#x5275;&#x7528;CC &#x59D3;&#x540D;&#x6A19;&#x793A;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5206;&#x4EAB; 3.0 Unported</a>&#x6388;&#x6B0A;&#x689D;&#x6B3E;&#x91CB;&#x51FA;&#x3002;</p>
</div><div class="post-nav"><a href="/2022/03/29/入門自然語言處理，你可以這樣做/" class="pre"><i class="icon-previous">入門自然語言處理，你可以這樣做</i></a><a href="/2021/09/09/爬蟲又被擋了怎麼了？常見的反爬蟲處理策略/" class="next">爬蟲又被擋了怎麼辦？常見的反爬蟲處理策略<i class="icon-next"></i></a></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><div class="widget-title">Information</div><ul><div class="tags">標籤：<a href="/tags/資料科學系列/">資料科學系列 </a></div><div class="categories">分類：<a href="/categories/Data-Science/">Data Science</a></div></ul></div><div class="widget"><div class="widget-title">Table of Content</div><div class="clear"><div id="toc" class="toc-article"><div class="toc"></div></div></div></div><script type="text/javascript" src="//js1.bloggerads.net/ShowAds.aspx?blogid=20190326000001" async></script></div></div></div><div id="footer">© <a href="/" rel="nofollow">資料科學家的工作日常.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><script src="/js/jquery.min.js"></script>
<script src="/js/share.js"></script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script><a id="rocket" href="#top" class="show"></a><script src="/js/jquery.min.js"></script>
<script src="/js/totop.js"></script><script src="/js/fancybox.pack.js"></script>
<script src="/js/jquery.fancybox.js"></script><link rel="stylesheet" href="/css/jquery.fancybox.css"><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
ga('create','UA-59103909-1','auto');ga('send','pageview');
</script></div><!-- hexo-inject:begin --><!-- hexo-inject:end --></body></html>