<!DOCTYPE html><html lang="zh-TW"><head><meta name="generator" content="Hexo 3.9.0"><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><meta property="og:image" content="https://avatars2.githubusercontent.com/u/5959524?v=3&amp;s=300"><meta property="og:description" content="WeiYuan Note | 想進入資料科學領域的你，該如何起步？"><meta property="og:title" content="想進入資料科學領域的你，該如何起步？"><title>想進入資料科學領域的你，該如何起步？ | 資料科學家的工作日常</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"><link rel="stylesheet" type="text/css" href="/css/pure-min.css"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css"><link rel="stylesheet" type="text/css" href="/css/profile-card.css"><link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.4.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"><link href="//cdn-images.mailchimp.com/embedcode/slim-10_7.css" rel="stylesheet" type="text/css"><script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><script><!-- hexo-inject:begin --><!-- hexo-inject:end -->(adsbygoogle = window.adsbygoogle || []).push({
google_ad_client: "ca-pub-7913880396333307",
enable_page_level_ads: true
});


</script><!-- hexo-inject:begin --><!-- hexo-inject:end --></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">想進入資料科學領域的你，該如何起步？</h1><a id="logo" href="https://v123582.github.io">資料科學家的工作日常</a><p class="description">#遠端 #斜槓 #教學 #資料科學 #網站開發</p></div><div id="nav-menu"><a href="https://v123582.github.io/about"><i class="icon-about"> 關於</i></a><a href="https://v123582.github.io/project"><i class="fa fa-tasks"> 專案</i></a><a href="https://v123582.github.io/blog"><i class="icon-archive"> 技術</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post post-page"><h1 class="post-title"><span><i class="fa fa-star"></i></span>想進入資料科學領域的你，該如何起步？</h1><div class="post-meta">2023-04-09 | WeiYuan (@v123582)</div><a data-url="https://blog.v12358.tw/2023/04/09/想進入資料科學領域的你，該如何起步？/" data-id="clrhddt6p004rvsob2k4yk5ty" class="article-share-link">Share</a><div class="post-content"><p>&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x662F;&#x4E00;&#x7A2E;&#x89E3;&#x6C7A;&#x554F;&#x984C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x80FD;&#x5920;&#x61C9;&#x7528;&#x65BC;&#x5404;&#x7A2E;&#x5546;&#x696D;&#x6216;&#x5176;&#x4ED6;&#x5834;&#x666F;&#x7684;&#x554F;&#x984C;&#x3002;&#x9019;&#x5E7E;&#x5E74;&#x4E5F;&#x84EC;&#x52C3;&#x7684;&#x61C9;&#x7528;&#x65BC;&#x4E0D;&#x540C;&#x7684;&#x7522;&#x696D;&#x7576;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x91D1;&#x878D;&#x79D1;&#x6280;&#xFF08;Fintech&#xFF09;&#x6216;&#x884C;&#x92B7;&#x79D1;&#x6280;&#xFF08;Martech&#xFF09;&#x4E4B;&#x985E;&#x7684;&#x65B0;&#x8208;&#x9818;&#x57DF;&#x4E2D;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5728;&#x79D1;&#x6280;&#x4E2D;&#x7684;&#x5F71;&#x5B50;&#x3002;&#x800C;&#x5F9E;&#x6211;&#x5011;&#x904E;&#x53BB;&#x7684;&#x7D93;&#x9A57;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x767C;&#x73FE;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x80CC;&#x666F;&#x6A23;&#x8C8C;&#x975E;&#x5E38;&#x591A;&#x5143;&#xFF0C;&#x6709;&#x4F86;&#x81EA;&#x7684;&#x96FB;&#x8166;&#x79D1;&#x5B78;&#x3001;&#x6578;&#x5B78;&#x7D71;&#x8A08;&#x3001;&#x5546;&#x7BA1;&#x5B78;&#x79D1;&#xFF0C;&#x751A;&#x81F3;&#x65BC;&#x4EBA;&#x6587;&#x793E;&#x6703;&#x80CC;&#x666F;&#x7684;&#x4E5F;&#x5404;&#x81EA;&#x767C;&#x5C55;&#x51FA;&#x7368;&#x7279;&#x8077;&#x6DAF;&#x8DEF;&#x5F91;&#x3002;&#x5728;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8D8A;&#x4F86;&#x8D8A;&#x71B1;&#x9580;&#x4E0B;&#xFF0C;&#x8A72;&#x5982;&#x4F55;&#x6210;&#x70BA;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x662F;&#x8A31;&#x591A;&#x4EBA;&#x597D;&#x5947;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x90A3;&#x9EBC;&#x7A76;&#x7ADF;&#x8A72;&#x600E;&#x9EBC;&#x9EDE;&#x6280;&#x80FD;&#x6A39;&#x548C;&#x898F;&#x5283;&#x8077;&#x6DAF;&#x5462;&#xFF1F;</p>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><h2 id="&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684;&#x6280;&#x80FD;&#x990A;&#x6210;"><a href="#&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684;&#x6280;&#x80FD;&#x990A;&#x6210;" class="headerlink" title="&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684;&#x6280;&#x80FD;&#x990A;&#x6210;"></a>&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684;&#x6280;&#x80FD;&#x990A;&#x6210;</h2><p>&#x4E00;&#x822C;&#x4F86;&#x8AAA;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x9700;&#x8981;&#x5177;&#x5099;3&#x5927;&#x6838;&#x5FC3;&#x80FD;&#x529B;&#xFF1A;&#x7A0B;&#x5F0F;&#x958B;&#x767C;&#x3001;&#x6578;&#x7406;&#x63A8;&#x5C0E;&#x8207;&#x5C08;&#x696D;&#x9818;&#x57DF;&#x61C9;&#x7528;&#xFF0C;&#x5176;&#x4E2D;&#x5C0D;&#x61C9;&#x7684;&#x76F8;&#x95DC;&#x7CFB;&#x6240;&#xFF0C;&#x5206;&#x5225;&#x662F;&#x8CC7;&#x5DE5;&#x3001;&#x8CC7;&#x7BA1;&#xFF1B;&#x6578;&#x5B78;&#x3001;&#x7D71;&#x8A08;&#xFF1B;&#x5546;&#x7BA1;&#x6216;&#x5176;&#x4ED6;&#x5C08;&#x696D;&#x9818;&#x57DF;&#x3002;&#x53EF;&#x4EE5;&#x5F97;&#x77E5;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x662F;&#x4E00;&#x7A2E;&#x8DE8;&#x9818;&#x57DF;&#x7684;&#x80FD;&#x529B;&#x3002;&#x4F86;&#x81EA;&#x4E0D;&#x540C;&#x9818;&#x57DF;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x6709;&#x6A5F;&#x6703;&#x6210;&#x70BA;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x3002;&#x56E0;&#x70BA;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x6280;&#x80FD;&#x662F;&#x7D9C;&#x5408;&#x6027;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x6545;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x5FC5;&#x9700;&#x540C;&#x6642;&#x6703;&#x4E0D;&#x540C;&#x9818;&#x57DF;&#x6280;&#x80FD;&#xFF0C;&#x66F4;&#x9700;&#x8981;&#x8DE8;&#x9818;&#x57DF;&#x5408;&#x4F5C;&#x3002;&#x7531;&#x65BC;&#x8981;&#x5B78;&#x7684;&#x6771;&#x897F;&#x592A;&#x591A;&#x3001;&#x5F88;&#x96E3;&#x6709;&#x5B78;&#x5B8C;&#x7684;&#x4E00;&#x5929;&#x3002;&#x4F46;&#x4E5F;&#x53EF;&#x4EE5;&#x8AAA;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x5B78;&#x7FD2;&#x8DEF;&#x5F91;&#x662F;&#x6709;&#x5F88;&#x591A;&#x7684;&#x8D77;&#x9EDE;&#x3002;</p>
<p>&#x6545;&#x60F3;&#x6210;&#x70BA;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#xFF0C;&#x5EFA;&#x8B70;&#x638C;&#x63E1;&#x81EA;&#x5DF1;&#x7684;&#x5F37;&#x9805;&#xFF1B;&#x518D;&#x78BA;&#x8A8D;&#x4F60;&#x7684;&#x76EE;&#x6A19;&#x3001;&#x52D5;&#x6A5F;&#x8207;&#x8077;&#x6DAF;&#x671F;&#x7A0B;&#x5F8C;&#xFF0C;&#x5C55;&#x958B;&#x5B78;&#x7FD2;&#x8207;&#x7D2F;&#x7A4D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x64C5;&#x9577;&#x6216;&#x5C0D;&#x4EC0;&#x9EBC;&#x6280;&#x80FD;&#x6709;&#x8208;&#x8DA3;&#x5462;&#xFF1F;&#x662F;&#x5BEB;&#x7A0B;&#x5F0F;&#x548C;&#x6280;&#x8853;&#x958B;&#x767C;&#x3001;&#x662F;&#x6578;&#x5B57;&#x548C;&#x5206;&#x6790;&#xFF1B;&#x6216;&#x7A0B;&#x5F0F;&#x548C;&#x6578;&#x5B57;&#x90FD;&#x4E0D;&#x884C;&#xFF0C;&#x4F46;&#x5F88;&#x559C;&#x6B61;&#x5206;&#x6790;&#x5831;&#x8868;&#x6216;&#x5716;&#x8868;&#x5462;&#xFF1F;</p>
<p><img src="https://imgur.com/l7MrTV1.png" alt="&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684;&#x6280;&#x80FD;&#x990A;&#x6210;"></p>
<p>&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x8077;&#x6DAF;&#x767C;&#x5C55;&#x662F;&#x591A;&#x65B9;&#x5411;&#x7684;&#xFF0C;&#x4E26;&#x975E;&#x6BCF;&#x500B;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x8077;&#x6DAF;&#x7D42;&#x9EDE;&#x90FD;&#x662F;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#x627E;&#x5230;&#x4F60;&#x7684;&#x5F37;&#x9805;&#xFF0C;&#x9032;&#x800C;&#x9078;&#x64C7;&#x9069;&#x5408;&#x4F60;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x672C;&#x4F86;&#x662F;&#x5DE5;&#x7A0B;&#x5E2B;&#x3001;&#x64C5;&#x9577;&#x5BEB;&#x7A0B;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5F9E;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x5207;&#x5165;&#xFF1B;&#x82E5;&#x4F60;&#x64C5;&#x9577;&#x6578;&#x7406;&#x6216;&#x7D71;&#x8A08;&#xFF0C;&#x5247;&#x53EF;&#x5F9E;&#x6BD4;&#x8F03;&#x9700;&#x8981;&#x6578;&#x7406;&#x80FD;&#x529B;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x8457;&#x624B;&#xFF1B;&#x82E5;&#x4F60;&#x6C92;&#x6709;&#x5DE5;&#x7A0B;&#x6216;&#x6578;&#x7406;&#x80CC;&#x666F;&#xFF0C;&#x4F46;&#x5C0D;&#x6578;&#x5B57;&#x6216;&#x8CC7;&#x6599;&#x5F88;&#x6709;&#x8208;&#x8DA3;&#xFF0C;&#x4F8B;&#x5982;&#x4F60;&#x539F;&#x672C;&#x5C31;&#x662F; PM&#x3001;&#x884C;&#x92B7;&#x6216;&#x91D1;&#x878D;&#x696D;&#x4EBA;&#x54E1;&#xFF0C;&#x5247;&#x53EF;&#x5F9E;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x958B;&#x59CB;&#x3002;</p>
<h2 id="&#x5404;&#x7A2E;&#x80CC;&#x666F;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8077;&#x6DAF;&#x8DEF;&#x5F91;"><a href="#&#x5404;&#x7A2E;&#x80CC;&#x666F;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8077;&#x6DAF;&#x8DEF;&#x5F91;" class="headerlink" title="&#x5404;&#x7A2E;&#x80CC;&#x666F;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8077;&#x6DAF;&#x8DEF;&#x5F91;"></a>&#x5404;&#x7A2E;&#x80CC;&#x666F;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8077;&#x6DAF;&#x8DEF;&#x5F91;</h2><p>&#x9664;&#x4E86;&#x5F9E;&#x6280;&#x80FD;&#x4E4B;&#x5916;&#xFF0C;&#x63A5;&#x4E0B;&#x4F86;&#x6211;&#x5011;&#x5F9E;&#x300C;&#x80CC;&#x666F;&#x300D;&#x7684;&#x89D2;&#x5EA6;&#x5207;&#x5165;&#xFF0C;&#x5E7E;&#x7A2E;&#x5E38;&#x898B;&#x9032;&#x5165;&#x8CC7;&#x6599;&#x5708;&#x7684;&#x5925;&#x4F34;&#x8A72;&#x53EF;&#x4EE5;&#x600E;&#x9EBC;&#x898F;&#x5283;&#x81EA;&#x5DF1;&#x7684;&#x8077;&#x6DAF;&#x8DEF;&#x5F91;&#x3002;&#x5927;&#x81F4;&#x4E0A;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x8A2D;&#x8A08;&#x80CC;&#x666F;&#x3001;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x80CC;&#x666F;&#x3001;&#x64C5;&#x9577;&#x6578;&#x7406;&#x7D71;&#x8A08;&#x3001;&#x6578;&#x5B57;&#x654F;&#x92B3;&#x9AD8;&#x9019;&#x5E7E;&#x7A2E;&#x5C08;&#x624D;&#x7684;&#x4EBA;&#xFF0C;&#x6B64;&#x5916;&#x6211;&#x5011;&#x4E5F;&#x628A;&#x990A;&#x6210;&#x73ED;&#x3001;&#x5728;&#x8077;&#x8A13;&#x7DF4;&#x7368;&#x7ACB;&#x6210;&#x4E00;&#x7A2E;&#x53EF;&#x80FD;&#x7684;&#x80CC;&#x666F;&#x3002;</p>
<p><img src="https://imgur.com/a0qtSC5.png" alt="&#x5404;&#x7A2E;&#x80CC;&#x666F;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8077;&#x6DAF;&#x8DEF;&#x5F91;"></p>
<h3 id="&#x5F9E;&#x8A2D;&#x8A08;&#x80CC;&#x666F;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;"><a href="#&#x5F9E;&#x8A2D;&#x8A08;&#x80CC;&#x666F;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;" class="headerlink" title="&#x5F9E;&#x8A2D;&#x8A08;&#x80CC;&#x666F;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;"></a>&#x5F9E;&#x8A2D;&#x8A08;&#x80CC;&#x666F;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;</h3><p>&#x5F88;&#x591A;&#x6709;&#x8A2D;&#x8A08;&#x3001;&#x4F7F;&#x7528;&#x8005;&#x9AD4;&#x9A57;&#x80CC;&#x666F;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x80FD;&#x6703;&#x8F49;&#x63DB;&#x6210;&#x70BA;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E2B;&#x3002;&#x5728;&#x63A5;&#x89F8;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5F8C;&#xFF0C;&#x6210;&#x70BA;&#x300C;&#x61C2;&#x8CC7;&#x6599;&#x7684;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x3002;&#x9032;&#x800C;&#xFF0C;&#x518D;&#x6210;&#x70BA;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x3001;&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;&#x6216;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x3002;</p>
<h3 id="&#x5F9E;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x80CC;&#x666F;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;"><a href="#&#x5F9E;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x80CC;&#x666F;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;" class="headerlink" title="&#x5F9E;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x80CC;&#x666F;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;"></a>&#x5F9E;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x80CC;&#x666F;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;</h3><p>&#x672C;&#x4F86;&#x5C31;&#x662F;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#x7684;&#x4EBA;&#xFF0C;&#x5728;&#x6210;&#x70BA;&#x300C;&#x61C2;&#x8CC7;&#x6599;&#x7684;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x5F8C;&#xFF0C;&#x82E5;&#x4E0D;&#x8D70;&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;&#x6216;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#xFF0C;&#x5247;&#x53EF;&#x80FD;&#x6210;&#x70BA;&#x5927;&#x6578;&#x64DA;&#x5206;&#x6790;&#x5E2B;&#x6216;&#x8CC7;&#x6599;&#x67B6;&#x69CB;&#x5E2B;&#x3002;&#x82E5;&#x672C;&#x4F86;&#x662F;&#x8D70;&#x5F8C;&#x7AEF;&#xFF0C;&#x5247;&#x53EF;&#x80FD;&#x7DB2;&#x7CFB;&#x7D71;&#x67B6;&#x69CB;&#x5E2B;&#x3001;&#x6216;&#x8CC7;&#x6599;&#x67B6;&#x69CB;&#x5E2B;&#x767C;&#x5C55;&#x3002;</p>
<h3 id="&#x64C5;&#x9577;&#x6578;&#x7406;&#x7D71;&#x8A08;&#x7684;&#x4EBA;"><a href="#&#x64C5;&#x9577;&#x6578;&#x7406;&#x7D71;&#x8A08;&#x7684;&#x4EBA;" class="headerlink" title="&#x64C5;&#x9577;&#x6578;&#x7406;&#x7D71;&#x8A08;&#x7684;&#x4EBA;"></a>&#x64C5;&#x9577;&#x6578;&#x7406;&#x7D71;&#x8A08;&#x7684;&#x4EBA;</h3><p>&#x6578;&#x7406;&#x7D71;&#x8A08;&#x5F37;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x80FD;&#x5F9E;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x6216;&#x300C;&#x61C2;&#x7A0B;&#x5F0F;&#x7684;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x300D;&#x51FA;&#x767C;&#xFF0C;&#x6210;&#x70BA;&#x300C;&#x61C2;&#x8CC7;&#x6599;&#x7684;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x3001;&#x6216;&#x76F4;&#x63A5;&#x6210;&#x70BA;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x3002;&#x800C;&#x300C;&#x61C2;&#x8CC7;&#x6599;&#x7684;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#xFF0C;&#x53EF;&#x80FD;&#x518D;&#x85C9;&#x7531;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x3001;&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x8D70;&#x5411;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x3002;&#x800C;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#xFF0C;&#x5247;&#x4EA6;&#x53EF;&#x5F80;&#x5927;&#x6578;&#x64DA;&#x5DE5;&#x7A0B;&#x5E2B;&#x3001;&#x8CC7;&#x6599;&#x67B6;&#x69CB;&#x5E2B;&#x767C;&#x5C55;&#x3002;</p>
<h3 id="&#x5C0D;&#x6578;&#x5B57;&#x654F;&#x92B3;&#x7684;&#x4EBA;"><a href="#&#x5C0D;&#x6578;&#x5B57;&#x654F;&#x92B3;&#x7684;&#x4EBA;" class="headerlink" title="&#x5C0D;&#x6578;&#x5B57;&#x654F;&#x92B3;&#x7684;&#x4EBA;"></a>&#x5C0D;&#x6578;&#x5B57;&#x654F;&#x92B3;&#x7684;&#x4EBA;</h3><p>&#x5C0D;&#x6578;&#x5B57;&#x654F;&#x92B3;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x822C;&#x8DEF;&#x5F91;&#x53EF;&#x80FD;&#x662F;&#x6703;&#x5728;&#x5E02;&#x5834;&#x76F8;&#x95DC;&#x7684;&#x884C;&#x92B7;&#x6216;&#x4F01;&#x5283;&#x7B49;&#x89D2;&#x8272;&#x767C;&#x5C55;&#xFF0C;&#x9032;&#x4E00;&#x6B65;&#x8655;&#x7406;&#x5546;&#x696D;&#x5206;&#x6790;&#x4EFB;&#x52D9;&#xFF0C;&#x6700;&#x5F8C;&#x6210;&#x70BA;&#x7BA1;&#x7406;&#x9867;&#x554F;&#x3002;&#x82E5;&#x5F80;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x767C;&#x5C55;&#x3001;&#x518D;&#x5B78;&#x7FD2;&#x7A0B;&#x5F0F;&#xFF0C;&#x6210;&#x70BA;&#x300C;&#x61C2;&#x7A0B;&#x5F0F;&#x7684;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x300D;&#xFF1B;&#x6216;&#x662F;&#x5728;&#x8655;&#x7406;&#x5546;&#x696D;&#x4EFB;&#x52D9;&#x7684;&#x968E;&#x6BB5;&#xFF0C;&#x6210;&#x70BA;&#x300C;&#x6703;&#x7A0B;&#x5F0F;&#x7684;&#x5546;&#x696D;&#x5206;&#x6790;&#x5E2B; (BI)&#x300D;&#x3002;&#x5546;&#x696D;&#x5206;&#x6790;&#x5E2B;&#xFF0C;&#x9032;&#x4E00;&#x6B65;&#x53EF;&#x80FD;&#x6210;&#x70BA;&#x300C;&#x61C2;&#x8CC7;&#x6599;&#x7684;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#xFF0C;&#x4E26;&#x518D;&#x5F80;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x9081;&#x9032;&#x3002;</p>
<h3 id="&#x5F9E;&#x990A;&#x6210;&#x73ED;-&#x5728;&#x8077;&#x8A13;&#x7DF4;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;"><a href="#&#x5F9E;&#x990A;&#x6210;&#x73ED;&#x3001;&#x5728;&#x8077;&#x8A13;&#x7DF4;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;" class="headerlink" title="&#x5F9E;&#x990A;&#x6210;&#x73ED;&#x3001;&#x5728;&#x8077;&#x8A13;&#x7DF4;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;"></a>&#x5F9E;&#x990A;&#x6210;&#x73ED;&#x3001;&#x5728;&#x8077;&#x8A13;&#x7DF4;&#x5230;&#x8CC7;&#x6599;&#x9818;&#x57DF;</h3><p>&#x990A;&#x6210;&#x73ED;&#x8207;&#x5728;&#x8077;&#x8A13;&#x7DF4;&#x7684;&#x6642;&#x9593;&#x90FD;&#x76F8;&#x5C0D;&#x5730;&#x77ED;&#xFF0C;&#x4E0D;&#x904E;&#x4E5F;&#x662F;&#x5F9E;&#x300C;&#x61C2;&#x8CC7;&#x6599;&#x7684;&#x8EDF;&#x9AD4;&#x5DE5;&#x7A0B;&#x5E2B;&#x300D;&#x8D77;&#x6B65;&#x3002;&#x518D;&#x5FAA;&#x8CC7;&#x6599;&#x5DE5;&#x7A0B;&#x5E2B;&#x3001;&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x7A0B;&#x5E2B;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x3002;&#x6216;&#x662F;&#x5FAA;&#x5F8C;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E2B;&#x7684;&#x8DEF;&#x5F91;&#xFF0C;&#x5F80;&#x5927;&#x6578;&#x64DA;&#x5DE5;&#x7A0B;&#x5E2B;&#x6216;&#x8CC7;&#x6599;&#x67B6;&#x69CB;&#x5E2B;&#x767C;&#x5C55;&#x3002;</p>
<h2 id="&#x9032;&#x5165;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9818;&#x57DF;&#x53EA;&#x662F;&#x7B2C;&#x4E00;&#x6B65;"><a href="#&#x9032;&#x5165;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9818;&#x57DF;&#x53EA;&#x662F;&#x7B2C;&#x4E00;&#x6B65;" class="headerlink" title="&#x9032;&#x5165;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9818;&#x57DF;&#x53EA;&#x662F;&#x7B2C;&#x4E00;&#x6B65;"></a>&#x9032;&#x5165;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9818;&#x57DF;&#x53EA;&#x662F;&#x7B2C;&#x4E00;&#x6B65;</h2><p>&#x56E0;&#x70BA;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9818;&#x57DF;&#x7684;&#x591A;&#x5143;&#x5167;&#x6DB5;&#xFF0C;&#x4F7F;&#x5F97;&#x4EBA;&#x4EBA;&#x90FD;&#x6709;&#x6A5F;&#x6703;&#x6210;&#x70BA;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x3002;&#x4E5F;&#x56E0;&#x5982;&#x6B64;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x9700;&#x8981;&#x8DE8;&#x9818;&#x57DF;&#x7684;&#x6280;&#x80FD;&#x8207;&#x5408;&#x4F5C;&#x80FD;&#x529B;&#xFF0C;&#x662F;&#x500B;&#x975E;&#x5E38;&#x5177;&#x6709;&#x6311;&#x6230;&#x7684;&#x89D2;&#x8272;&#x3002;&#x5F9E;&#x6280;&#x80FD;&#x6A39;&#x4F86;&#x770B;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x9700;&#x8981;&#x5B78;&#x7FD2;&#x975E;&#x5E38;&#x591A;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x5EFA;&#x8B70;&#x5F9E;&#x81EA;&#x5DF1;&#x64C5;&#x9577;&#x6216;&#x611F;&#x8208;&#x8DA3;&#x7684;&#x6280;&#x80FD;&#x958B;&#x59CB;&#x5B78;&#x7FD2;&#xFF1B;&#x4E5F;&#x8981;&#x6709;&#x5B78;&#x4E0D;&#x5B8C;&#x3001;&#x6C38;&#x9060;&#x90FD;&#x5728;&#x5B78;&#x7FD2;&#x7684;&#x5FC3;&#x7406;&#x6E96;&#x5099;&#x3002;</p>
<p>&#x800C;&#x5F9E;&#x8077;&#x6DAF;&#x4F86;&#x770B;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x8077;&#x6DAF;&#x8D77;&#x9EDE;&#x8207;&#x8DEF;&#x5F91;&#x4E5F;&#x975E;&#x5E38;&#x591A;&#x6A23;&#x3002;&#x7121;&#x8AD6;&#x662F;&#x5E38;&#x898B;&#x7684;&#x8A2D;&#x8A08;&#x3001;&#x5DE5;&#x7A0B;&#x80CC;&#x666F;&#xFF1B;&#x990A;&#x6210;&#x73ED;&#x6216;&#x5728;&#x8077;&#x8A13;&#x7DF4;&#x80CC;&#x666F;&#xFF1B;&#x6216;&#x64C5;&#x9577;&#x6578;&#x7406;&#x7D71;&#x8A08;&#x6216;&#x5C0D;&#x6578;&#x5B57;&#x654F;&#x92B3;&#x7684;&#x5404;&#x7A2E;&#x8077;&#x7A2E;&#x6216;&#x7279;&#x8CEA;&#x7684;&#x4EBA;&#xFF0C;&#x53EA;&#x8981;&#x5F9E;&#x638C;&#x63E1;&#x81EA;&#x5DF1;&#x7684;&#x5F37;&#x9805;&#x51FA;&#x767C;&#xFF0C;&#x90FD;&#x6709;&#x6A5F;&#x6703;&#x5728;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9818;&#x57DF;&#x4E2D;&#x627E;&#x5230;&#x9069;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p><br></p>
<!-- Begin Mailchimp Signup Form -->
<p><div id="mc_embed_signup"><form action="https://accupass.us6.list-manage.com/subscribe/post?u=840b112be5bede36036e19d3e&amp;id=d23f3a8e3a" method="post" id="mc-embedded-subscribe-form" name="mc-embedded-subscribe-form" class="validate" target="_blank" novalidate><div id="mc_embed_signup_scroll"><label for="mce-EMAIL">&#x5982;&#x679C;&#x60F3;&#x7372;&#x5F97;&#x6700;&#x65B0;&#x7684;&#x6280;&#x8853;&#x8CC7;&#x8A0A;&#xFF0C;&#x6B61;&#x8FCE;&#x8A02;&#x95B1;&#x8FFD;&#x8E64;&#xFF1A;</label><input type="email" value name="EMAIL" class="email" id="mce-EMAIL" placeholder="email address" required><div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_840b112be5bede36036e19d3e_d23f3a8e3a" tabindex="-1" value></div><div class="clear"><input type="submit" value="Subscribe" name="subscribe" id="mc-embedded-subscribe" class="button"></div></div></form></div><br><!--End mc_embed_signup--></p>
<hr>
<p style="color: #6d9eeb"><br>&#x55E8;&#xFF0C;&#x6211;&#x662F;&#x7DAD;&#x5143;&#xFF0C;&#x8FD1;&#x671F;&#x63A8;&#x51FA;&#x4E00;&#x500B;&#x5168;&#x65B0;&#x578B;&#x614B;&#x7684;&#x3010; Python &#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x6559;&#x5B78;&#x5BE6;&#x6230;&#x71DF; &#x3011;&#xFF0C;&#x7D50;&#x5408;&#x591A;&#x5143;&#x6559;&#x5B78;&#x5F62;&#x5F0F;&#x53CA;&#x8C50;&#x5BCC;&#x8AB2;&#x7A0B;&#x7D93;&#x9A57;&#x5E6B;&#x52A9;&#x4F60;&#x66F4;&#x6709;&#x6548;&#x5730;&#x5B78;&#x7FD2;&#x3002;&#x65B0;&#x8AB2;&#x7A0B;&#x300C;<a href="https://dscareer.kolable.app/" style="color: #ff0000; font-weight: bold; text-decoration: underline;" target="_blank" rel="noopener">&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8207;&#x6A5F;&#x5668;&#x5B78;&#x7FD2;&#x5DE5;&#x5177;&#x7BB1;</a>&#x300D;&#x6B63;&#x5728;&#x65E9;&#x9CE5;&#x52DF;&#x8CC7;&#x4E2D;&#xFF0C;&#x6B61;&#x8FCE;&#x4F60;&#x4E00;&#x8D77;&#x52A0;&#x5165;&#x8CC7;&#x6599;&#x9818;&#x57DF;&#xFF01;&#x8AA0;&#x646F;&#x7684;&#x9080;&#x8ACB;&#x4F60;&#x8DDF;&#x8457;&#x6211;&#x5011;&#x4E00;&#x8D77;&#x5F9E; Python &#x5165;&#x9580;&#x958B;&#x59CB;&#xFF0C;&#x8D70;&#x9032;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x4E16;&#x754C; &#x1F64C;<br><br><img src="https://imgur.com/PK1cgCS.png" alt><br><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://dscareer.kolable.app/" target="_blank" rel="noopener">https://dscareer.kolable.app/</a><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://dscareer.kolable.app/" target="_blank" rel="noopener">https://dscareer.kolable.app/</a><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://dscareer.kolable.app/" target="_blank" rel="noopener">https://dscareer.kolable.app/</a><br><br></p>

<hr>
<h2 id="license"><a href="#License" class="headerlink" title="License"></a>License</h2><p><img src="http://i.creativecommons.org/l/by-sa/3.0/88x31.png" style="    margin: 0;"><br>&#x672C;&#x8457;&#x4F5C;&#x7531;<a href="https://www.facebook.com/v123582" target="_blank" rel="noopener">Chang Wei-Yaun (v123582)</a>&#x88FD;&#x4F5C;&#xFF0C;<br>&#x4EE5;<a href="http://creativecommons.org/licenses/by-sa/3.0/deed.zh_TW" target="_blank" rel="noopener">&#x5275;&#x7528;CC &#x59D3;&#x540D;&#x6A19;&#x793A;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5206;&#x4EAB; 3.0 Unported</a>&#x6388;&#x6B0A;&#x689D;&#x6B3E;&#x91CB;&#x51FA;&#x3002;</p>
</div><div class="post-nav"><a href="/2023/03/10/五個必須掌握的 AI 發展趨勢/" class="next">五個必須掌握的 AI 發展趨勢<i class="icon-next"></i></a></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><div class="widget-title">Information</div><ul><div class="tags">標籤：<a href="/tags/資料科學系列/">資料科學系列 </a></div><div class="categories">分類：<a href="/categories/Data-Science/">Data Science</a></div></ul></div><div class="widget"><div class="widget-title">Table of Content</div><div class="clear"><div id="toc" class="toc-article"><div class="toc"></div></div></div></div><script type="text/javascript" src="//js1.bloggerads.net/ShowAds.aspx?blogid=20190326000001" async></script></div></div></div><div id="footer">© <a href="/" rel="nofollow">資料科學家的工作日常.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><script src="/js/jquery.min.js"></script>
<script src="/js/share.js"></script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script><a id="rocket" href="#top" class="show"></a><script src="/js/jquery.min.js"></script>
<script src="/js/totop.js"></script><script src="/js/fancybox.pack.js"></script>
<script src="/js/jquery.fancybox.js"></script><link rel="stylesheet" href="/css/jquery.fancybox.css"><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
ga('create','UA-59103909-1','auto');ga('send','pageview');
</script></div><!-- hexo-inject:begin --><!-- hexo-inject:end --></body></html>