<!DOCTYPE html><html lang="zh-TW"><head><meta name="generator" content="Hexo 3.9.0"><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><meta property="og:image" content="https://avatars2.githubusercontent.com/u/5959524?v=3&amp;s=300"><meta property="og:description" content="WeiYuan Note | 程式碼持續優化的秘訣 - Code Review"><meta property="og:title" content="程式碼持續優化的秘訣 - Code Review"><title>程式碼持續優化的秘訣 - Code Review | 資料科學家的工作日常</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"><link rel="stylesheet" type="text/css" href="/css/pure-min.css"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css"><link rel="stylesheet" type="text/css" href="/css/profile-card.css"><link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.4.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"><link href="//cdn-images.mailchimp.com/embedcode/slim-10_7.css" rel="stylesheet" type="text/css"><script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><script><!-- hexo-inject:begin --><!-- hexo-inject:end -->(adsbygoogle = window.adsbygoogle || []).push({
google_ad_client: "ca-pub-7913880396333307",
enable_page_level_ads: true
});


</script><!-- hexo-inject:begin --><!-- hexo-inject:end --></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">程式碼持續優化的秘訣 - Code Review</h1><a id="logo" href="https://v123582.github.io">資料科學家的工作日常</a><p class="description">#遠端 #斜槓 #教學 #資料科學 #網站開發</p></div><div id="nav-menu"><a href="https://v123582.github.io/about"><i class="icon-about"> 關於</i></a><a href="https://v123582.github.io/project"><i class="fa fa-tasks"> 專案</i></a><a href="https://v123582.github.io/blog"><i class="icon-archive"> 技術</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post post-page"><h1 class="post-title"><span><i class="fa fa-star"></i></span>程式碼持續優化的秘訣 - Code Review</h1><div class="post-meta">2021-03-10 | WeiYuan (@v123582)</div><a data-url="https://blog.v12358.tw/2021/03/10/程式碼持續優化的秘訣-Code-Review/" data-id="cku6ghlio007uozobynsku4pe" class="article-share-link">Share</a><div class="post-content"><h2 id="&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x6301;&#x7E8C;&#x512A;&#x5316;"><a href="#&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x6301;&#x7E8C;&#x512A;&#x5316;" class="headerlink" title="&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x6301;&#x7E8C;&#x512A;&#x5316;"></a>&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x6301;&#x7E8C;&#x512A;&#x5316;</h2><p>&#x5C0D;&#x4E00;&#x500B;&#x5165;&#x9580;&#x7684;&#x5DE5;&#x7A0B;&#x5E2B;&#x4F86;&#x8AAA;&#xFF0C;&#x638C;&#x63E1;&#x7A0B;&#x5F0F;&#x8A9E;&#x6CD5;&#x8207;&#x6A21;&#x4EFF;&#x7BC4;&#x4F8B;&#x5BE6;&#x4F5C;&#x662F;&#x57FA;&#x672C;&#x7684;&#x80FD;&#x529B;&#x3002;&#x90A3;&#x6709;&#x4E86;&#x9019;&#x6A23;&#x7684;&#x57FA;&#x672C;&#x80FD;&#x4E4B;&#x5F8C;&#xFF0C;&#x8981;&#x5982;&#x4F55;&#x5BEB;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x7A0B;&#x5F0F;&#x5462;&#xFF1F;&#x600E;&#x6A23;&#x624D;&#x80FD;&#x5920;&#x6210;&#x70BA;&#x4E00;&#x500B;&#x300C;&#x512A;&#x79C0;&#x300D;&#x7684;&#x65B0;&#x624B;&#x5DE5;&#x7A0B;&#x5E2B;&#x5462;&#xFF1F;</p>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><p>&#x4E8B;&#x5BE6;&#x4E0A;&#xFF0C;&#x5BEB;&#x51FA;&#x6703;&#x52D5;&#x7684;&#x7A0B;&#x5F0F;&#x4E0D;&#x96E3;&#xFF0C;&#x4F46;&#x60F3;&#x5BEB;&#x51FA;&#x597D;&#x7684;&#x7A0B;&#x5F0F;&#x5176;&#x5BE6;&#x662F;&#x9700;&#x8981;&#x523B;&#x610F;&#x7DF4;&#x7FD2;&#x7684;&#x3002;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4EBA;&#x6703;&#x5EFA;&#x8B70;&#x8981;&#x300C;&#x591A;&#x7DF4;&#x7FD2;&#x3001;&#x591A;&#x5BE6;&#x4F5C;&#x300D;&#xFF0C;&#x4F46;&#x6211;&#x8A8D;&#x70BA;&#x5728;&#x5927;&#x91CF;&#x7DF4;&#x7FD2;&#x4E4B;&#x5916;&#xFF0C;&#x9069;&#x6642;&#x7684;&#x300C;&#x512A;&#x5316;&#x7A0B;&#x5F0F;&#x300D;&#x4E5F;&#x662F;&#x63D0;&#x5347;&#x300C;&#x7A0B;&#x5F0F;&#x78BC;&#x54C1;&#x8CEA;&#x300D;&#x91CD;&#x8981;&#x7684;&#x95DC;&#x9375;&#x3002;&#x800C;&#x5728;&#x300C;&#x512A;&#x5316;&#x7A0B;&#x5F0F;&#x300D;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x5169;&#x500B;&#x89D2;&#x5EA6;&#xFF1A;</p>
<ul>
<li>&#x7A0B;&#x5F0F;&#x57F7;&#x884C;&#x6548;&#x80FD;&#x66F4;&#x597D;</li>
<li>&#x7A0B;&#x5F0F;&#x78BC;&#x7D50;&#x69CB;&#x66F4;&#x7CBE;&#x7C21;</li>
</ul>
<p>&#x7A0B;&#x5F0F;&#x57F7;&#x884C;&#x6548;&#x80FD;&#x5C31;&#x662F;&#x5F9E;&#x901F;&#x5EA6;&#x8DDF;&#x7A7A;&#x9593;&#x4F86;&#x601D;&#x8003;&#xFF0C;&#x57F7;&#x884C;&#x6642;&#x9593;&#x8D8A;&#x77ED;&#x3001;&#x8B8A;&#x6578;&#x4F54;&#x7528;&#x7A7A;&#x9593;&#x8D8A;&#x5C0F;&#x3002;&#x800C;&#x7A0B;&#x5F0F;&#x78BC;&#x7D50;&#x69CB;&#x5247;&#x6703;&#x5F9E;&#x53EF;&#x8B80;&#x6027;&#x548C;&#x7CBE;&#x7C21;&#x4F86;&#x8861;&#x91CF;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x8B8A;&#x6578;&#x7684;&#x547D;&#x540D;&#x6709;&#x6C92;&#x6709;&#x610F;&#x7FA9;&#x3001;&#x7A0B;&#x5F0F;&#x78BC;&#x6709;&#x6C92;&#x6709;&#x5197;&#x4F59;&#x3001;&#x7E41;&#x7463;&#x7684;&#x90E8;&#x5206;&#x7B49;&#x7B49;&#x3002;&#x53EA;&#x4E0D;&#x904E;&#x65B0;&#x624B;&#x5F88;&#x5BB9;&#x6613;&#x505C;&#x7559;&#x5728;&#x5BEB;&#x51FA;&#x7A0B;&#x5F0F;&#x7684;&#x559C;&#x6085;&#x4EE5;&#x53CA;&#x53D7;&#x5230;&#x56FA;&#x6709;&#x7684;&#x89E3;&#x984C;&#x601D;&#x8003;&#xFF0C;&#x800C;&#x5FFD;&#x7565;&#x512A;&#x5316;&#x7684;&#x904E;&#x7A0B;&#x3002;</p>
<p>&#x900F;&#x904E;&#x300C;Code Review&#x300D;&#x662F;&#x63A8;&#x85A6;&#x65B0;&#x624B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x7D93;&#x7531;&#x53CD;&#x994B;&#x8207;&#x8A0E;&#x8AD6;&#x4F86;&#x627E;&#x51FA;&#x7A0B;&#x5F0F;&#x4E2D;&#x53EF;&#x512A;&#x5316;&#x7684;&#x7A7A;&#x9593;&#x3002;</p>
<h2 id="code-review-&#x7684;&#x95DC;&#x6CE8;&#x9EDE;"><a href="#Code-Review-&#x7684;&#x95DC;&#x6CE8;&#x9EDE;" class="headerlink" title="Code Review &#x7684;&#x95DC;&#x6CE8;&#x9EDE;"></a>Code Review &#x7684;&#x95DC;&#x6CE8;&#x9EDE;</h2><p>&#x4EE5;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7D93;&#x9A57;&#x4F86;&#x8AAA;&#xFF0C;Review &#x4E00;&#x4EFD;&#x5C08;&#x6848;&#x7684;&#x6642;&#x5019;&#x6703;&#x95DC;&#x6CE8;&#xFF1A;</p>
<ul>
<li>&#x7A0B;&#x5F0F;&#x80FD;&#x4E0D;&#x80FD;&#x6B63;&#x5E38;&#x64CD;&#x4F5C;&#xFF0C;&#x6709;&#x6C92;&#x6709;&#x4EC0;&#x9EBC;&#x660E;&#x986F;&#x7684;&#x932F;&#x8AA4;&#xFF1F;&#x2028; &#x2190; &#x4F4E;&#x6A19;</li>
<li>&#x7A0B;&#x5F0F;&#x78BC;&#x7576;&#x4E2D;&#x6709;&#x6C92;&#x6709;&#x5947;&#x602A;&#x7684;&#x5730;&#x65B9;&#xFF1F;&#x2028; &#x2190; &#x512A;&#x5316;</li>
</ul>
<p>&#x7B2C;&#x4E00;&#x500B;&#x95DC;&#x6CE8;&#x9EDE;&#x662F;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x4F4E;&#x6A19;&#xFF0C;&#x7D50;&#x679C;&#x6B63;&#x78BA;&#x8207;&#x53EF;&#x6B63;&#x5E38;&#x904B;&#x884C;&#x4E00;&#x5B9A;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5982;&#x679C;&#x7A0B;&#x5F0F;&#x7121;&#x6CD5;&#x904B;&#x884C;&#x52D5;&#x6216;&#x5B58;&#x5728;&#x5F88;&#x660E;&#x986F;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x90A3;&#x518D;&#x591A;&#x7684;&#x512A;&#x5316;&#x90FD;&#x6C92;&#x6709;&#x610F;&#x7FA9;&#x3002;&#x9664;&#x4E86;&#x78BA;&#x4FDD;&#x57F7;&#x884C;&#x4E4B;&#x5916;&#xFF0C;&#x540C;&#x6642;&#x4E5F;&#x6703;&#x6AA2;&#x67E5;&#x4E00;&#x4E0B;&#x662F;&#x5426;&#x6709;&#x4F4E;&#x7D1A;&#x7684;&#x908F;&#x8F2F;&#x5931;&#x8AA4;&#x6216;&#x662F;&#x5B89;&#x5168;&#x6027;&#x7684;&#x7591;&#x616E;&#xFF0C;&#x50CF;&#x662F;&#x8CC7;&#x6599;&#x5EAB;&#x6C92;&#x6709;&#x6B63;&#x78BA;&#x95DC;&#x9589;&#x6216;&#x5BC6;&#x78BC;&#x660E;&#x78BC;&#x6C92;&#x6709;&#x52A0;&#x5BC6;&#x4E4B;&#x985E;&#x7684;&#x554F;&#x984C;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x500B;&#x95DC;&#x6CE8;&#x9EDE;&#x662F;&#x300C;&#x7A0B;&#x5F0F;&#x78BC;&#x54C1;&#x8CEA;&#x63D0;&#x5347;&#x300D;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x6703;&#x628A;&#x5B83;&#x5B9A;&#x7FA9;&#x6210;&#x7A0B;&#x5F0F;&#x904B;&#x4F5C;&#x4E0A;&#x6C92;&#x6709;&#x554F;&#x984C;&#xFF0C;&#x4F46;&#x770B;&#x8D77;&#x4F86;&#x5F88;&#x4E0D;&#x8212;&#x670D;&#x6216;&#x57F7;&#x884C;&#x6548;&#x7387;&#x5F88;&#x5DEE;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5927;&#x81F4;&#x4E0A;&#x53EF;&#x4EE5;&#x5F9E;&#x4EE5;&#x4E0B;&#x5E7E;&#x9EDE;&#x4E0B;&#x624B;&#xFF1A;</p>
<ul>
<li>&#x547D;&#x540D;&#x6709;&#x6C92;&#x6709;&#x610F;&#x7FA9;/&#x4E0D;&#x4E00;&#x81F4;&#x2028;</li>
<li>&#x8CC7;&#x6599;&#x5EAB;&#x7684;&#x6B63;&#x898F;&#x5316;&#x60C5;&#x6CC1;</li>
<li>&#x662F;&#x5426;&#x5B58;&#x5728;&#x7279;&#x5225;&#x8907;&#x96DC;&#x7684;&#x7A0B;&#x5F0F;&#x7247;&#x6BB5;&#xFF08;&#x4F8B;&#x5982;&#x591A;&#x6B21;&#x7684;&#x8CC7;&#x6599;&#x5EAB;&#x67E5;&#x8A62;&#x3001;&#x591A;&#x5C64;&#x7684;&#x8FF4;&#x5708;&#x4F7F;&#x7528;&#xFF09;&#x2029;</li>
<li>&#x91CD;&#x8907;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x6709;&#x6C92;&#x6709;&#x5B9A;&#x7FA9;&#x6210; function&#x2028;</li>
<li>&#x5197;&#x9577;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x80FD;&#x4E0D;&#x80FD;&#x62C6;&#x5206;&#x6210; function&#x2028;</li>
</ul>
<p>&#x4E0D;&#x904E;&#x4E00;&#x6B21;&#x7684; Code Review &#x5EFA;&#x8B70;&#x8457;&#x91CD;&#x5728; 3 - 5 &#x500B;&#x512A;&#x5316;&#x5730;&#x65B9;&#xFF0C;&#x6BD4;&#x8F03;&#x5BB9;&#x6613;&#x805A;&#x7126;&#x5728;&#x512A;&#x5316;&#x7684;&#x54C1;&#x8CEA;&#x3002;&#x6839;&#x64DA;&#x6642;&#x7A0B;&#x7684;&#x58D3;&#x529B;&#xFF0C;&#x6C7A;&#x5B9A; Code Review &#x8FED;&#x4EE3;&#x7684;&#x6B21;&#x6578;&#x3002;</p>
<h2 id="&#x5F9E;&#x67B6;&#x69CB;&#x7684;&#x898F;&#x5283;&#x5230;&#x7D30;&#x7BC0;&#x7684;&#x512A;&#x5316;"><a href="#&#x5F9E;&#x67B6;&#x69CB;&#x7684;&#x898F;&#x5283;&#x5230;&#x7D30;&#x7BC0;&#x7684;&#x512A;&#x5316;" class="headerlink" title="&#x5F9E;&#x67B6;&#x69CB;&#x7684;&#x898F;&#x5283;&#x5230;&#x7D30;&#x7BC0;&#x7684;&#x512A;&#x5316;"></a>&#x5F9E;&#x67B6;&#x69CB;&#x7684;&#x898F;&#x5283;&#x5230;&#x7D30;&#x7BC0;&#x7684;&#x512A;&#x5316;</h2><p>&#x5728;&#x62FF;&#x5230;&#x4E00;&#x4EFD;&#x7A0B;&#x5F0F;&#x78BC;&#x6642;&#xFF0C;&#x901A;&#x5E38;&#x6703;&#x5148;&#x6383;&#x904E;&#x4E00;&#x773C;&#x7A0B;&#x5F0F;&#x7684;&#x6A94;&#x6848;&#x7D50;&#x69CB;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x4E0D;&#x8A72;&#x4E0A;&#x50B3;&#x7684;&#x6A94;&#x6848;&#x6216;&#x7F3A;&#x6F0F;&#x3002;</p>
<p>&#x9032;&#x5165;&#x7A0B;&#x5F0F;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x5148;&#x5F9E; package.json &#x6A94;&#x6848;&#x958B;&#x59CB;&#xFF0C;&#x78BA;&#x8A8D;&#x4E00;&#x4E0B;&#x5C08;&#x6848;&#x7684;&#x57FA;&#x672C;&#x8CC7;&#x8A0A;&#x662F;&#x5426;&#x5B8C;&#x6574;&#x3001;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x5957;&#x4EF6;&#x8207;&#x7248;&#x672C;&#xFF0C;&#x4EE5;&#x53CA;&#x7A0B;&#x5F0F;&#x7684;&#x9032;&#x5165;&#x9EDE;&#x662F;&#x4EC0;&#x9EBC;&#x3002;&#x7136;&#x5F8C;&#x6253;&#x958B;&#x9032;&#x5165;&#x9EDE;&#x7684;&#x6A94;&#x6848;&#xFF08;&#x901A;&#x5E38;&#x6703;&#x547D;&#x540D;&#x6210; <code>app</code> &#x6216; <code>main</code>&#xFF09;&#xFF0C;&#x901A;&#x5E38;&#x6709;&#x5E7E;&#x500B;&#x9EDE;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF1A;&#x300C;&#x5957;&#x4EF6;&#x7684;&#x8F09;&#x5165;&#x9806;&#x5E8F;&#x300D;&#x6703;&#x5EFA;&#x8B70;&#x5F9E;&#x7B2C;&#x4E09;&#x65B9;&#x5957;&#x4EF6; &#x2192; &#x81EA;&#x5B9A;&#x7FA9;&#x7684;&#x6A21;&#x7D44; &#x2192; &#x7A0B;&#x5F0F;&#x5167;&#x7684;&#x8B8A;&#x6578;&#x9019;&#x6A23;&#x9806;&#x5E8F;&#x5B9A;&#x7FA9;&#xFF1B;&#x300C;&#x5584;&#x7528; MVC &#x7684;&#x67B6;&#x69CB;&#x300D;&#x5C07;&#x975E;&#x4E3B;&#x7A0B;&#x5F0F;&#x7684;&#x90E8;&#x5206;&#x4F9D;&#x7167;&#x529F;&#x80FD;&#x62C6;&#x5206;&#x6A21;&#x7D44;&#xFF0C;&#x907F;&#x514D;&#x6A94;&#x6848;&#x8CC7;&#x8A0A;&#x91CF;&#x592A;&#x96DC;&#x4E82;&#x3002;&#x63A5;&#x8457;&#x5C31;&#x6703;&#x5F9E; Router &#x2192; Controller &#x2192; Service &#x2192; View &#x7684;&#x6D41;&#x7A0B;&#x4E00;&#x500B;&#x4E00;&#x500B;&#x529F;&#x80FD;&#xFF0C;&#x4EE5;&#x4E0B;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x5B58;&#x5728;&#x512A;&#x5316;&#x7A7A;&#x9593;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#xFF1A;</p>
<ul>
<li>&#x5206;&#x9801;&#x7684;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x5584;&#x7528;&#x5DE5;&#x5177;&#xFF0C;&#x4E0D;&#x7528;&#x81EA;&#x5DF1;&#x624B;&#x523B;</li>
<li>&#x8CC7;&#x6599;&#x5EAB;&#x7684;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x95DC;&#x806F;&#x67E5;&#x8A62;</li>
<li>&#x8B8A;&#x6578;&#x540D;&#x7A31;&#x4E0D;&#x5EFA;&#x8B70;&#x7528;&#x5927;&#x5BEB;&#x958B;&#x982D;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x7528;&#x5728; Class &#x7684;&#x547D;&#x540D;&#xFF09;</li>
</ul>
<h2 id="&#x4FDD;&#x6301;&#x512A;&#x5316;&#x7684;&#x7A7A;&#x9593;&#x8207;&#x5F48;&#x6027;"><a href="#&#x4FDD;&#x6301;&#x512A;&#x5316;&#x7684;&#x7A7A;&#x9593;&#x8207;&#x5F48;&#x6027;" class="headerlink" title="&#x4FDD;&#x6301;&#x512A;&#x5316;&#x7684;&#x7A7A;&#x9593;&#x8207;&#x5F48;&#x6027;"></a>&#x4FDD;&#x6301;&#x512A;&#x5316;&#x7684;&#x7A7A;&#x9593;&#x8207;&#x5F48;&#x6027;</h2><p>&#x300C;&#x512A;&#x5316;&#x5176;&#x5BE6;&#x662F;&#x4E00;&#x7A2E;&#x53D6;&#x6368;&#x300D;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4E5F;&#x4E0D;&#x61C9;&#x8A72;&#x8FFD;&#x6C42;&#x4E00;&#x6B65;&#x5230;&#x4F4D;&#x3002;&#x958B;&#x767C;&#x5F80;&#x5F80;&#x90FD;&#x662F;&#x5728;&#x54C1;&#x8CEA;&#x8DDF;&#x7522;&#x51FA;&#x505A;&#x53D6;&#x6368;&#xFF0C;&#x521D;&#x671F;&#x53EF;&#x4EE5;&#x628A;&#x958B;&#x767C;&#x76EE;&#x6A19;&#x653E;&#x5728;&#x300C;&#x5148;&#x6C42;&#x53EF;&#x4EE5;&#x52D5;&#xFF0C;&#x518D;&#x6C42;&#x6301;&#x7E8C;&#x512A;&#x5316;&#x300D;&#x7684;&#x7BC0;&#x594F;&#x4E0A;&#x3002;&#x65B0;&#x624B;&#x9700;&#x8981;&#x5728;&#x610F;&#x7684;&#x9EDE;&#x6709;&#x5E7E;&#x4E0B;&#x5169;&#x9EDE;&#xFF1A;</p>
<ul>
<li>&#x5F88;&#x5BB9;&#x6613;&#x628A;&#x91CD;&#x9EDE;&#x5168;&#x90E8;&#x653E;&#x5728;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x7522;&#x51FA;&#x4E0A;&#x800C;&#x5FFD;&#x7565;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x54C1;&#x8CEA;&#x3002;</li>
<li>&#x505C;&#x7559;&#x5728;&#x505A;&#x51FA;&#x6210;&#x679C;&#x7684;&#x559C;&#x6085;&#xFF0C;&#x800C;&#x505C;&#x6EEF;&#x4E86;&#x512A;&#x5316;&#x7684;&#x6B65;&#x8ABF;&#x3002;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6703;&#x5EFA;&#x8B70;&#x5728;&#x958B;&#x767C;&#x7576;&#x4E0B;&#x5C31;&#x300C;&#x591A;&#x60F3;&#x300D;&#x5169;&#x79D2;&#x9418;&#xFF0C;&#x611F;&#x89BA;&#x53EF;&#x512A;&#x5316;&#x4F46;&#x4F86;&#x4E0D;&#x53CA;&#x7684;&#x90E8;&#x5206;&#x5148;&#x5728;&#x65C1;&#x908A;&#x52A0;&#x500B;&#x8A3B;&#x89E3;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#x3002;&#x53E6;&#x5916;&#x4E5F;&#x990A;&#x6210;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#x56DE;&#x982D;&#x770B;&#x4E4B;&#x524D;&#x7684;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x7FD2;&#x6163;&#xFF0C;&#x8A66;&#x8457;&#x523B;&#x610F;&#x627E;&#x51FA;&#x53EF;&#x4EE5;&#x512A;&#x5316;&#x6539;&#x9032;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5C08;&#x6848;&#x7684;&#x63D0;&#x4EA4;&#x53EF;&#x80FD;&#x6703;&#x6709;&#x671F;&#x9650;&#xFF0C;&#x4F46;&#x7A0B;&#x5F0F;&#x78BC;&#x7684;&#x512A;&#x5316;&#x6C92;&#x6709;&#x76E1;&#x982D;&#x3002;&#x9762;&#x5C0D;&#x76F8;&#x540C;&#x7684;&#x5C08;&#x6848;&#x8207;&#x7A0B;&#x5F0F;&#x78BC;&#xFF0C;&#x552F;&#x6709;&#x900F;&#x904E;&#x4E0D;&#x505C;&#x7684;&#x8FED;&#x4EE3;&#x512A;&#x5316;&#x624D;&#x80FD;&#x6253;&#x9020;&#x66F4;&#x597D;&#x7684;&#x7A0B;&#x5F0F;&#xFF0C;&#x540C;&#x6642;&#x4E5F;&#x898B;&#x8B49;&#x4E86;&#x4F60;&#x548C;&#x7A0B;&#x5F0F;&#x4E00;&#x8D77;&#x8B8A;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x904E;&#x7A0B;&#x3002;&#x6240;&#x4EE5;&#x5EFA;&#x7ACB;&#x9010;&#x6B65;&#x512A;&#x5316;&#x7684;&#x7A7A;&#x9593;&#xFF0C;&#x990A;&#x6210;&#x6301;&#x7E8C;&#x63D0;&#x5347;&#x7A0B;&#x5F0F;&#x78BC;&#x54C1;&#x8CEA;&#x7684;&#x7FD2;&#x6163;&#xFF0C;&#x624D;&#x662F;&#x4E00;&#x500B;&#x65B0;&#x624B;&#x5DE5;&#x7A0B;&#x5E2B;&#x9700;&#x8981;&#x4FEE;&#x7149;&#x7684;&#x5FC3;&#x6CD5;&#x3002;</p>
<!-- Begin Mailchimp Signup Form -->
<p><div id="mc_embed_signup"><form action="https://accupass.us6.list-manage.com/subscribe/post?u=840b112be5bede36036e19d3e&amp;id=d23f3a8e3a" method="post" id="mc-embedded-subscribe-form" name="mc-embedded-subscribe-form" class="validate" target="_blank" novalidate><div id="mc_embed_signup_scroll"><label for="mce-EMAIL">&#x5982;&#x679C;&#x60F3;&#x7372;&#x5F97;&#x6700;&#x65B0;&#x7684;&#x6280;&#x8853;&#x8CC7;&#x8A0A;&#xFF0C;&#x6B61;&#x8FCE;&#x8A02;&#x95B1;&#x8FFD;&#x8E64;&#xFF1A;</label><input type="email" value name="EMAIL" class="email" id="mce-EMAIL" placeholder="email address" required><div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_840b112be5bede36036e19d3e_d23f3a8e3a" tabindex="-1" value></div><div class="clear"><input type="submit" value="Subscribe" name="subscribe" id="mc-embedded-subscribe" class="button"></div></div></form></div><br><!--End mc_embed_signup--></p>
<hr>
<p style="color: #6d9eeb"><br>&#x55E8;&#xFF0C;&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x7DAD;&#x5143;&#xFF0C;&#x6301;&#x7E8C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x767C;&#x8868;&#x5C0D; #&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x3001; #&#x7DB2;&#x9801;&#x958B;&#x767C; &#x6216; #&#x8EDF;&#x9AD4;&#x8077;&#x6DAF; &#x76F8;&#x95DC;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x5982;&#x679C;&#x5C0D;&#x65BC;&#x5167;&#x6587;&#x6709;&#x7591;&#x554F;&#x90FD;&#x6B61;&#x8FCE;&#x8207;&#x6211;&#x5011;&#x9032;&#x4E00;&#x6B65;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x8FFD;&#x8E64;&#x6211;&#x7684; <a href="https://pse.is/3cazqk" style="color: #ff0000; font-weight: bold; text-decoration: underline;" target="_blank" rel="noopener">Facebook &#x7C89;&#x5C08;&#xFF1A;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684;&#x5DE5;&#x4F5C;&#x65E5;&#x5E38;</a> &#xFF0C;&#x4E5F;&#x6703;&#x4E0D;&#x5B9A;&#x6642;&#x7684;&#x8209;&#x8FA6;&#x5206;&#x4EAB;&#x6D3B;&#x52D5;&#xFF0C;&#x4E00;&#x8D77;&#x4F86;&#x73A9;&#x73A9;&#x5427; &#x30FD;(&#x25CF;&#xB4;&#x2200;`&#x25CF;)&#xFF89;<br><br>&#x6700;&#x8FD1;&#x8209;&#x8FA6;&#x4E86;&#x3010;<a href="https://pse.is/3bae23" style="color: #ff0000; font-weight: bold; text-decoration: underline;" target="_blank" rel="noopener">&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684; 12 &#x5802;&#x5FC3;&#x6CD5;&#x990A;&#x6210;&#x8AB2;</a>&#x3011;&#x7684;&#x76F4;&#x64AD;&#x8AB2;&#x7A0B;&#xFF0C;&#x672C;&#x7CFB;&#x5217;&#x8AB2;&#x7A0B;&#x6703;&#x5F9E;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9019;&#x500B;&#x6280;&#x8853;&#x7684;&#x767C;&#x5C55;&#x8207;&#x6F14;&#x9032;&#x8AC7;&#x8D77;&#xFF0C;&#x7D50;&#x5408;&#x7406;&#x8AD6;&#x8207;&#x5BE6;&#x4F5C;&#x53BB;&#x63A2;&#x7D22;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x771F;&#x5BE6;&#x4E16;&#x754C;&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#x57F9;&#x990A;&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x4E0B;&#x7684;&#x601D;&#x7DAD;&#x8207;&#x6280;&#x8853;&#x3002;&#x6211;&#x5011;&#x900F;&#x904E; 12 &#x5802;&#x8AB2;&#x7A0B;&#xFF0C;&#x5167;&#x5BB9;&#x5C07;&#x6703;&#x8AC7;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x767C;&#x5C55;&#x8108;&#x7D61;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x500B;&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x8A72;&#x5982;&#x4F55;&#x767C;&#x8D77;&#xFF0C;&#x958B;&#x59CB;&#x5F8C;&#x8A72;&#x5982;&#x4F55;&#x5BE6;&#x73FE;&#xFF0C;&#x9010;&#x6B65;&#x5EFA;&#x69CB;&#x5168;&#x9762;&#x7684;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5FC3;&#x6CD5;&#x3002;&#x6703;&#x7528;&#x767D;&#x8A71;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x6700;&#x4F4E;&#x9650;&#x5EA6;&#x7684;&#x6578;&#x5B78;&#x8207;&#x7A0B;&#x5F0F;&#x4E4B;&#x4E0B;&#x5E36;&#x4F60;&#x57F9;&#x990A;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x6240;&#x9700;&#x7684;&#x6838;&#x5FC3;&#x5FC3;&#x6CD5; &#x1F680;&#x1F680;&#x1F680;<br><br><img src="https://imgur.com/gU2xKg5.png" alt><br><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://weiyuan.pse.is/3bcu7c" target="_blank" rel="noopener">https://weiyuan.pse.is/3bcu7c</a><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://weiyuan.pse.is/3bcu7c" target="_blank" rel="noopener">https://weiyuan.pse.is/3bcu7c</a><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://weiyuan.pse.is/3bcu7c" target="_blank" rel="noopener">https://weiyuan.pse.is/3bcu7c</a><br></p>

<p><img src="https://imgur.com/Dv7dkMJ.png" alt></p>
<hr>
<h2 id="license"><a href="#License" class="headerlink" title="License"></a>License</h2><blockquote>
<p>&#x672C;&#x6587;&#x540C;&#x6642;&#x767C;&#x8868;&#x65BC; <a href="https://tw.alphacamp.co/blog/code-review" target="_blank" rel="noopener">Code Review&#x600E;&#x9EBC;&#x505A;&#xFF1F;&#x65B0;&#x624B;&#x5DE5;&#x7A0B;&#x5E2B;&#x5982;&#x4F55;&#x63D0;&#x5347;&#x300C;&#x7A0B;&#x5F0F;&#x78BC;&#x54C1;&#x8CEA;&#x300D;</a>&#x3002;</p>
</blockquote>
<p><img src="http://i.creativecommons.org/l/by-sa/3.0/88x31.png" style="    margin: 0;"><br>&#x672C;&#x8457;&#x4F5C;&#x7531;<a href="https://www.facebook.com/v123582" target="_blank" rel="noopener">Chang Wei-Yaun (v123582)</a>&#x88FD;&#x4F5C;&#xFF0C;<br>&#x4EE5;<a href="http://creativecommons.org/licenses/by-sa/3.0/deed.zh_TW" target="_blank" rel="noopener">&#x5275;&#x7528;CC &#x59D3;&#x540D;&#x6A19;&#x793A;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5206;&#x4EAB; 3.0 Unported</a>&#x6388;&#x6B0A;&#x689D;&#x6B3E;&#x91CB;&#x51FA;&#x3002;</p>
</div><div class="post-nav"><a href="/2021/04/30/有了模型然後呢？從分析模型到數據產品/" class="pre"><i class="icon-previous">有了模型然後呢？從資料模型到數據產品</i></a><a href="/2020/12/25/身為資料科學家，R、Python-與-Julia-該怎麼選？/" class="next">身為資料科學家，R、Python 與 Julia 該怎麼選？<i class="icon-next"></i></a></div><div id="disqus_thread"><script>var disqus_shortname = 'v123582';
var disqus_identifier = '2021/03/10/程式碼持續優化的秘訣-Code-Review/';
var disqus_title = '程式碼持續優化的秘訣 - Code Review';
var disqus_url = 'https://blog.v12358.tw/2021/03/10/程式碼持續優化的秘訣-Code-Review/';
(function() {
  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();</script><script id="dsq-count-scr" src="//v123582.disqus.com/count.js" async="async"></script></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><div class="widget-title">Information</div><ul><div class="tags">標籤：<a href="/tags/前端開發筆記/">前端開發筆記 </a><a href="/tags/經驗分享系列/">經驗分享系列 </a><a href="/tags/團隊養成系列/">團隊養成系列 </a><a href="/tags/後端開發筆記/">後端開發筆記 </a></div><div class="categories">分類：<a href="/categories/Web-development/">Web development</a></div></ul></div><div class="widget"><div class="widget-title">Table of Content</div><div class="clear"><div id="toc" class="toc-article"><div class="toc"></div></div></div></div><script type="text/javascript" src="//js1.bloggerads.net/ShowAds.aspx?blogid=20190326000001" async></script></div></div></div><div id="footer">© <a href="/" rel="nofollow">資料科學家的工作日常.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><script src="/js/jquery.min.js"></script>
<script src="/js/share.js"></script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script><a id="rocket" href="#top" class="show"></a><script src="/js/jquery.min.js"></script>
<script src="/js/totop.js"></script><script src="/js/fancybox.pack.js"></script>
<script src="/js/jquery.fancybox.js"></script><link rel="stylesheet" href="/css/jquery.fancybox.css"><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
ga('create','UA-59103909-1','auto');ga('send','pageview');
</script></div><!-- hexo-inject:begin --><!-- hexo-inject:end --></body></html>