<!DOCTYPE html><html lang="zh-TW"><head><meta name="generator" content="Hexo 3.9.0"><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><meta property="og:image" content="https://avatars2.githubusercontent.com/u/5959524?v=3&amp;s=300"><meta property="og:description" content="WeiYuan Note | 爬蟲又被擋了怎麼辦？常見的反爬蟲處理策略"><meta property="og:title" content="爬蟲又被擋了怎麼辦？常見的反爬蟲處理策略"><title>爬蟲又被擋了怎麼辦？常見的反爬蟲處理策略 | 資料科學家的工作日常</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"><link rel="stylesheet" type="text/css" href="/css/pure-min.css"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css"><link rel="stylesheet" type="text/css" href="/css/profile-card.css"><link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.4.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"><link href="//cdn-images.mailchimp.com/embedcode/slim-10_7.css" rel="stylesheet" type="text/css"><script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><script><!-- hexo-inject:begin --><!-- hexo-inject:end -->(adsbygoogle = window.adsbygoogle || []).push({
google_ad_client: "ca-pub-7913880396333307",
enable_page_level_ads: true
});


</script><!-- hexo-inject:begin --><!-- hexo-inject:end --></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">爬蟲又被擋了怎麼辦？常見的反爬蟲處理策略</h1><a id="logo" href="https://v123582.github.io">資料科學家的工作日常</a><p class="description">#遠端 #斜槓 #教學 #資料科學 #網站開發</p></div><div id="nav-menu"><a href="https://v123582.github.io/about"><i class="icon-about"> 關於</i></a><a href="https://v123582.github.io/project"><i class="fa fa-tasks"> 專案</i></a><a href="https://v123582.github.io/blog"><i class="icon-archive"> 技術</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post post-page"><h1 class="post-title"><span><i class="fa fa-star"></i></span>爬蟲又被擋了怎麼辦？常見的反爬蟲處理策略</h1><div class="post-meta">2021-09-09 | WeiYuan (@v123582)</div><a data-url="https://blog.v12358.tw/2021/09/09/爬蟲又被擋了怎麼了？常見的反爬蟲處理策略/" data-id="cktgnccsp007juwob9wyemtbs" class="article-share-link">Share</a><div class="post-content"><p>&#x8CC7;&#x6599;&#x722C;&#x87F2;&#x662F;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x7684;&#x8D77;&#x624B;&#x5F0F;&#xFF0C;&#x5FC5;&#x9808;&#x6709;&#x597D;&#x7684;&#x3001;&#x53EF;&#x7528;&#x7684;&#x8CC7;&#x6599;&#x624D;&#x5F97;&#x4EE5;&#x9032;&#x884C;&#x9AD8;&#x54C1;&#x8CEA;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5C08;&#x6848;&#xFF0C;&#x722C;&#x87F2;&#x4E5F;&#x662F;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9818;&#x57DF;&#x958B;&#x767C;&#x8005;&#x7684;&#x7B2C;&#x4E00;&#x9805;&#x6311;&#x6230;&#x3002;&#x4F46;&#x662F;&#x7576;&#x4F60;&#x5B78;&#x5B8C;&#x722C;&#x87F2;&#x7684;&#x6280;&#x8853;&#x4E4B;&#x5F8C;&#xFF0C;&#x958B;&#x59CB;&#x771F;&#x7684;&#x8DF3;&#x5165;&#x722C;&#x87F2;&#x4E16;&#x754C;&#x4E4B;&#x5F8C;&#x6703;&#x767C;&#x73FE;&#x6709;&#x7DB2;&#x7AD9;&#x5176;&#x5BE6;&#x6C92;&#x6709;&#x60F3;&#x50CF;&#x4E2D;&#x597D;&#x722C;&#x3002;&#x7576;&#x81EA;&#x52D5;&#x5316;&#x7684;&#x722C;&#x87F2;&#x6280;&#x8853;&#x8D8A;&#x4F86;&#x8D8A;&#x5EE3;&#x6CDB;&#x61C9;&#x7528;&#x7684;&#x540C;&#x6642;&#xFF0C;&#x7DB2;&#x7AD9;&#x65B9;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x300C;&#x53CD;&#x722C;&#x87F2;&#x300D;&#x7684;&#x6A5F;&#x5236;&#x51FA;&#x73FE;&#xFF0C;&#x8B93;&#x958B;&#x767C;&#x8005;&#x7121;&#x6CD5;&#x8F15;&#x6613;&#x7684;&#x722C;&#x87F2;&#x6240;&#x9700;&#x7684;&#x8CC7;&#x6599;&#x3002;&#x4ECA;&#x5929;&#x9019;&#x7BC7;&#x6587;&#x7AE0;&#x60F3;&#x8DDF;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x7684;&#x662F;&#x7576;&#x4F60;&#x7684;&#x722C;&#x87F2;&#x7A0B;&#x5F0F;&#x53C8;&#x88AB;&#x64CB;&#x4E86;&#x600E;&#x9EBC;&#x8FA6;&#xFF1F;&#x5E38;&#x898B;&#x7684;&#x53CD;&#x722C;&#x87F2;&#x77E5;&#x8B58;&#x4EE5;&#x53CA;&#x5C0D;&#x61C9;&#x7684;&#x514B;&#x670D;&#x53CD;&#x722C;&#x87F2;&#x8655;&#x7406;&#x7B56;&#x7565;&#x6709;&#x54EA;&#x4E9B;&#x3002;</p>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><p><img src="https://imgur.com/1Tgehew.png" alt></p>
<h2 id="&#x4EC0;&#x9EBC;&#x662F;&#x60E1;&#x610F;&#x722C;&#x87F2;"><a href="#&#x4EC0;&#x9EBC;&#x662F;&#x60E1;&#x610F;&#x722C;&#x87F2;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x9EBC;&#x662F;&#x60E1;&#x610F;&#x722C;&#x87F2;&#xFF1F;"></a>&#x4EC0;&#x9EBC;&#x662F;&#x60E1;&#x610F;&#x722C;&#x87F2;&#xFF1F;</h2><p>&#x7A0B;&#x5F0F;&#x64C1;&#x6709;&#x300C;&#x57F7;&#x884C;&#x901F;&#x5EA6;&#x300D;&#x8207;&#x300C;&#x8A18;&#x61B6;&#x5132;&#x5B58;&#x300D;&#x9019;&#x5169;&#x7A2E;&#x7279;&#x6027;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7A0B;&#x5F0F;&#x81EA;&#x52D5;&#x5316;&#x7684;&#x91CD;&#x8907;&#x3001;&#x5927;&#x91CF;&#x57F7;&#x884C;&#x6307;&#x5B9A;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x7DB2;&#x9801;&#x722C;&#x87F2;&#x5373;&#x662F;&#x7528;&#x7A0B;&#x5F0F;&#x81EA;&#x52D5;&#x5316;&#x5BE6;&#x73FE;&#x6536;&#x96C6;&#x4F86;&#x81EA;&#x65BC;&#x7DB2;&#x9801;&#x4E2D;&#x8CC7;&#x6599;&#x7684;&#x4E00;&#x7A2E;&#x5834;&#x666F;&#xFF0C;&#x4F46;&#x82E5;&#x9019;&#x500B;&#x300C;&#x81EA;&#x52D5;&#x5316;&#x300D;&#x592A;&#x66B4;&#x529B;&#x6642;&#x5247;&#x53EF;&#x80FD;&#x6703;&#x9020;&#x6210;&#x5C0D;&#x65B9;&#x7684;&#x7DB2;&#x7AD9;&#x53D7;&#x5230;&#x5F71;&#x97FF;&#xFF0C;&#x7A31;&#x70BA;&#x300C;&#x60E1;&#x610F;&#x6A5F;&#x5668;&#x4EBA;&#xFF08; Bat Bot &#xFF09;&#x300D;&#x3002;&#x7DB2;&#x9801;&#x722C;&#x87F2;&#x81EA;&#x52D5;&#x5316;&#x6536;&#x96C6;&#x7684;&#x884C;&#x70BA;&#x592A;&#x66B4;&#x529B;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x6703;&#x9020;&#x6210;&#x5C0D;&#x65B9;&#x7684;&#x7DB2;&#x7AD9;&#x53D7;&#x5230;&#x5F71;&#x97FF;&#xFF0C;&#x5E38;&#x898B;&#x7684;&#x60E1;&#x610F;&#x884C;&#x70BA;&#x6709;&#x4EE5;&#x4E0B;&#x5E7E;&#x7A2E;&#xFF1A;</p>
<ul>
<li>DoS &#x6216; DDoS</li>
<li>&#x975E;&#x4EBA;&#x70BA;&#x7684;&#x5EE3;&#x544A;&#x9EDE;&#x64CA;&#x884C;&#x70BA;</li>
<li>&#x7570;&#x5E38;&#x6D41;&#x91CF;</li>
<li>&#x5546;&#x696D;&#x6A5F;&#x5BC6;&#x6D29;&#x6F0F;</li>
</ul>
<h2 id="&#x5E38;&#x898B;&#x7684;&#x53CD;&#x722C;&#x87F2;&#x8655;&#x7406;&#x7B56;&#x7565;"><a href="#&#x5E38;&#x898B;&#x7684;&#x53CD;&#x722C;&#x87F2;&#x8655;&#x7406;&#x7B56;&#x7565;" class="headerlink" title="&#x5E38;&#x898B;&#x7684;&#x53CD;&#x722C;&#x87F2;&#x8655;&#x7406;&#x7B56;&#x7565;"></a>&#x5E38;&#x898B;&#x7684;&#x53CD;&#x722C;&#x87F2;&#x8655;&#x7406;&#x7B56;&#x7565;</h2><p>&#x56E0;&#x6B64;&#xFF0C;&#x53CD;&#x722C;&#x87F2;&#x4E3B;&#x8981;&#x5C31;&#x662F;&#x91DD;&#x5C0D;&#x300C;&#x60E1;&#x610F;&#x7684;&#x722C;&#x87F2;&#x7A0B;&#x5F0F;&#x300D;&#x8A2D;&#x8A08;&#x7684;&#x9632;&#x5835;&#x6A5F;&#x5236;&#xFF0C;&#x5305;&#x542B;&#x300C;&#x7CFB;&#x7D71;&#x8CA0;&#x64D4;&#x300D;&#x8207;&#x300C;&#x8CC7;&#x6599;&#x6D29;&#x6F0F;&#x300D;&#x5169;&#x500B;&#x89D2;&#x5EA6;&#x3002;&#x5F9E;&#x300C;&#x8CC7;&#x6599;&#x6D29;&#x6F0F;&#x300D;&#x7684;&#x89D2;&#x5EA6;&#x4F86;&#x770B;&#xFF0C;&#x8A31;&#x591A;&#x7DB2;&#x7AD9;&#x70BA;&#x4E86;&#x4FDD;&#x8B77;&#x8CC7;&#x6599;&#x3001;&#x907F;&#x514D;&#x7DB2;&#x9801;&#x4E0A;&#x7684;&#x516C;&#x958B;&#x8CC7;&#x8A0A;&#x88AB;&#x7DB2;&#x9801;&#x722C;&#x87F2;&#x7D66;&#x6293;&#x53D6;&#xFF0C;&#x800C;&#x51FA;&#x73FE;&#x4E86;&#x300C;&#x53CD;&#x722C;&#x87F2;&#x300D;&#x7684;&#x6A5F;&#x5236;&#x51FA;&#x73FE;&#x3002;&#x6240;&#x8B02;&#x300C;&#x9053;&#x9AD8;&#x4E00;&#x5C3A;&#xFF0C;&#x9B54;&#x9AD8;&#x4E00;&#x4E08;&#x300D;&#xFF0C;&#x722C;&#x87F2;&#x5DE5;&#x7A0B;&#x5E2B;&#x4E5F;&#x767C;&#x5C55;&#x4E86;&#x51FA;&#x4E00;&#x7CFB;&#x5217;&#x300C;&#x53CD;&#x53CD;&#x722C;&#x87F2;&#x300D;&#x7684;&#x7B56;&#x7565;&#x3002;&#x63DB;&#x53E5;&#x8A71;&#x8AAA;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x5011;&#x5728;&#x601D;&#x8003;&#x5982;&#x4F55;&#x514B;&#x670D;&#x53CD;&#x722C;&#x87F2;&#x8655;&#x7406;&#x7B56;&#x7565;&#xFF0C;&#x5176;&#x5BE6;&#x80CC;&#x5F8C;&#x601D;&#x8003;&#x7684;&#x9EDE;&#x662F;&#x5982;&#x4F55;&#x8B93;&#x4F60;&#x7684;&#x722C;&#x87F2;&#x4E0D;&#x8981;&#x8E29;&#x5230;&#x5C0D;&#x65B9;&#x7684;&#x7DDA;&#x3002;&#x5E38;&#x898B;&#x7684;&#x514B;&#x670D;&#x53CD;&#x722C;&#x87F2;&#x8655;&#x7406;&#x7B56;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x700F;&#x89BD;&#x5668;&#x6A19;&#x982D;&#x8207;&#x57FA;&#x672C;&#x8CC7;&#x8A0A;</li>
<li>&#x9A57;&#x8B49;&#x78BC;&#x8655;&#x7406;</li>
<li>&#x6A21;&#x64EC;&#x771F;&#x5BE6;&#x7528;&#x6236;&#x767B;&#x5165;&#x6388;&#x6B0A;</li>
<li>&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x4F3A;&#x670D;&#x5668;&#x8207;&#x7B2C;&#x4E09;&#x65B9;IP</li>
<li>JavaScript &#x6E32;&#x67D3;&#x7684;&#x52D5;&#x614B;&#x7DB2;&#x9801;</li>
</ul>
<h3 id="&#x700F;&#x89BD;&#x5668;&#x6A19;&#x982D;&#x8207;&#x57FA;&#x672C;&#x8CC7;&#x8A0A;"><a href="#&#x700F;&#x89BD;&#x5668;&#x6A19;&#x982D;&#x8207;&#x57FA;&#x672C;&#x8CC7;&#x8A0A;" class="headerlink" title="&#x700F;&#x89BD;&#x5668;&#x6A19;&#x982D;&#x8207;&#x57FA;&#x672C;&#x8CC7;&#x8A0A;"></a>&#x700F;&#x89BD;&#x5668;&#x6A19;&#x982D;&#x8207;&#x57FA;&#x672C;&#x8CC7;&#x8A0A;</h3><p>&#x7DB2;&#x9801;&#x7684;&#x50B3;&#x8F38;&#x6703;&#x6839;&#x64DA; HTTP &#x5354;&#x5B9A;&#x5C07;&#x6E9D;&#x901A;&#x5206;&#x70BA;&#x300C;Request&#x300D;&#x548C;&#x300C;Response&#x300D;&#x5169;&#x7A2E;&#x89D2;&#x8272;&#xFF1A;</p>
<p><img src="https://imgur.com/HsLJqTX.png" alt></p>
<p>&#x5176;&#x4E2D; Request &#x7576;&#x4E2D;&#x7684; Header&#xFF08;&#x6A19;&#x982D;&#x6A94;&#xFF09;&#x6703;&#x7531;&#x700F;&#x89BD;&#x5668;&#x81EA;&#x52D5;&#x7522;&#x751F;&#xFF0C;&#x5305;&#x542B;&#x8DDF;&#x767C;&#x9001;&#x65B9;&#x6709;&#x95DC;&#x7684;&#x8CC7;&#x8A0A;&#xFF0C;&#x4F8B;&#x5982;&#x300C;Host&#x300D;&#x3001;&#x300C;User-Agent&#x300D;.. &#x7B49;&#x7B49;&#x3002;</p>
<p><img src="https://imgur.com/prpC8yd.png" alt></p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x8A31;&#x591A;&#x7DB2;&#x7AD9;&#x6703;&#x5C07; HTTP Header &#x8996;&#x70BA;&#x662F;&#x7B2C;&#x4E00;&#x500B;&#x6AA2;&#x67E5;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5229;&#x7528; Header &#x5224;&#x65B7;&#x4F86;&#x6E90;&#x662F;&#x5426;&#x5408;&#x6CD5;&#x3002;Header &#x6703;&#x7531;&#x700F;&#x89BD;&#x5668;&#x81EA;&#x52D5;&#x7522;&#x751F;&#xFF0C;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x900F;&#x904E;&#x7A0B;&#x5F0F;&#x767C;&#x51FA;&#x7684;&#x8ACB;&#x6C42;&#x9810;&#x8A2D;&#x662F;&#x6C92;&#x6709; Header &#x7684;&#x3002;</p>
<h3 id="&#x9A57;&#x8B49;&#x78BC;&#x8655;&#x7406;"><a href="#&#x9A57;&#x8B49;&#x78BC;&#x8655;&#x7406;" class="headerlink" title="&#x9A57;&#x8B49;&#x78BC;&#x8655;&#x7406;"></a>&#x9A57;&#x8B49;&#x78BC;&#x8655;&#x7406;</h3><p>&#x4F60;&#x5728;&#x700F;&#x89BD;&#x7DB2;&#x9801;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x6709;&#x770B;&#x904E;&#x9019;&#x4E9B;&#x9A57;&#x8B49;&#x6A5F;&#x5236;&#x55CE;&#xFF1F;&#x7DB2;&#x9801;&#x9A57;&#x8B49;&#x78BC;&#x7684;&#x5C08;&#x696D;&#x8853;&#x8A9E;&#x7A31;&#x70BA;&#x300C;CAPTCHA &#x300D;&#xFF08;&#x5168;&#x540D;&#x662F; Completely Automated Public Turing test to tell Computers and Humans Apart &#x81EA;&#x52D5;&#x5224;&#x5225;&#x96FB;&#x8166;&#x8207;&#x4EBA;&#x985E;&#x7684;&#x516C;&#x958B;&#x5716;&#x9748;&#x6E2C;&#x8A66;&#xFF09;&#xFF0C;&#x662F;&#x76EE;&#x524D;&#x5728;&#x7DB2;&#x9801;&#x7576;&#x4E2D;&#x5E38;&#x898B;&#x7684;&#x4E00;&#x7A2E;&#x9A57;&#x8B49;&#x6A5F;&#x5236;&#xFF0C;&#x7528;&#x4F86;&#x5224;&#x65B7;&#x60E1;&#x610F;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x5E72;&#x64FE;&#x8207;&#x653B;&#x64CA;&#x3002;&#x9A57;&#x8B49;&#x78BC;&#x6A5F;&#x5236;&#x662F;&#x8A31;&#x591A;&#x7DB2;&#x7AD9;&#x50B3;&#x9001;&#x8CC7;&#x6599;&#x7684;&#x6AA2;&#x67E5;&#x6A5F;&#x5236;&#xFF0C;&#x5C0D;&#x65BC;&#x975E;&#x4EBA;&#x985E;&#x64CD;&#x4F5C;&#x8207;&#x5927;&#x91CF;&#x983B;&#x7E41;&#x64CD;&#x4F5C;&#x90FD;&#x6709;&#x4E0D;&#x932F;&#x7684;&#x9632;&#x7BC4;&#x6A5F;&#x5236;&#x3002;</p>
<p><img src="https://imgur.com/m5dr5v8.png" alt></p>
<p>&#x722C;&#x87F2;&#x5728;&#x5BE6;&#x4F5C;&#x4E0A;&#x9047;&#x5230;&#x9A57;&#x8B49;&#x78BC;&#x7684;&#x505A;&#x6CD5;&#x6703;&#x662F;&#x9019;&#x6A23;&#xFF0C;&#x5148;&#x628A;&#x5716;&#x6293;&#x56DE;&#x4F86;&#xFF0C;&#x518D;&#x642D;&#x914D;&#x5716;&#x5F62;&#x8B58;&#x5225;&#x5DE5;&#x5177;&#x627E;&#x51FA;&#x5716;&#x4E2D;&#x7684;&#x5167;&#x5BB9;&#x3002;&#x4E4B;&#x524D;&#x4E5F;&#x6709;&#x5BEB;&#x904E;&#x4E00;&#x7BC7;&#x91DD;&#x5C0D;&#x6ED1;&#x52D5;&#x9A57;&#x8B49;&#x78BC;&#x7684;&#x89E3;&#x6CD5;&#xFF1A;&#x300C;<a href="https://blog.v123582.tw/2021/06/05/%E8%AE%93-Python-%E7%88%AC%E8%9F%B2%E4%B9%9F%E8%83%BD%E8%AE%80%E5%BE%97%E6%87%82%E3%80%8C%E6%BB%91%E5%8B%95%E9%A9%97%E8%AD%89%E7%A2%BC%E3%80%8D/" target="_blank" rel="noopener">&#x8B93; Python &#x722C;&#x87F2;&#x4E5F;&#x80FD;&#x8B80;&#x5F97;&#x61C2;&#x300C;&#x6ED1;&#x52D5;&#x9A57;&#x8B49;&#x78BC;&#x300D;</a>&#x300D;&#xFF0C;&#x6709;&#x8208;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x53EF;&#x4EE5;&#x770B;&#x4E00;&#x4E0B;&#x3002;</p>
<h3 id="&#x6A21;&#x64EC;&#x771F;&#x5BE6;&#x7528;&#x6236;&#x767B;&#x5165;&#x6388;&#x6B0A;"><a href="#&#x6A21;&#x64EC;&#x771F;&#x5BE6;&#x7528;&#x6236;&#x767B;&#x5165;&#x6388;&#x6B0A;" class="headerlink" title="&#x6A21;&#x64EC;&#x771F;&#x5BE6;&#x7528;&#x6236;&#x767B;&#x5165;&#x6388;&#x6B0A;"></a>&#x6A21;&#x64EC;&#x771F;&#x5BE6;&#x7528;&#x6236;&#x767B;&#x5165;&#x6388;&#x6B0A;</h3><p>&#x5927;&#x90E8;&#x5206;&#x7DB2;&#x7AD9;&#x90FD;&#x6709;&#x6B0A;&#x9650;&#x7BA1;&#x7406;&#x6A5F;&#x5236;&#xFF0C;&#x4F7F;&#x7528;&#x4E0A;&#x4E5F;&#x6703;&#x6709;&#x767B;&#x5165;/&#x767B;&#x51FA;&#x7684;&#x6A5F;&#x5236;&#x3002;&#x4F46;&#x7531;&#x65BC;&#x722C;&#x87F2;&#x591A;&#x534A;&#x662F;&#x57FA;&#x65BC; HTTP Request /Response &#x4E00;&#x4F86;&#x4E00;&#x56DE;&#x7684;&#x65B9;&#x5F0F;&#x53D6;&#x8CC7;&#x6599;&#x3002;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x722C;&#x87F2;&#x7A0B;&#x5F0F;&#x7684;&#x8A71;&#xFF0C;&#x8981;&#x5982;&#x4F55;&#x6A21;&#x64EC;&#x4F7F;&#x7528;&#x8005;&#x767B;&#x5165;&#x7684;&#x884C;&#x70BA;&#x5C31;&#x6703;&#x662F;&#x4E00;&#x500B;&#x6311;&#x6230;&#x3002;&#x6211;&#x5011;&#x628A;&#x300C;&#x767B;&#x5165;&#x7CFB;&#x7D71;/&#x6703;&#x54E1;&#x6A5F;&#x5236;&#x300D;&#x904E;&#x7A0B;&#x7A31;&#x70BA;&#x300C;&#x6388;&#x6B0A;&#x300D;&#xFF0C;&#x800C;&#x5728;&#x7DB2;&#x7AD9;&#x958B;&#x767C;&#x4E2D;&#x7684;&#x7684;&#x6388;&#x6B0A;&#x505A;&#x6CD5;&#x6709;&#x5169;&#x7A2E;&#xFF1A;&#x300C;token&#x300D;&#x8DDF;&#x300C;session/cookie&#x300D;&#x3002;</p>
<p>Token &#x985E;&#x4F3C; API &#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x6BCF;&#x6B21;&#x8ACB;&#x6C42;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#x4E5F;&#x628A;&#x4F60;&#x7533;&#x8ACB;&#x5230;&#x7684;&#x5408;&#x6CD5;&#x6B0A;&#x6756;&#xFF08;token&#xFF09;&#x4E00;&#x8D77;&#x5E36;&#x4E0A;&#x3002;&#x901A;&#x5E38;&#x9700;&#x8981;&#x7531;&#x958B;&#x767C;&#x8005;&#x81EA;&#x5DF1;&#x653E;&#x5728; Request &#x7684; Headers &#x7576;&#x4E2D;&#xFF0C;&#x8B93;&#x5C0D;&#x65B9;&#x53EF;&#x4EE5;&#x5224;&#x5225;&#x4F60;&#x662F;&#x4E00;&#x500B;&#x5408;&#x6CD5;&#x767B;&#x5165;&#x7684;&#x4F86;&#x6E90;&#xFF1B;Session/Cookie&#xFF1A;&#x7B2C;&#x4E8C;&#x7A2E;&#x65B9;&#x6CD5;&#x662F;&#x7DB2;&#x7AD9;&#x6703;&#x4E3B;&#x52D5;&#x628A;&#x6B0A;&#x9650;&#x5224;&#x65B7;&#x5132;&#x5B58;&#x5728;&#x300C;&#x700F;&#x89BD;&#x5668;&#x7576;&#x4E2D;&#x7684; cookie&#x300D;&#xFF0C;&#x767C;&#x51FA; Request &#x8ACB;&#x6C42;&#x6642;&#x6703;&#x81EA;&#x52D5;&#x8DDF;&#x8457;&#x8ACB;&#x6C42;&#x4E00;&#x8D77;&#x767C;&#x51FA;&#x53BB;&#x3002;</p>
<h3 id="&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x4F3A;&#x670D;&#x5668;&#x8207;&#x7B2C;&#x4E09;&#x65B9;ip"><a href="#&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x4F3A;&#x670D;&#x5668;&#x8207;&#x7B2C;&#x4E09;&#x65B9;IP" class="headerlink" title="&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x4F3A;&#x670D;&#x5668;&#x8207;&#x7B2C;&#x4E09;&#x65B9;IP"></a>&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x4F3A;&#x670D;&#x5668;&#x8207;&#x7B2C;&#x4E09;&#x65B9;IP</h3><p>&#x7576;&#x722C;&#x87F2;&#x7A0B;&#x5F0F;&#x5927;&#x91CF;&#x5B58;&#x53D6;&#x7279;&#x5B9A;&#x7DB2;&#x7AD9;&#x6642;&#xFF0C;&#x7DB2;&#x7AD9;&#x65B9;&#x53EF;&#x4EE5;&#x63A1;&#x7528;&#x6700;&#x76F4;&#x63A5;&#x7684;&#x9632;&#x8B77;&#x6A5F;&#x5236; - &#x5C01;&#x9396; IP&#xFF0C;&#x76F4;&#x63A5;&#x900F;&#x904E;&#x5E95;&#x5C64;&#x7684;&#x65B9;&#x5F0F;&#x505A;&#x5C4F;&#x853D;&#x3002;&#x9019;&#x908A;&#x7684;&#x89E3;&#x6CD5;&#x6211;&#x5011;&#x6703;&#x63A1;&#x7528;&#x300C;&#x4EE3;&#x7406;&#x4F3A;&#x670D;&#x5668;&#xFF08;Proxy&#xFF09;&#x300D;&#x7684;&#x6982;&#x5FF5;&#x4F86;&#x8655;&#x7406;&#xFF0C;&#x6240;&#x8B02;&#x7684;&#x4EE3;&#x7406;&#x4F3A;&#x670D;&#x5668;&#x5373;&#x662F;&#x900F;&#x904E;&#x4E00;&#x500B;&#x7B2C;&#x4E09;&#x65B9;&#x4E3B;&#x6A5F;&#x4EE3;&#x70BA;&#x767C;&#x9001;&#x8ACB;&#x6C42;&#xFF0C;&#x56E0;&#x6B64;&#x5C0D;&#x65BC;&#x7DB2;&#x7AD9;&#x65B9;&#x800C;&#x8A00;&#xFF0C;&#x4ED6;&#x6536;&#x5230;&#x7684;&#x8ACB;&#x6C42;&#x662F;&#x4F86;&#x81EA;&#x65BC;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x3002;</p>
<p><img src="https://imgur.com/0JcEZmW.png" alt></p>
<p>&#x9019;&#x908A;&#x4E5F;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x514D;&#x8CBB;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x4EE3;&#x7406;&#x4F3A;&#x670D;&#x5668;&#xFF1A;</p>
<ul>
<li>&#x570B;&#x5916;&#xFF1A;<a href="http://spys.one/en/" target="_blank" rel="noopener">http://spys.one/en/</a> &#x3001;<a href="https://free-proxy-list.net/" target="_blank" rel="noopener">https://free-proxy-list.net/</a></li>
<li>&#x4E2D;&#x570B;&#xFF1A;<a href="http://cn-proxy.com/" target="_blank" rel="noopener">http://cn-proxy.com/</a></li>
</ul>
<h3 id="javascript-&#x6E32;&#x67D3;&#x7684;&#x52D5;&#x614B;&#x7DB2;&#x9801;"><a href="#JavaScript-&#x6E32;&#x67D3;&#x7684;&#x52D5;&#x614B;&#x7DB2;&#x9801;" class="headerlink" title="JavaScript &#x6E32;&#x67D3;&#x7684;&#x52D5;&#x614B;&#x7DB2;&#x9801;"></a>JavaScript &#x6E32;&#x67D3;&#x7684;&#x52D5;&#x614B;&#x7DB2;&#x9801;</h3><p>&#x6700;&#x5F8C;&#x4E00;&#x7A2E;&#x662F;&#x300C;JavaScript &#x6E32;&#x67D3;&#x7684;&#x52D5;&#x614B;&#x7DB2;&#x9801;&#x300D;&#xFF0C;&#x52D5;&#x614B;&#x7DB2;&#x9801;&#x662F;&#x6307;&#x7DB2;&#x9801;&#x5728;&#x700F;&#x89BD;&#x5668;&#x53D6;&#x5F97; HTML &#x5F8C;&#xFF0C;&#x624D;&#x900F;&#x904E; JavaScript &#x6839;&#x64DA;&#x9700;&#x6C42;&#x52D5;&#x614B;&#x5730;&#x53D6;&#x5F97;&#x8CC7;&#x6599;&#x66F4;&#x65B0; HTML &#x7684;&#x4E00;&#x7A2E;&#x6280;&#x8853;&#x3002;&#x52D5;&#x614B;&#x7DB2;&#x9801;&#x8207;&#x975C;&#x614B;&#x7DB2;&#x9801;&#x6700;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x662F;&#x300C;&#x7DB2;&#x9801;&#x4E0A;&#x7684;&#x8CC7;&#x6599;&#x300D;&#x662F;&#x5728;&#x4EC0;&#x9EBC;&#x6642;&#x9593;&#x9EDE;&#x53D6;&#x5F97;&#x7522;&#x751F;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x52D5;&#x614B;&#x722C;&#x87F2;&#x7A0B;&#x5F0F;&#x5FC5;&#x9808;&#x91DD;&#x5C0D;&#x9019;&#x7A2E;&#x52D5;&#x614B;&#x66F4;&#x65B0;&#x8CC7;&#x6599;&#x7684;&#x7DB2;&#x9801;&#x8ABF;&#x6574;&#xFF0C;&#x624D;&#x6709;&#x8FA6;&#x6CD5;&#x53D6;&#x5F97;&#x771F;&#x6B63;&#x7684;&#x8CC7;&#x6599;&#x3002;</p>
<p>&#x7DB2;&#x9801;&#x7684;&#x554F;&#x984C;&#x662F;&#x56E0;&#x70BA;&#x5229;&#x7528; Python &#x6514;&#x622A;&#x5230;&#x7684; Response &#x6C38;&#x9060;&#x6703;&#x662F;&#x9084;&#x6C92;&#x57F7;&#x884C; JavaScript &#x524D;&#x90A3;&#x500B;&#x76F8;&#x5C0D;&#x7A7A;&#x767D;&#x7684;&#x756B;&#x9762;&#x3002;&#x52D5;&#x614B;&#x7DB2;&#x9801;&#x722C;&#x87F2;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x300C;&#x5F9E;&#x6A21;&#x64EC;&#x700F;&#x89BD;&#x5668;&#x6539;&#x6210;&#x6A21;&#x64EC;&#x4F7F;&#x7528;&#x8005;&#x958B;&#x555F;&#x700F;&#x89BD;&#x5668;&#x300D;&#xFF0C;&#x85C9;&#x7531;&#x6A21;&#x64EC;&#x7684;&#x700F;&#x89BD;&#x5668;&#x57F7;&#x884C; JavaScript &#x62C9;&#x56DE;&#x8CC7;&#x6599;&#x3002;</p>
<h2 id="&#x6253;&#x9020;&#x722C;&#x87F2;&#x662F;&#x8CC7;&#x6599;&#x4EBA;&#x7684;&#x57FA;&#x672C;&#x6280;&#x80FD;"><a href="#&#x6253;&#x9020;&#x722C;&#x87F2;&#x662F;&#x8CC7;&#x6599;&#x4EBA;&#x7684;&#x57FA;&#x672C;&#x6280;&#x80FD;" class="headerlink" title="&#x6253;&#x9020;&#x722C;&#x87F2;&#x662F;&#x8CC7;&#x6599;&#x4EBA;&#x7684;&#x57FA;&#x672C;&#x6280;&#x80FD;"></a>&#x6253;&#x9020;&#x722C;&#x87F2;&#x662F;&#x8CC7;&#x6599;&#x4EBA;&#x7684;&#x57FA;&#x672C;&#x6280;&#x80FD;</h2><p>&#x904E;&#x53BB;&#x7684;&#x8CC7;&#x6599;&#x4F86;&#x6E90;&#x591A;&#x534A;&#x4F86;&#x81EA;&#x65BC;&#x516C;&#x53F8;&#x5167;&#x90E8;&#x7684;&#x8CC7;&#x6599;&#x5EAB;&#x6216;&#x8CC7;&#x6599;&#x5009;&#x5132;&#x7CFB;&#x7D71;&#xFF0C;&#x4EF0;&#x8CF4;&#x65BC;&#x5DE5;&#x7A0B;&#x5E2B;&#x8DDF; IT &#x90E8;&#x9580;&#x7684;&#x652F;&#x63F4;&#x3002;&#x4F46;&#x96A8;&#x8457; Big Data &#x7684;&#x6280;&#x8853;&#x5230;&#x4F4D;&#xFF0C;&#x5BE6;&#x52D9;&#x4E0A;&#x5C0D;&#x65BC;&#x8CC7;&#x6599;&#x7684;&#x8981;&#x6C42;&#x66F4;&#x52A0;&#x5927;&#x91CF;&#x4E5F;&#x66F4;&#x52A0;&#x591A;&#x5143;&#x3002;&#x73FE;&#x5728;&#x5C0D;&#x65BC;&#x8CC7;&#x6599;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x5176;&#x5BE6;&#x5F88;&#x5EE3;&#x6CDB;&#xFF0C;&#x901A;&#x5E38;&#x5F88;&#x591A;&#x8CC7;&#x6599;&#x7684;&#x9700;&#x6C42;&#x4E5F;&#x90FD;&#x662F;&#x5BE6;&#x73FE;&#x6027;&#x7684;&#x3002;&#x9019;&#x7A2E;&#x60C5;&#x6CC1;&#x4E0B;&#x53EF;&#x80FD;&#x6C92;&#x6709;&#x90A3;&#x9EBC;&#x591A;&#x7684;&#x5DE5;&#x7A0B;&#x5E2B;&#x6216;&#x958B;&#x767C;&#x4EBA;&#x529B;&#x80FD;&#x5920;&#x96A8;&#x6642;&#x63D0;&#x4F9B;&#x5F48;&#x6027;&#x7684;&#x8CC7;&#x6599;&#xFF0C;&#x56E0;&#x6B64;&#x6253;&#x9020;&#x8CC7;&#x6599;&#x6536;&#x96C6;&#x529B;&#x5DF2;&#x7D93;&#x6210;&#x70BA;&#x6240;&#x6709;&#x8CC7;&#x6599;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x5FC5;&#x5099;&#x6280;&#x80FD;&#x4E86;&#x3002;</p>
<!-- Begin Mailchimp Signup Form -->
<p><div id="mc_embed_signup"><form action="https://accupass.us6.list-manage.com/subscribe/post?u=840b112be5bede36036e19d3e&amp;id=d23f3a8e3a" method="post" id="mc-embedded-subscribe-form" name="mc-embedded-subscribe-form" class="validate" target="_blank" novalidate><div id="mc_embed_signup_scroll"><label for="mce-EMAIL">&#x5982;&#x679C;&#x60F3;&#x7372;&#x5F97;&#x6700;&#x65B0;&#x7684;&#x6280;&#x8853;&#x8CC7;&#x8A0A;&#xFF0C;&#x6B61;&#x8FCE;&#x8A02;&#x95B1;&#x8FFD;&#x8E64;&#xFF1A;</label><input type="email" value name="EMAIL" class="email" id="mce-EMAIL" placeholder="email address" required><div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_840b112be5bede36036e19d3e_d23f3a8e3a" tabindex="-1" value></div><div class="clear"><input type="submit" value="Subscribe" name="subscribe" id="mc-embedded-subscribe" class="button"></div></div></form></div><br><!--End mc_embed_signup--></p>
<h2 id="reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><p>[1] <a href="https://ppfocus.com/0/dib558454.html" target="_blank" rel="noopener">&#x5E38;&#x898B;&#x7684;&#x53CD;&#x722C;&#x87F2;&#x6280;&#x8853;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x5982;&#x4F55;&#x9632;&#x6B62;&#x5225;&#x4EBA;&#x722C;&#x81EA;&#x5DF1;&#x7684;&#x7DB2;&#x7AD9;&#xFF1F;</a><br>[2] <a href="https://zhuanlan.zhihu.com/p/345343134" target="_blank" rel="noopener">9&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x53CD;&#x722C;&#x866B;&#x7B56;&#x7565;&#x601D;&#x8DEF;</a><br>[3] <a href="https://blog.csdn.net/guangyinglanshan/article/details/79043612" target="_blank" rel="noopener">python&#x722C;&#x866B;&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x5341;&#x4E00;&#xFF1A;&#x5E38;&#x89C1;&#x53CD;&#x722C;&#x866B;&#x673A;&#x5236;&#x4E0E;&#x5E94;&#x5BF9;&#x65B9;&#x6CD5;</a></p>
<hr>
<p style="color: #6d9eeb"><br>&#x55E8;&#xFF0C;&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x7DAD;&#x5143;&#xFF0C;&#x6301;&#x7E8C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x767C;&#x8868;&#x5C0D; #&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x3001; #&#x7DB2;&#x9801;&#x958B;&#x767C; &#x6216; #&#x8EDF;&#x9AD4;&#x8077;&#x6DAF; &#x76F8;&#x95DC;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x5982;&#x679C;&#x5C0D;&#x65BC;&#x5167;&#x6587;&#x6709;&#x7591;&#x554F;&#x90FD;&#x6B61;&#x8FCE;&#x8207;&#x6211;&#x5011;&#x9032;&#x4E00;&#x6B65;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x8FFD;&#x8E64;&#x6211;&#x7684; <a href="https://pse.is/3cazqk" style="color: #ff0000; font-weight: bold; text-decoration: underline;" target="_blank" rel="noopener">Facebook &#x7C89;&#x5C08;&#xFF1A;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684;&#x5DE5;&#x4F5C;&#x65E5;&#x5E38;</a> &#xFF0C;&#x4E5F;&#x6703;&#x4E0D;&#x5B9A;&#x6642;&#x7684;&#x8209;&#x8FA6;&#x5206;&#x4EAB;&#x6D3B;&#x52D5;&#xFF0C;&#x4E00;&#x8D77;&#x4F86;&#x73A9;&#x73A9;&#x5427; &#x30FD;(&#x25CF;&#xB4;&#x2200;`&#x25CF;)&#xFF89;<br><br>&#x76EE;&#x524D;&#x6211;&#x5011;&#x4E5F;&#x5728;&#x898F;&#x5283;&#x65B0;&#x7684;&#x722C;&#x87F2;&#x8AB2;&#x7A0B;&#x3010;<a href="https://m.me/dscareer?ref=w15862756" style="color: #ff0000; font-weight: bold; text-decoration: underline;" target="_blank" rel="noopener">&#x5E02;&#x9762;&#x4E0A;&#x6C92;&#x6709;&#x6559;&#x7684;&#x9032;&#x968E;&#x722C;&#x87F2;&#x6838;&#x5FC3;&#x6280;</a>&#x3011;&#xFF0C;&#x9019;&#x662F;&#x76EE;&#x524D;&#x5E02;&#x9762;&#x4E0A;&#x5C11;&#x6709;&#x9032;&#x968E;&#x722C;&#x87F2;&#x8AB2;&#x7A0B;&#xFF0C;&#x8A66;&#x5716;&#x5C07;&#x591A;&#x5E74;&#x7684;&#x7D93;&#x9A57;&#x805A;&#x7126;&#x6210;&#x4E00;&#x5957;&#x5B8C;&#x6574;&#x7684;&#x6838;&#x5FC3;&#x6280;&#x80FD;&#x3002;&#x5167;&#x5BB9;&#x5305;&#x542B;&#x56DB;&#x5927;&#x722C;&#x87F2;&#x6838;&#x5FC3;&#x6280;&#xFF0C;&#x5305;&#x542B; #&#x53CD;&#x722C;&#x87F2;&#x8655;&#x7406;&#x624B;&#x6CD5;&#x3001;#&#x57F7;&#x884C;&#x722C;&#x87F2;&#x52A0;&#x901F;&#x7B56;&#x7565;&#x3001;#&#x722C;&#x87F2;&#x7BA1;&#x7406;&#x6846;&#x67B6;&#x3001;#&#x5206;&#x6563;&#x5F0F;&#x722C;&#x87F2;&#x3002;&#x9019;&#x5802;&#x5E02;&#x9762;&#x4E0A;&#x5C11;&#x898B;&#x7684;&#x300C;&#x9032;&#x968E;&#x722C;&#x87F2;&#x6280;&#x6CD5;&#x300D;&#x8AB2;&#x7A0B;&#xFF0C;&#x5C07;&#x5B8C;&#x6574;&#x4EA4;&#x7D66;&#x4F60;&#x56DB;&#x7A2E;&#x9032;&#x968E;&#x722C;&#x87F2;&#x6280;&#x8853;&#xFF0C;&#x5E6B;&#x52A9;&#x4F60;&#x6A6B;&#x5411;&#x8986;&#x84CB;&#x591A;&#x9805;&#x9032;&#x968E;&#x6280;&#x6CD5;&#xFF0C;&#x7E31;&#x5411;&#x63D0;&#x5347;&#x722C;&#x87F2;&#x5BE6;&#x6230;&#x80FD;&#x529B;&#xFF0C;&#x514B;&#x670D;&#x90A3;&#x4E9B;&#x521D;&#x968E;&#x722C;&#x87F2;&#x6280;&#x8853;&#x7121;&#x6CD5;&#x89E3;&#x6C7A;&#x7684;&#x554F;&#x984C;&#xFF01;&#x4E00;&#x8D77;&#x52A0;&#x5165;&#x8AB2;&#x7A0B;&#xFF0C;&#x638C;&#x63E1;&#x9032;&#x968E;&#x722C;&#x87F2;&#x958B;&#x767C;&#x8005;&#x5FC5;&#x5099;&#x7684;&#x6838;&#x5FC3;&#x6280;&#x80FD; &#x1F680;&#x1F680;&#x1F680;<br><br><img src="https://imgur.com/4pCTMh4.png" alt><br><br>&#x1F4CD; &#x6211;&#x6709;&#x8208;&#x8DA3;&#xFF0C;&#x4E0A;&#x7DDA;&#x8ACB;&#x901A;&#x77E5;&#x6211;&#xFF1A; <a href="https://m.me/dscareer?ref=w15862756" target="_blank" rel="noopener">https://m.me/dscareer?ref=w15862756</a><br>&#x1F4CD; &#x6211;&#x6709;&#x8208;&#x8DA3;&#xFF0C;&#x4E0A;&#x7DDA;&#x8ACB;&#x901A;&#x77E5;&#x6211;&#xFF1A; <a href="https://m.me/dscareer?ref=w15862756" target="_blank" rel="noopener">https://m.me/dscareer?ref=w15862756</a><br>&#x1F4CD; &#x6211;&#x6709;&#x8208;&#x8DA3;&#xFF0C;&#x4E0A;&#x7DDA;&#x8ACB;&#x901A;&#x77E5;&#x6211;&#xFF1A; <a href="https://m.me/dscareer?ref=w15862756" target="_blank" rel="noopener">https://m.me/dscareer?ref=w15862756</a><br></p>

<hr>
<p><img src="http://i.creativecommons.org/l/by-sa/3.0/88x31.png" style="    margin: 0;"><br>&#x672C;&#x8457;&#x4F5C;&#x7531;<a href="https://www.facebook.com/v123582" target="_blank" rel="noopener">Chang Wei-Yaun (v123582)</a>&#x88FD;&#x4F5C;&#xFF0C;<br>&#x4EE5;<a href="http://creativecommons.org/licenses/by-sa/3.0/deed.zh_TW" target="_blank" rel="noopener">&#x5275;&#x7528;CC &#x59D3;&#x540D;&#x6A19;&#x793A;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5206;&#x4EAB; 3.0 Unported</a>&#x6388;&#x6B0A;&#x689D;&#x6B3E;&#x91CB;&#x51FA;&#x3002;</p>
</div><div class="post-nav"><a href="/2021/06/14/Python-挑戰題：「只挑出重複出現的元素」參考解析/" class="next">Python 挑戰題：「只挑出重複出現的元素」參考解析<i class="icon-next"></i></a></div><div id="disqus_thread"><script>var disqus_shortname = 'v123582';
var disqus_identifier = '2021/09/09/爬蟲又被擋了怎麼了？常見的反爬蟲處理策略/';
var disqus_title = '爬蟲又被擋了怎麼辦？常見的反爬蟲處理策略';
var disqus_url = 'https://blog.v12358.tw/2021/09/09/爬蟲又被擋了怎麼了？常見的反爬蟲處理策略/';
(function() {
  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();</script><script id="dsq-count-scr" src="//v123582.disqus.com/count.js" async="async"></script></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><div class="widget-title">Information</div><ul><div class="tags">標籤：<a href="/tags/Python/">Python </a><a href="/tags/資料科學系列/">資料科學系列 </a><a href="/tags/資料爬蟲/">資料爬蟲 </a></div><div class="categories">分類：<a href="/categories/Data-Science/">Data Science</a></div></ul></div><div class="widget"><div class="widget-title">Table of Content</div><div class="clear"><div id="toc" class="toc-article"><div class="toc"></div></div></div></div><script type="text/javascript" src="//js1.bloggerads.net/ShowAds.aspx?blogid=20190326000001" async></script></div></div></div><div id="footer">© <a href="/" rel="nofollow">資料科學家的工作日常.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><script src="/js/jquery.min.js"></script>
<script src="/js/share.js"></script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script><a id="rocket" href="#top" class="show"></a><script src="/js/jquery.min.js"></script>
<script src="/js/totop.js"></script><script src="/js/fancybox.pack.js"></script>
<script src="/js/jquery.fancybox.js"></script><link rel="stylesheet" href="/css/jquery.fancybox.css"><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
ga('create','UA-59103909-1','auto');ga('send','pageview');
</script></div><!-- hexo-inject:begin --><!-- hexo-inject:end --></body></html>