<!DOCTYPE html><html lang="zh-TW"><head><meta name="generator" content="Hexo 3.9.0"><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><meta property="og:image" content="https://avatars2.githubusercontent.com/u/5959524?v=3&amp;s=300"><meta property="og:description" content="WeiYuan Note | 計概考古題準備策略 - 轉學考/資管所/公職考科"><meta property="og:title" content="計概考古題準備策略 - 轉學考/資管所/公職考科"><title>計概考古題準備策略 - 轉學考/資管所/公職考科 | 資料科學家的工作日常</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"><link rel="stylesheet" type="text/css" href="/css/pure-min.css"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css"><link rel="stylesheet" type="text/css" href="/css/profile-card.css"><link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.4.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"><link href="//cdn-images.mailchimp.com/embedcode/slim-10_7.css" rel="stylesheet" type="text/css"><script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><script><!-- hexo-inject:begin --><!-- hexo-inject:end -->(adsbygoogle = window.adsbygoogle || []).push({
google_ad_client: "ca-pub-7913880396333307",
enable_page_level_ads: true
});


</script><!-- hexo-inject:begin --><!-- hexo-inject:end --></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">計概考古題準備策略 - 轉學考/資管所/公職考科</h1><a id="logo" href="https://v123582.github.io">資料科學家的工作日常</a><p class="description">#遠端 #斜槓 #教學 #資料科學 #網站開發</p></div><div id="nav-menu"><a href="https://v123582.github.io/about"><i class="icon-about"> 關於</i></a><a href="https://v123582.github.io/project"><i class="fa fa-tasks"> 專案</i></a><a href="https://v123582.github.io/blog"><i class="icon-archive"> 技術</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post post-page"><h1 class="post-title"><span><i class="fa fa-star"></i></span>計概考古題準備策略 - 轉學考/資管所/公職考科</h1><div class="post-meta">2020-05-29 | WeiYuan (@v123582)</div><a data-url="https://blog.v12358.tw/2020/05/29/計概考古題準備策略-轉學考-資管所-公職考科/" data-id="cks3b100n004u25ob0hvneofm" class="article-share-link">Share</a><div class="post-content"><p>&#x5728;&#x6E96;&#x5099;&#x8A08;&#x7B97;&#x6A5F;&#x6982;&#x8AD6;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#x61C9;&#x8A72;&#x6709;&#x6EFF;&#x6EFF;&#x7684;&#x300C;&#x632B;&#x6298;&#x611F;&#x300D;&#x5427;&#xFF01;&#x5C24;&#x5176;&#x662F;&#x5728;&#x958B;&#x59CB;&#x8003;&#x53E4;&#x984C;&#x4E4B;&#x5F8C;&#xFF0C;&#x53EF;&#x80FD;&#x6703;&#x958B;&#x59CB;&#x61F7;&#x7591;&#x4EBA;&#x751F;&#x3002;&#x56E0;&#x70BA;&#x524D;&#x5169;&#x5E74;&#x525B;&#x597D;&#x6709;&#x8A08;&#x6982;&#x8F49;&#x5B78;&#x8003;&#x78A9;&#x58EB;&#x73ED;&#x88DC;&#x7FD2;&#x73ED;&#x8B1B;&#x5E2B;&#x548C;&#x5BB6;&#x6559;&#x7684;&#x7D93;&#x9A57;&#xFF0C;&#x770B;&#x5230;&#x8A31;&#x591A;&#x4EBA;&#x7684;&#x7126;&#x616E;&#x548C;&#x58D3;&#x529B;&#x3002;&#x624B;&#x908A;&#x6709;&#x6574;&#x7406;&#x5E7E;&#x500B;&#x95DC;&#x65BC;&#x5BEB;&#x8003;&#x53E4;&#x984C;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x9806;&#x624B;&#x8DDF;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x3002;</p>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><p><img src="https://imgur.com/kmG9Qjr.jpg" alt></p>
<h2 id="&#x95DC;&#x65BC;&#x8A08;&#x6982;&#x7684;&#x7BC4;&#x570D;"><a href="#&#x95DC;&#x65BC;&#x8A08;&#x6982;&#x7684;&#x7BC4;&#x570D;" class="headerlink" title="&#x95DC;&#x65BC;&#x8A08;&#x6982;&#x7684;&#x7BC4;&#x570D;"></a>&#x95DC;&#x65BC;&#x8A08;&#x6982;&#x7684;&#x7BC4;&#x570D;</h2><p>&#x9996;&#x5148;&#xFF0C;&#x60F3;&#x8981;&#x5148;&#x8DDF;&#x5927;&#x5BB6;&#x804A;&#x4E00;&#x4E0B;&#x95DC;&#x65BC;&#x300C;&#x8A08;&#x6982;&#x300D;&#x9019;&#x500B;&#x79D1;&#x76EE;&#x3002;&#x4E00;&#x822C;&#x574A;&#x9593;&#x6240;&#x8B02;&#x7684;&#x8A08;&#x6982;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x5169;&#x500B;&#x6975;&#x7AEF;&#xFF0C;&#x4E00;&#x7A2E;&#x662F;&#x76F8;&#x95DC;&#x7406;&#x8AD6;&#x7684;&#x300C;&#x5B78;&#x6821;&#x5927;&#x5B78;&#x8A08;&#x6982;&#x8AB2;&#x7A0B;&#x300D;&#x5E7E;&#x53CA;&#x300C;&#x79D1;&#x666E;&#x985E;&#x578B;&#x7684;&#x8A08;&#x6982;&#x66F8;&#x7C4D;&#x300D;&#x3002;&#x5F8C;&#x8005;&#x8457;&#x91CD;&#x7684;&#x9EDE;&#x5728;&#x65BC;&#x300C;&#x96FB;&#x8166;&#x79D1;&#x5B78;&#x300D;&#x76F8;&#x95DC;&#x7684;&#x5165;&#x9580;&#x6982;&#x5FF5;&#x8207;&#x79D1;&#x6280;&#x8DA8;&#x52E2;&#xFF0C;&#x6BD4;&#x8F03;&#x50CF;&#x662F;&#x8B93;&#x4F60;&#x4E86;&#x89E3;&#x300C;&#x5BEB;&#x7A0B;&#x5F0F;&#x300D;&#x662F;&#x600E;&#x9EBC;&#x4E00;&#x56DE;&#x4E8B;&#x3002;&#x300C;&#x5927;&#x5B78;&#x8A08;&#x6982;&#x8AB2;&#x7A0B;&#x300D;&#x662F;&#x4EE5;&#x300C;&#x96FB;&#x8166;&#x79D1;&#x5B78;&#x300D;&#x7684;&#x6B77;&#x53F2;&#x8108;&#x7D61;&#x8207;&#x6838;&#x5FC3;&#x77E5;&#x8B58;&#x7D44;&#x5408;&#xFF0C;&#x662F;&#x8B93;&#x4F60;&#x4E86;&#x89E3;&#x6574;&#x500B;&#x8CC7;&#x5DE5;&#x7CFB;&#x8AB2;&#x7A0B;&#x5730;&#x5716;&#x7684;&#x7E2E;&#x5F71;&#x3002;&#x524D;&#x8005;&#x624D;&#x662F;&#x8003;&#x8A66;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x5411;&#xFF0C;&#x5F8C;&#x8005;&#x6BD4;&#x8F03;&#x504F;&#x5411;&#x300C;&#x95B1;&#x8B80;&#x300D;&#x7684;&#x8CC7;&#x6E90;&#x3002;&#x5927;&#x5B78;&#x8A08;&#x6982;&#x8AB2;&#x7A0B;&#x76EE;&#x524D;&#x53F0;&#x7063;&#x4E3B;&#x8981;&#x591A;&#x8001;&#x5E2B;&#x63A1;&#x7528;&#x7684;&#x5169;&#x672C;&#x6559;&#x79D1;&#x66F8;&#x5206;&#x5225;&#x662F;&#xFF1A;</p>
<ul>
<li>Computer Science: An Overview</li>
<li>Foundations of Computer Science &#xFF08;&#x7D05;&#x9DB4;&#x66F8;&#xFF09;</li>
</ul>
<p>&#x57FA;&#x65BC;&#x9019;&#x500B;&#x6559;&#x6750;&#xFF0C;&#x5728;&#x6E96;&#x5099;&#x8003;&#x8A66;&#x7684;&#x904E;&#x7A0B;&#x4E2D;&#x4F60;&#x53EF;&#x80FD;&#x6703;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8CC7;&#x6E90;&#xFF0C;&#x4EE5;&#x4E0B;&#x5F9E;&#x300C;&#x77E5;&#x8B58;&#x91CF;&#x300D;&#x8207;&#x300C;&#x8003;&#x8A66;&#x91CD;&#x9EDE;&#x300D;&#x4F86;&#x5283;&#x5206;&#xFF1A;</p>
<p>&#x4EE5;&#x77E5;&#x8B58;&#x91CF;&#x7684;&#x5C64;&#x7D1A;&#x4F86;&#x8AAA;&#xFF1A;&#x539F;&#x6587;&#x66F8; &gt; &#x574A;&#x9593;&#x53C3;&#x8003;&#x66F8; &gt; &#x8B1B;&#x7FA9; &gt; &#x6295;&#x5F71;&#x7247; &gt; &#x7B46;&#x8A18; &gt; &#x8003;&#x53E4;&#x984C;<br>&#x4EE5;&#x8003;&#x8A66;&#x91CD;&#x9EDE;&#x5C64;&#x7D1A;&#x4F86;&#x8AAA;&#xFF1A;&#x8003;&#x53E4;&#x984C; &gt; &#x8B1B;&#x7FA9;&#x3001;&#x7B46;&#x8A18; &gt; &#x574A;&#x9593;&#x53C3;&#x8003;&#x66F8; &gt; &#x6295;&#x5F71;&#x7247; &gt; &#x539F;&#x6587;&#x66F8; </p>
<p>&#x4E0D;&#x7BA1;&#x662F;&#x8B1B;&#x7FA9;&#x3001;&#x7B46;&#x8A18;&#x3001;&#x539F;&#x6587;&#x66F8;&#x3001;&#x5B78;&#x6821;&#x8001;&#x5E2B;&#x7684;&#x6295;&#x5F71;&#x7247;&#xFF0C;&#x591A;&#x591A;&#x5C11;&#x5C11;&#x90FD;&#x6703;&#x6709;&#x4E0D;&#x8DB3;&#x6216;&#x91CD;&#x758A;&#x7684;&#x554F;&#x984C;&#x5B58;&#x5728;&#xFF0C;&#x9019;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x73FE;&#x8C61;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x5E38;&#x5E38;&#x6703;&#x8B80;&#x4E00;&#x8B80;&#x4E4B;&#x5F8C;&#xFF0C;&#x767C;&#x73FE;&#x597D;&#x50CF;&#x6709;&#x4EC0;&#x9EBC;&#x6771;&#x897F;&#x6C92;&#x6709;&#x8B80;&#x5230;&#xFF0C;&#x64D4;&#x5FC3;&#x81EA;&#x5DF1;&#x662F;&#x4E0D;&#x662F;&#x6703;&#x932F;&#x904E;&#x4EC0;&#x9EBC;&#x3002;&#x9019;&#x662F;&#x975E;&#x5E38;&#x6B63;&#x5E38;&#x7684;&#x60C5;&#x6CC1;&#xFF0C;&#x56E0;&#x70BA;&#x5F9E;&#x5927;&#x5B78;&#x958B;&#x59CB;&#xFF0C;&#x6211;&#x5011;&#x5F88;&#x96E3;&#x5F9E;&#x55AE;&#x4E00;&#x5167;&#x5BB9;&#x5C31;&#x5F97;&#x5230;&#x5B8C;&#x6574;&#x7684;&#x77E5;&#x8B58;&#x91CF;&#x3002;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x9019;&#x4E9B;&#x8CC7;&#x6E90;&#x7684;&#x65B9;&#x6CD5;&#x61C9;&#x8A72;&#x662F;&#xFF0C;&#x5E6B;&#x4F60;&#x7BE9;&#x9078;&#x51FA;&#x300C;&#x91CD;&#x8981;&#x7684;&#x7BC4;&#x570D;&#x6709;&#x54EA;&#x4E9B;&#x300D;&#x3002;&#x900F;&#x904E;&#x4EA4;&#x53C9;&#x7684;&#x53C3;&#x8003;&#xFF0C;&#x6BD4;&#x8F03;&#x5404;&#x7A2E;&#x4E0D;&#x540C;&#x7684;&#x66F8;&#x3001;&#x8AB2;&#x7A0B;&#x6216;&#x662F;&#x7DB2;&#x8DEF;&#x6587;&#x4EF6;&#xFF0C;&#x6574;&#x7406;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x7B46;&#x8A18;&#xFF0C;&#x6700;&#x7D42;&#x624D;&#x53EF;&#x4EE5;&#x5167;&#x5316;&#x70BA;&#x81EA;&#x5DF1;&#x7684;&#x77E5;&#x8B58;&#x3002;</p>
<h2 id="&#x8003;&#x53E4;&#x984C;&#x6E96;&#x5099;&#x7B56;&#x7565;"><a href="#&#x8003;&#x53E4;&#x984C;&#x6E96;&#x5099;&#x7B56;&#x7565;" class="headerlink" title="&#x8003;&#x53E4;&#x984C;&#x6E96;&#x5099;&#x7B56;&#x7565;"></a>&#x8003;&#x53E4;&#x984C;&#x6E96;&#x5099;&#x7B56;&#x7565;</h2><p>&#x6211;&#x901A;&#x5E38;&#x6703;&#x5EFA;&#x8B70;&#x5728;&#x8003;&#x524D;&#x4E00;&#x5169;&#x500B;&#x6708;&#x5DE6;&#x53F3;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x628A;&#x4E00;&#x5957;&#x6559;&#x6750;&#x5FF5;&#x904E;&#x4E00;&#x8F2A;&#xFF0C;&#x958B;&#x59CB;&#x9032;&#x5165;&#x300C;&#x8003;&#x53E4;&#x984C;&#x300D;&#x7684;&#x5099;&#x6230;&#x72C0;&#x614B;&#x3002;&#x9019;&#x88E1;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x500B;&#x5206;&#x754C;&#x9EDE;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x60F3;&#x4E00;&#x4E0B;&#xFF1A;</p>
<p>(1) &#x57FA;&#x790E;&#x89C0;&#x5FF5;&#x719F;&#x4E0D;&#x719F;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x8B1B;&#x51FA;&#x6BCF;&#x500B;&#x55AE;&#x5143;&#x7684;&#x91CD;&#x9EDE;&#x6709;&#x54EA;&#x4E9B;<br>(2) &#x76F4;&#x63A5;&#x5BEB;&#x8003;&#x53E4;&#x984C;&#x6703;&#x4E0D;&#x6703;&#x96E3;&#x5EA6;&#x592A;&#x5927;&#xFF0C;&#x6703;&#x4E0D;&#x6703;&#x9023;&#x8003;&#x4EC0;&#x9EBC;/&#x54EA;&#x500B;&#x7AE0;&#x7BC0;&#x90FD;&#x4E0D;&#x592A;&#x78BA;&#x5B9A; </p>
<p>&#x5982;&#x679C; (1)(2) &#x90FD;&#x662F;&#x4E0D;&#x592A; OK &#x7684;&#x8A71;&#xFF0C;&#x5EFA;&#x8B70;&#x518D;&#x591A;&#x82B1;&#x4E00;&#x9EDE;&#x6642;&#x9593;&#x628A;&#x300C;&#x55AE;&#x5143;&#x91CD;&#x9EDE;&#x300D;&#x5148;&#x597D;&#x597D;&#x91CD;&#x65B0;&#x8B80;&#x904E;&#x4E00;&#x904D;&#xFF0C;&#x5148;&#x78BA;&#x4FDD;&#x6BCF;&#x4E00;&#x500B;&#x55AE;&#x5143;&#x7684;&#x57FA;&#x790E;&#x89C0;&#x5FF5; OK&#xFF0C;&#x518D;&#x9032;&#x5165;&#x8003;&#x53E4;&#x984C;&#x7684;&#x74B0;&#x7BC0;&#x3002;&#x958B;&#x59CB;&#x5BEB;&#x53E4;&#x984C;&#x4E4B;&#x5F8C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F9D;&#x7167;&#x4EE5;&#x4E0B;&#x5C31;&#x5B89;&#x6392;&#xFF1A;</p>
<ol>
<li>&#x5148;&#x82B1;&#x4E00;&#x500B;&#x5C0F;&#x6642;&#x5BEB;&#x984C;&#x76EE;&#xFF0C;&#x6A21;&#x64EC;&#x771F;&#x5BE6;&#x7684;&#x8003;&#x8A66;&#x74B0;&#x5883;</li>
<li>&#x82B1;&#x4E00;&#x500B;&#x5C0F;&#x6642;&#x6AA2;&#x8A0E;&#x932F;&#x8AA4;&#x7684;&#x90E8;&#x5206;&#xFF08;&#x6A19;&#x8A18;&#x984C;&#x76EE;&#x662F;&#x54EA;&#x4E00;&#x500B;&#x7AE0;&#x7BC0;/&#x6BB5;&#x843D;&#xFF0C;&#x60F3;&#x4E00;&#x4E0B;&#x8A72;&#x74B0;&#x7BC0;&#x719F;&#x4E0D;&#x719F;&#xFF09; </li>
<li>&#x82B1;&#x5169;&#x5230;&#x4E09;&#x500B;&#x5C0F;&#x6642;&#x5F9E;&#x982D;&#x958B;&#x59CB;&#x4E00;&#x984C;&#x4E00;&#x984C;&#x8B80;&#xFF0C;&#x53BB;&#x601D;&#x8003;&#x9019;&#x500B;&#x984C;&#x76EE;&#x7684;&#x55AE;&#x5143;&#x662F;&#x4EC0;&#x9EBC;&#xFF0C;&#x9019;&#x500B;&#x984C;&#x76EE;&#x60F3;&#x8003;&#x7684;&#x91CD;&#x9EDE;&#x662F;&#x4EC0;&#x9EBC;&#xFF0C;&#x7136;&#x5F8C;&#x5F9E;&#x9019;&#x500B;&#x984C;&#x76EE;&#x505A;&#x5EF6;&#x4F38;&#x6216;&#x662F;&#x6574;&#x7406;&#x76F8;&#x95DC;&#x7684;&#x8B8A;&#x5316;&#x3002;&#x53EF;&#x4EE5;&#x8A66;&#x8457;&#x4EE5;&#x9019;&#x500B;&#x984C;&#x76EE;&#x70BA;&#x57FA;&#x790E;&#xFF0C;&#x81EA;&#x5DF1;&#x51FA;&#x5E7E;&#x500B;&#x8B8A;&#x5316;&#x984C;&#x8003;&#x81EA;&#x5DF1;&#x3002;</li>
</ol>
<p>&#x6211;&#x6703;&#x5EFA;&#x8B70;&#x4E00;&#x5F35;&#x8003;&#x53E4;&#x984C;&#x8981;&#x82B1;&#x4E00;&#x500B;&#x4E0A;&#x5348;&#x6216;&#x4E00;&#x500B;&#x4E0B;&#x5348;&#xFF0C;&#x9664;&#x4E86;&#x5BEB;&#x5B8C;&#x4E4B;&#x5916;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4F5C;&#x70BA;&#x8907;&#x7FD2;&#x6AA2;&#x9A57;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x70BA;&#x73FE;&#x5728;&#x5F88;&#x5C11;&#x6703;&#x8003;&#x4E00;&#x6A21;&#x4E00;&#x6A23;&#x7684;&#x984C;&#x76EE;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x900F;&#x904E;&#x6BCF;&#x500B;&#x984C;&#x76EE;&#x4F86;&#x8907;&#x7FD2;&#x90A3;&#x4E9B;&#x300C;&#x91CD;&#x8981;&#x5E38;&#x8003;&#x7684;&#x55AE;&#x5143;&#x300D;&#x3002;</p>
<h2 id="&#x5BEB;&#x8003;&#x53E4;&#x984C;&#x5F88;&#x591A;&#x90FD;&#x4E0D;&#x6703;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x55CE;"><a href="#&#x5BEB;&#x8003;&#x53E4;&#x984C;&#x5F88;&#x591A;&#x90FD;&#x4E0D;&#x6703;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x55CE;&#xFF1F;" class="headerlink" title="&#x5BEB;&#x8003;&#x53E4;&#x984C;&#x5F88;&#x591A;&#x90FD;&#x4E0D;&#x6703;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x55CE;&#xFF1F;"></a>&#x5BEB;&#x8003;&#x53E4;&#x984C;&#x5F88;&#x591A;&#x90FD;&#x4E0D;&#x6703;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x55CE;&#xFF1F;</h2><p>&#x9019;&#x500B;&#x8981;&#x770B;&#x4F60;&#x60F3;&#x7684;&#x5B78;&#x6821;&#xFF0C;&#x4EE5;&#x6BD4;&#x8F03;&#x9032;&#x968E;&#x7684;&#x5B78;&#x6821;&#x4F86;&#x8AAA;&#x9019;&#x662F;&#x975E;&#x5E38;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x4EE5;&#x8003;&#x53E4;&#x5167;&#x5BB9;&#x4F86;&#x8AAA;&#xFF0C;&#x539F;&#x6587;&#x66F8;/&#x88DC;&#x7FD2;&#x73ED;&#x5171;&#x540C;&#x6709;&#x7684;&#x90E8;&#x4EFD;&#x4E00;&#x5B9A;&#x90FD;&#x662F;&#x6700;&#x91CD;&#x8981;&#x6700;&#x57FA;&#x790E;&#x7684;&#x90E8;&#x5206;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x5B9A;&#x8981;&#x62FF;&#x5206;&#x7684;&#x90E8;&#x5206;&#xFF09;&#x3002;&#x4F46;&#x771F;&#x6B63;&#x5728;&#x5BEB;&#x8003;&#x53E4;&#x984C;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x5E38;&#x5E38;&#x6703;&#x6709;&#x9019;&#x7A2E;&#x5F88;&#x96E3;&#x6216;&#x662F;&#x6C92;&#x770B;&#x904E;&#x7684;&#x984C;&#x76EE;&#xFF0C;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x5F9E;&#x6BCF;&#x500B;&#x7BC4;&#x570D;&#x5728;&#x5EF6;&#x4F38;&#x51FA;&#x53BB;&#x4E00;&#x9EDE;&#x9EDE;&#x7684;&#x9032;&#x968E;&#x984C;&#x3002;&#x4E5F;&#x5F88;&#x5E38;&#x770B;&#x5230;&#x8001;&#x5E2B;&#x6703;&#x62FF;&#x4E8C;&#x4E09;&#x5E74;&#x7D1A;&#x7684;&#x8AB2;&#x7A0B;&#x7528;&#x66F8;&#x4E2D;&#x51FA;&#x984C;&#xFF0C;&#x50CF;&#x9019;&#x7A2E;&#x5728;&#x6E96;&#x5099;&#x4E0A;&#x5C31;&#x6703;&#x5F88;&#x96E3;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x6703;&#x5F9E;&#x8003;&#x984C;&#x53BB;&#x505A;&#x5B78;&#x7FD2;&#xFF0C;&#x67E5;&#x4E86;&#x5F88;&#x591A;&#x96F6;&#x6563;&#x7684;&#x8CC7;&#x6599;&#xFF0C;&#x5C0E;&#x81F4;&#x5FC3;&#x4E2D;&#x7684;&#x77E5;&#x8B58;&#x5730;&#x5716;&#x5F88;&#x6DF7;&#x4E82;&#xFF0C;&#x9019;&#x6A23;&#x53CD;&#x800C;&#x5728;&#x8907;&#x7FD2;&#x4E0A;&#x6703;&#x5F88;&#x5403;&#x529B;&#x3002;</p>
<p>&#x6211;&#x81EA;&#x5DF1;&#x6703;&#x5EFA;&#x8B70;&#x5148;&#x628A;&#x300C;&#x8A08;&#x6982;&#x55AE;&#x5143;&#x7684;&#x57FA;&#x790E;&#x8B80;&#x719F;&#x300D;&#xFF0C;&#x7576;&#x6210;&#x662F;&#x57FA;&#x790E;&#x7684;&#x77E5;&#x8B58;&#x67B6;&#x69CB;&#xFF0C;&#x518D;&#x5229;&#x7528;&#x8003;&#x53E4;&#x984C;&#x4F86;&#x8907;&#x7FD2;&#x9019;&#x500B;&#x67B6;&#x69CB;&#xFF0C;&#x4E26;&#x4E14;&#x88DC;&#x5145;&#x3001;&#x758A;&#x52A0;&#x66F4;&#x591A;&#x6BD4;&#x8F03;&#x5EF6;&#x4F38;&#x7684;&#x90E8;&#x5206;&#x9032;&#x53BB;&#x3002;&#x6240;&#x4EE5;&#x5BEB;&#x53E4;&#x63D0;&#x7684;&#x904E;&#x7A0B;&#x5176;&#x5BE6;&#x662F;&#x4E00;&#x7A2E;&#x300C;&#x8907;&#x7FD2;&#x300D;+&#x300C;&#x88DC;&#x5145;&#x300D;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5FC3;&#x4E2D;&#x7684;&#x6838;&#x5FC3;&#x77E5;&#x8B58;&#x662F;&#x8D8A;&#x4F86;&#x8D8A;&#x7A69;&#x56FA;&#xFF0C;&#x5167;&#x5BB9;&#x4E5F;&#x6703;&#x8D8A;&#x4F86;&#x8D8A;&#x8C50;&#x5BCC;&#x3002;&#x6211;&#x8A18;&#x5F97;&#x66FE;&#x7D93;&#x770B;&#x904E;&#x5B78;&#x9577;&#x59D0;&#x5206;&#x4EAB;&#x904E;&#x300C;&#x539F;&#x6587;&#x66F8;&#x662F;&#x6A39;&#x6839;&#xFF0C;&#x8A08;&#x6982;&#x8AB2;&#x7684;&#x662F;&#x6A39;&#x5E79;&#xFF0C;&#x5404;&#x55AE;&#x5143;&#x7684;&#x7DF4;&#x7FD2;&#x984C;/&#x5C0F;&#x8003;&#x662F;&#x6A39;&#x679D;&#xFF0C;&#x8003;&#x53E4;&#x984C;&#x5247;&#x662F;&#x6700;&#x672B;&#x7AEF;&#x6A39;&#x8449;&#x300D;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x5011;&#x9084;&#x662F;&#x4EE5;&#x6574;&#x500B;&#x6846;&#x67B6;&#x70BA;&#x4E3B;&#xFF0C;&#x9010;&#x6B65;&#x5F80;&#x5916;&#x5B78;&#x7FD2;&#xFF0C;&#x624D;&#x80FD;&#x5920;&#x539A;&#x5BE6;&#x7A69;&#x56FA;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x90FD;&#x662F;&#x500B;&#x4EBA;&#x89C0;&#x9EDE;&#x5566;&#xFF0C;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x5E6B;&#x52A9;&#x5230;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x9EBC;&#x6E96;&#x5099;&#x7684;&#x5B78;&#x5F1F;&#x5011;&#x3002;&#x6700;&#x5F8C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x8A08;&#x6982;&#x8003;&#x8A66;&#x4E0A;&#x9047;&#x5230;&#x4EFB;&#x4F55;&#x554F;&#x984C;&#xFF0C;&#x90FD;&#x6B61;&#x8FCE;&#x5728;&#x4E0B;&#x65B9;&#x7559;&#x8A00;&#xFF1A;&#xFF09;</p>
<hr>
<h2 id="license"><a href="#License" class="headerlink" title="License"></a>License</h2><p><img src="http://i.creativecommons.org/l/by-sa/3.0/88x31.png" style="    margin: 0;"><br>&#x672C;&#x8457;&#x4F5C;&#x7531;<a href="https://www.facebook.com/v123582" target="_blank" rel="noopener"> Chang, Wei-Yaun (v123582) </a>&#x88FD;&#x4F5C;&#xFF0C;<br>&#x4EE5;<a href="http://creativecommons.org/licenses/by-sa/3.0/deed.zh_TW" target="_blank" rel="noopener">&#x5275;&#x7528;CC &#x59D3;&#x540D;&#x6A19;&#x793A;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5206;&#x4EAB; 3.0 Unported</a>&#x6388;&#x6B0A;&#x689D;&#x6B3E;&#x91CB;&#x51FA;&#x3002;</p>
</div><div class="post-nav"><a href="/2020/05/30/資料時代的來臨/" class="pre"><i class="icon-previous">資料時代的來臨</i></a><a href="/2020/05/29/Label-Encoding-與-One-Hot-Encoding-大不同-利用-Python-實現/" class="next">Label Encoding 與 One Hot Encoding 大不同 - 利用 Python 實現<i class="icon-next"></i></a></div><div id="disqus_thread"><script>var disqus_shortname = 'v123582';
var disqus_identifier = '2020/05/29/計概考古題準備策略-轉學考-資管所-公職考科/';
var disqus_title = '計概考古題準備策略 - 轉學考/資管所/公職考科';
var disqus_url = 'https://blog.v12358.tw/2020/05/29/計概考古題準備策略-轉學考-資管所-公職考科/';
(function() {
  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();</script><script id="dsq-count-scr" src="//v123582.disqus.com/count.js" async="async"></script></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><div class="widget-title">Information</div><ul><div class="tags">標籤：<a href="/tags/計算機概論/">計算機概論 </a><a href="/tags/計概考古題/">計概考古題 </a></div><div class="categories">分類：<a href="/categories/Scholarship/">Scholarship</a></div></ul></div><div class="widget"><div class="widget-title">Table of Content</div><div class="clear"><div id="toc" class="toc-article"><div class="toc"></div></div></div></div><script type="text/javascript" src="//js1.bloggerads.net/ShowAds.aspx?blogid=20190326000001" async></script></div></div></div><div id="footer">© <a href="/" rel="nofollow">資料科學家的工作日常.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><script src="/js/jquery.min.js"></script>
<script src="/js/share.js"></script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script><a id="rocket" href="#top" class="show"></a><script src="/js/jquery.min.js"></script>
<script src="/js/totop.js"></script><script src="/js/fancybox.pack.js"></script>
<script src="/js/jquery.fancybox.js"></script><link rel="stylesheet" href="/css/jquery.fancybox.css"><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
ga('create','UA-59103909-1','auto');ga('send','pageview');
</script></div><!-- hexo-inject:begin --><!-- hexo-inject:end --></body></html>