<!DOCTYPE html><html lang="zh-TW"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"/><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"/><meta content="yes" name="apple-mobile-web-app-capable"/><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"/><meta content="telephone=no" name="format-detection"/><meta name="description"/><meta property="og:image" content="https://avatars2.githubusercontent.com/u/5959524?v=3&amp;s=300"/><meta property="og:description" content="WeiYuan Note | 資料時代的來臨"/><meta property="og:title" content="資料時代的來臨"/><title>資料時代的來臨 | Let's Note Weiwei</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"/><link rel="stylesheet" type="text/css" href="/css/pure-min.css"/><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css"/><link rel="stylesheet" type="text/css" href="/css/style.css"/><link rel="stylesheet" type="text/css" href="/css/profile-card.css"/><link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.4.0/css/font-awesome.min.css"/><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"/><link rel="apple-touch-icon" href="/apple-touch-icon.png"/><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"/><link rel="alternate" type="application/atom+xml" href="/atom.xml"/><script async="" src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><script><!-- hexo-inject:begin --><!-- hexo-inject:end -->(adsbygoogle = window.adsbygoogle || []).push({
google_ad_client: "ca-pub-7913880396333307",
enable_page_level_ads: true
});


</script><!-- hexo-inject:begin --><!-- hexo-inject:end --></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">資料時代的來臨</h1><a id="logo" href="https://v123582.github.io">Let's Note Weiwei</a><p class="description">在想像與實踐之間追逐著夢想；自由主義與務實主義的信奉者，偏執的樂觀份子。</p></div><div id="nav-menu"><a href="https://v123582.github.io/about"><i class="icon-about"> 關於</i></a><a href="https://v123582.github.io/project"><i class="fa fa-tasks"> 專案</i></a><a href="https://v123582.github.io/blog"><i class="icon-archive"> 技術</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post post-page"><h1 class="post-title"><span><i class="fa fa-star"></i></span>資料時代的來臨</h1><div class="post-meta">2020-05-30 | WeiYuan (@v123582)</div><a data-url="https://blog.v12358.tw/2020/05/30/資料時代的來臨/" data-id="ckb1zc8hz0048n1q1171v5e0o" class="article-share-link">Share</a><div class="post-content"><h2 id="&#x958B;&#x5834;&#x8207;&#x671F;&#x671B;"><a href="#&#x958B;&#x5834;&#x8207;&#x671F;&#x671B;" class="headerlink" title="&#x958B;&#x5834;&#x8207;&#x671F;&#x671B;"></a>&#x958B;&#x5834;&#x8207;&#x671F;&#x671B;</h2><p>&#x5728;&#x63A5;&#x4E0B;&#x4F86;&#x7684;&#x4E09;&#x5341;&#x5929;&#xFF0C;&#x6703;&#x5F9E;&#x6821;&#x5712;&#x7562;&#x696D;&#x8D70;&#x5230;&#x8077;&#x5834;&#xFF0C;&#x7528;&#x81EA;&#x8EAB;&#x525B;&#x7562;&#x696D;&#x7684;&#x65B0;&#x9BAE;&#x4EBA;&#x89D2;&#x5EA6;&#x4F86;&#x770B;&#x5F85;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9019;&#x500B;&#x6280;&#x8853;&#x7684;&#x767C;&#x5C55;&#x8207;&#x6F14;&#x9032;&#x3002;&#x904E;&#x53BB;&#x5728;&#x5B78;&#x6821;&#xFF0C;&#x5F80;&#x5F80;&#x6703;&#x9677;&#x5165;&#x4E00;&#x500B;&#x7279;&#x5B9A;&#x7684;&#x89D2;&#x5EA6;&#x89E3;&#x554F;&#x984C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x9762;&#x5C0D;&#x771F;&#x5BE6;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x6709;&#x8A31;&#x8A31;&#x591A;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x88AB;&#x8003;&#x616E;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8A66;&#x5716;&#x5F9E;&#x6700;&#x52D9;&#x5BE6;&#x7684;&#x89D2;&#x5EA6;&#x958B;&#x59CB;&#xFF0C;&#x7D50;&#x5408;&#x7406;&#x8AD6;&#x8207;&#x5BE6;&#x4F5C;&#x53BB;&#x63A2;&#x7D22;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x771F;&#x5BE6;&#x4E16;&#x754C;&#x3002;&#x5982;&#x4F55;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#xFF0C;&#x57F9;&#x990A;&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x4E0B;&#x7684;&#x601D;&#x7DAD;&#x8207;&#x6280;&#x8853;&#x3002;</p>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><h2 id="&#x6280;&#x8853;&#x9A45;&#x52D5;&#x7684;&#x6F14;&#x9032;"><a href="#&#x6280;&#x8853;&#x9A45;&#x52D5;&#x7684;&#x6F14;&#x9032;" class="headerlink" title="&#x6280;&#x8853;&#x9A45;&#x52D5;&#x7684;&#x6F14;&#x9032;"></a>&#x6280;&#x8853;&#x9A45;&#x52D5;&#x7684;&#x6F14;&#x9032;</h2><p>&#x4E00;&#x500B;&#x8D77;&#x6E90;&#x65BC;&#x5341;&#x516B;&#x4E16;&#x7D00;&#x672B;&#x7684;&#x5DE5;&#x696D;&#x9769;&#x547D;&#xFF0C;&#x4EE5;&#x5DE5;&#x5EE0;&#x53D6;&#x4EE3;&#x4EBA;&#x5DE5;&#x751F;&#x7522;&#x7684;&#x6A5F;&#x5668;&#x9769;&#x547D;&#x3002;&#x7531;&#x84B8;&#x6C7D;&#x6A5F;&#x3001;&#x7164;&#x3001;&#x9435;&#x548C;&#x92FC;&#x70BA;&#x4E3B;&#x8981;&#x56E0;&#x7D20;&#x5C07;&#x50B3;&#x7D71;&#x751F;&#x7522;&#x6A21;&#x5F0F;&#x5347;&#x7D1A;&#x70BA;&#x65B0;&#x7684;&#x6A5F;&#x5668;&#x88FD;&#x9020;&#x904E;&#x7A0B;&#xFF0C;&#x5168;&#x9762;&#x7684;&#x6539;&#x8B8A;&#x4EBA;&#x5011;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x4EE5;&#x96FB;&#x529B;&#x7684;&#x61C9;&#x7528;&#x70BA;&#x8D77;&#x9EDE;&#xFF0C;&#x5341;&#x4E5D;&#x4E16;&#x7D00;&#x672B;&#x8D70;&#x5411;&#x4E86;&#x96FB;&#x6C23;&#x6642;&#x4EE3;&#xFF0C;&#x88AB;&#x7A31;&#x70BA;&#x662F;&#x7B2C;&#x4E8C;&#x6B21;&#x5DE5;&#x696D;&#x9769;&#x547D;&#x3002;&#x7B2C;&#x4E09;&#x6B21;&#x5DE5;&#x696D;&#x9769;&#x547D;&#x662F;&#x5728;&#x4E8C;&#x5341;&#x4E16;&#x7D00;&#x672B;&#x7684;&#x96FB;&#x8166;&#x9769;&#x547D;&#xFF0C;&#x6838;&#x5FC3;&#x6280;&#x8853;&#x662F;&#x96FB;&#x5B50;&#x8A08;&#x7B97;&#x6A5F;&#x6280;&#x8853;&#x3002;&#x4EF0;&#x8CF4;&#x5176;&#x904B;&#x7B97;&#x901F;&#x5EA6;&#x5FEB;&#x3001;&#x8655;&#x7406;&#x6578;&#x64DA;&#x91CF;&#x5927;&#x7684;&#x512A;&#x52E2;&#x4EE3;&#x66FF;&#x4EBA;&#x985E;&#x7684;&#x8166;&#x529B;&#x6216;&#x52DE;&#x52D5;&#xFF0C;&#x4F7F;&#x4EBA;&#x985E;&#x793E;&#x6703;&#x7684;&#x4FE1;&#x606F;&#x8655;&#x7406;&#x65B9;&#x5F0F;&#x6539;&#x8B8A;&#x4E86;&#x73FE;&#x4EE3;&#x793E;&#x6703;&#x7684;&#x904B;&#x4F5C;&#x7D50;&#x69CB;&#x3002;&#x5FEB;&#x901F;&#x7684;&#x767C;&#x5C55;&#xFF0C;&#x5E36;&#x52D5;&#x4E86;&#x4E00;&#x5927;&#x6279;&#x9AD8;&#x65B0;&#x6280;&#x8853;&#x7684;&#x6F14;&#x9032;&#x3002;</p>
<p>&#x904E;&#x53BB;&#x5E7E;&#x6B21;&#x7684;&#x5DE5;&#x696D;&#x9769;&#x547D;&#x90FD;&#x662F;&#x7AD9;&#x5728;&#x65B0;&#x6280;&#x8853;&#x9769;&#x65B0;&#x7684;&#x8F49;&#x6DDA;&#x9EDE;&#xFF0C;&#x5982;&#x4ECA;&#xFF0C;&#x6211;&#x5011;&#x4E5F;&#x7AD9;&#x5728;&#x4E00;&#x500B;&#x65B0;&#x6642;&#x4EE3;&#x7684;&#x6D6A;&#x5C16;&#x4E0A; &#x2013; &#x300C;&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x300D;&#x3002;</p>
<p>&#x96A8;&#x8457;&#x8A08;&#x7B97;&#x6A5F;&#x6280;&#x8853;&#x6F14;&#x9032;&#xFF0C;&#x8CC7;&#x6599;&#x91CF;&#x5FEB;&#x901F;&#x6210;&#x9577;&#x3001;&#x5132;&#x5B58;&#x6210;&#x672C;&#x4E0B;&#x964D;&#x548C;&#x96F2;&#x7AEF;&#x74B0;&#x5883;&#x6210;&#x719F;&#x7B49;&#x5BA2;&#x89C0;&#x689D;&#x4EF6;&#x5C31;&#x4F4D;&#x3002;&#x96FB;&#x8166;&#x8A08;&#x7B97;&#x80FD;&#x529B;&#x5927;&#x5E45;&#x63D0;&#x5347;&#xFF0C;&#x5E36;&#x4F86;&#x7684;&#x662F;&#x8CC7;&#x6599;&#x91CF;&#x5FEB;&#x901F;&#x7684;&#x7D2F;&#x7A4D;&#xFF0C;&#x4E5F;&#x56E0;&#x6B64;&#x9020;&#x5C31;&#x4E86;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x65B0;&#x6642;&#x4EE3;&#x601D;&#x7DAD;&#x3002;&#x5177;&#x9AD4;&#x800C;&#x8A00;&#xFF0C;&#x904E;&#x53BB;&#x79D1;&#x5B78;&#x767C;&#x5C55;&#x4F7F;&#x7528;&#x6F14;&#x7E79;&#x65B9;&#x6CD5;&#x7814;&#x7A76;&#xFF0C;&#x6839;&#x64DA;&#x63A8;&#x8AD6;&#x6C42;&#x5F97;&#x898F;&#x5F8B;&#x3002;&#x96A8;&#x8457;&#x9762;&#x81E8;&#x7684;&#x554F;&#x984C;&#x8B8A;&#x5F97;&#x8D8A;&#x767C;&#x5FA9;&#x96DC;&#xFF0C;&#x900F;&#x904E;&#x6F14;&#x7E79;&#x7684;&#x65B9;&#x5F0F;&#x9762;&#x81E8;&#x74F6;&#x9838;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x900F;&#x904E;&#x6B78;&#x7D0D;&#x65B9;&#x6CD5;&#x5F62;&#x6210;&#x53E6;&#x5916;&#x4E00;&#x7A2E;&#x89E3;&#x6C7A;&#x554F;&#x984C;&#x7684;&#x89C0;&#x9EDE;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C07;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x8207;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x63A8;&#x4E0A;&#x4E86;&#x986F;&#x5B78;&#x3002;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x4E0D;&#x540C;&#x65BC;&#x50B3;&#x7D71;&#x7D71;&#x8A08;&#x62BD;&#x6A23;&#x65B9;&#x6CD5;&#xFF0C;&#x8003;&#x616E;&#x7684;&#x662F;&#x8CC7;&#x6599;&#x6BCD;&#x9AD4;&#x3002;&#x5229;&#x7528;&#x6BD4;&#x5BE6;&#x8B49;&#x7814;&#x7A76;&#x66F4;&#x8017;&#x8CBB;&#x8A08;&#x7B97;&#x6210;&#x672C;&#x7684;&#x8CC7;&#x6599;&#x9A45;&#x52D5;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x900F;&#x904E;&#x5168;&#x9762;&#x5730;&#x5206;&#x6790;&#x5F9E;&#x8CC7;&#x6599;&#x4E2D;&#x6316;&#x6398;&#x51FA;&#x8CC7;&#x6599;&#x80CC;&#x5F8C;&#x7684;&#x95DC;&#x4FC2;&#x3002;</p>
<p>&#x7576;&#x524D;&#xFF0C;&#x6211;&#x5011;&#x6B63;&#x8655;&#x65BC;&#x4EBA;&#x985E;&#x6709;&#x53F2;&#x4EE5;&#x4F86;&#x767C;&#x5C55;&#x6700;&#x5FEB;&#x7684;&#x6642;&#x4EE3;&#x3002;&#x900F;&#x904E;&#x300C;&#x8CC7;&#x6599;&#x300D;&#x8207;&#x300C;&#x5206;&#x6790;&#x300D;&#xFF0C;&#x904B;&#x7528;&#x65B0;&#x7684;&#x601D;&#x7DAD;&#xFF0C;&#x5C07;&#x5E36;&#x4F86;&#x4E00;&#x5834;&#x65B0;&#x578B;&#x7684;&#x6539;&#x8B8A;&#x3002;&#x6280;&#x8853;&#x9A45;&#x52D5;&#x7684;&#x6F14;&#x9032;&#xFF0C;&#x5E36;&#x8457;&#x7D93;&#x6FDF;&#x9032;&#x884C;&#x7D50;&#x69CB;&#x6027;&#x6539;&#x9769;&#xFF0C;&#x8D70;&#x5411;&#x4E00;&#x500B;&#x5145;&#x6EFF;&#x8B8A;&#x5316;&#x7684;&#x672A;&#x4F86;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x5011;&#x5FC5;&#x9808;&#x8981;&#x628A;&#x63E1;&#x300C;&#x5275;&#x65B0;&#x300D;&#x7684;&#x6A5F;&#x6703;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x300C;&#x6280;&#x8853;&#x9A45;&#x52D5;&#x5275;&#x65B0;&#x300D;&#x7684;&#x6A5F;&#x6703;&#x3002;</p>
<h2 id="&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x7684;&#x9769;&#x65B0;"><a href="#&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x7684;&#x9769;&#x65B0;" class="headerlink" title="&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x7684;&#x9769;&#x65B0;"></a>&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x7684;&#x9769;&#x65B0;</h2><p>&#x300C;&#x6839;&#x64DA;&#x7814;&#x7A76;&#x6A5F;&#x69CB; IDC&#xFF08;&#x570B;&#x969B;&#x6578;&#x64DA;&#x8CC7;&#x8A0A;&#x516C;&#x53F8;&#xFF09;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x9019;&#x500B;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x8CC7;&#x6599;&#x6B63;&#x5728;&#x4EE5;&#x6BCF;&#x5169;&#x5E74;&#x5C31;&#x7FFB;&#x500D;&#x7684;&#x9A5A;&#x4EBA;&#x901F;&#x5EA6;&#x589E;&#x52A0;&#x4E2D;&#x3002;&#x4E86;&#x89E3;&#x5927;&#x6578;&#x64DA;&#x3001;&#x5982;&#x4F55;&#x5229;&#x7528;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#xFF0C;&#x6210;&#x4E86;&#x4EBA;&#x4EBA;&#x95DC;&#x5FC3;&#x7684;&#x91CD;&#x9EDE;&#x8B70;&#x984C;&#x3002;&#x9EA5;&#x80AF;&#x932B;&#x5168;&#x7403;&#x7814;&#x7A76;&#x4E2D;&#x5FC3;&#x7684;&#x5168;&#x7403;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x7814;&#x7A76;&#x5831;&#x544A;&#x6307;&#x51FA;&#xFF0C;&#x5168;&#x7403;&#x8CC7;&#x6599;&#x91CF;&#x5149;&#x662F;&#x5728;2010&#x5E74;&#x5C31;&#x589E;&#x52A0;&#x4E86;70&#x5104;GB&#xFF0C;&#x76F8;&#x7576;&#x65BC;4&#x5343;&#x5EA7;&#x7F8E;&#x570B;&#x570B;&#x6703;&#x5716;&#x66F8;&#x9928;&#x5178;&#x85CF;&#x8CC7;&#x6599;&#x7684;&#x7E3D;&#x548C;&#x3002;&#xFF08;<a href="https://www.inside.com.tw/2015/02/13/big-data-2-7-definitions-you-should-know-about" target="_blank" rel="noopener">7 &#x500B;&#x4F60;&#x4E0D;&#x53EF;&#x4E0D;&#x77E5;&#x7684;&#x5927;&#x6578;&#x64DA;&#x5B9A;&#x7FA9;</a>&#x3001;<a href="http://www.digitimes.com.tw/tw/b2b/Seminar/shwnws_new.asp?CnlID=18&amp;cat=99&amp;product_id=051A20117&amp;id=0000323392_49L2VW5JLIPRYJ13MIRYF" target="_blank" rel="noopener">&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x7684;&#x7149;&#x91D1;&#x8853;</a>&#xFF09;&#x300D;</p>
<p>&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x7684;&#x5B9A;&#x7FA9;&#x662F; Volume&#xFF08;&#x5BB9;&#x91CF;&#xFF09;&#x5927;&#x3001; Velocity&#xFF08;&#x901F;&#x5EA6;&#xFF09;&#x5FEB; &#x548C; Variety&#xFF08;&#x591A;&#x6A23;&#x6027;&#xFF09;&#xFF0C;&#x4F46;&#x4E5F;&#x5176;&#x4ED6;&#x5E7E;&#x7A2E;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x50CF;&#x662F; Veracity&#xFF08;&#x771F;&#x5BE6;&#x6027;&#xFF09; &#x548C; Value&#xFF08;&#x50F9;&#x503C;&#xFF09; &#x7B49;&#x7B49;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#x4F86;&#x8AAA;&#xFF0C;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x548C;&#x50B3;&#x7D71;&#x8CC7;&#x6599;&#x6700;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x662F;&#xFF0C;&#x8CC7;&#x6599;&#x4F86;&#x6E90;&#x591A;&#x5143;&#x3001;&#x7A2E;&#x985E;&#x7E41;&#x591A;&#xFF0C;&#x5927;&#x591A;&#x662F;&#x975E;&#x7D50;&#x69CB;&#x5316;&#x8CC7;&#x6599;&#xFF0C;&#x800C;&#x4E14;&#x66F4;&#x65B0;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x5C0E;&#x81F4;&#x8CC7;&#x6599;&#x91CF;&#x5927;&#x589E;&#x3002;&#x800C;&#x8981;&#x7528;&#x5927;&#x6578;&#x64DA;&#x5275;&#x9020;&#x50F9;&#x503C;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x6CE8;&#x610F;&#x6578;&#x64DA;&#x7684;&#x771F;&#x5BE6;&#x6027;&#x3002;</p>
<p>&#x70BA;&#x4EC0;&#x9EBC;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x662F;&#x4E00;&#x4EF6;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#xFF1F;&#x5728;&#x9EA5;&#x723E;&#x82DF;&#x4F2F;&#x683C;&#x5728;&#x300A;&#x5927;&#x6578;&#x64DA;&#x300B;&#x4E00;&#x66F8;&#x4E2D;&#x9019;&#x6A23;&#x8AAA;&#x660E;&#xFF1A;&#x300C;&#x900F;&#x904E;&#x66F4;&#x5B8C;&#x6574;&#x7684;&#x8CC7;&#x6599;&#x5206;&#x6790;&#xFF0C;&#x900F;&#x904E;&#x63A5;&#x8FD1;&#x6BCD;&#x9AD4;&#x7684;&#x8CC7;&#x6599;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x5927;&#x5E45;&#x964D;&#x4F4E;&#x50B3;&#x7D71;&#x62BD;&#x6A23;&#x6240;&#x7522;&#x751F;&#x7684;&#x7D71;&#x8A08;&#x8AA4;&#x5DEE;&#x3002;&#x300D;&#x63DB;&#x8A00;&#x4E4B;&#xFF0C;&#x6703;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x66F4;&#x591A;&#x66F4;&#x5FEB;&#x7684;&#x904B;&#x7B97;&#x6A5F;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x8207;&#x8A08;&#x7B97;&#x6A5F;&#x6280;&#x8853;&#x7684;&#x9032;&#x6B65;&#x662F;&#x76F8;&#x8F14;&#x76F8;&#x6210;&#x7684;&#x3002;&#x4E0D;&#x904E;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x4E5F;&#x4E0D;&#x76E1;&#x7136;&#x8981;&#x76F2;&#x76EE;&#x5730;&#x8FFD;&#x6C42;&#x300C;&#x5DE8;&#x91CF;&#x300D;&#x9019;&#x4EF6;&#x4E8B;&#x3002;&#x5927;&#x4F01;&#x696D;&#x80FD;&#x4EAB;&#x6709;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x7684;&#x898F;&#x6A21;&#x512A;&#x52E2;&#xFF0C;&#x4F46;&#x5C0F;&#x5718;&#x968A;&#x4E5F;&#x6709;&#x6210;&#x672C;&#x53CA;&#x5275;&#x65B0;&#x4E0A;&#x7684;&#x512A;&#x52E2;&#xFF0C;&#x56E0;&#x70BA;&#x901F;&#x5EA6;&#x5920;&#x5FEB;&#x3001;&#x9748;&#x6D3B;&#x5EA6;&#x9AD8;&#xFF0C;&#x5C31;&#x7B97;&#x7DAD;&#x6301;&#x5C0F;&#x898F;&#x6A21;&#xFF0C;&#x9084;&#x662F;&#x80FD;&#x5920;&#x84EC;&#x52C3;&#x767C;&#x5C55;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x80FD;&#x5426;&#x638C;&#x63E1;&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x7684;&#x601D;&#x7DAD;&#x8207;&#x5275;&#x65B0;&#x3002;</p>
<h2 id="&#x958B;&#x653E;&#x8CC7;&#x6599;&#x7684;&#x6210;&#x9577;"><a href="#&#x958B;&#x653E;&#x8CC7;&#x6599;&#x7684;&#x6210;&#x9577;" class="headerlink" title="&#x958B;&#x653E;&#x8CC7;&#x6599;&#x7684;&#x6210;&#x9577;"></a>&#x958B;&#x653E;&#x8CC7;&#x6599;&#x7684;&#x6210;&#x9577;</h2><p>&#x653F;&#x5E9C;&#x958B;&#x653E;&#x8CC7;&#x6599;&#x70BA;&#x8FD1;&#x5E74;&#x570B;&#x969B;&#x9593;&#x5099;&#x53D7;&#x95DC;&#x6CE8;&#x7684;&#x8B70;&#x984C;&#xFF0C;&#x81EA;&#x5F9E;2009&#x5E74;&#x82F1;&#x570B;&#x548C;&#x7F8E;&#x570B;&#x653F;&#x5E9C;&#x958B;&#x653E;&#x8CC7;&#x6599;&#x5E73;&#x53F0;&#x4E0A;&#x7DDA;&#x4EE5;&#x4F86;&#xFF0C;&#x5404;&#x500B;&#x570B;&#x5BB6;&#x9678;&#x7E8C;&#x767C;&#x5C55;&#x51FA;&#x653F;&#x5E9C;&#x958B;&#x653E;&#x8CC7;&#x6599;&#x5E73;&#x53F0;&#x3002;&#x958B;&#x653E;&#x8CC7;&#x6599;&#x4EE5;&#x63D0;&#x4F9B;&#x8CC7;&#x6599;&#x7684;&#x91CD;&#x8986;&#x5229;&#x7528;&#x70BA;&#x76EE;&#x7684;&#xFF0C;&#x63D0;&#x4F9B;&#x6C11;&#x773E;&#x8CC7;&#x6599;&#x5B58;&#x53D6;&#x6216;&#x61C9;&#x7528;&#x958B;&#x767C;&#x4E0A;&#x4F7F;&#x7528;&#xFF0C;&#x514D;&#x65BC;&#x667A;&#x6167;&#x8CA1;&#x7522;&#x6B0A;&#x7684;&#x9650;&#x5236;&#x53CA;&#x8CC7;&#x6599;&#x6536;&#x96C6;&#x4E0D;&#x8DB3;&#x7684;&#x969C;&#x7919;&#x3002;&#x5728;&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x4E0B;&#xFF0C;&#x8CC7;&#x6599;&#x5373;&#x670D;&#x52D9;&#x9020;&#x6210;&#x8A31;&#x591A;&#x9818;&#x57DF;&#x7A7A;&#x524D;&#x7684;&#x9032;&#x5C55;&#xFF0C;&#x6574;&#x5408;&#x8DE8;&#x9818;&#x57DF;&#x7684;&#x5408;&#x4F5C;&#x8207;&#x6FC0;&#x76EA;&#xFF0C;&#x900F;&#x904E;&#x6C11;&#x9593;&#x7684;&#x7121;&#x9650;&#x5275;&#x610F;&#xFF0C;&#x767C;&#x63EE;&#x8CC7;&#x6599;&#x52A0;&#x503C;&#x904B;&#x7528;&#x7684;&#x6975;&#x81F4;&#x3002;</p>
<p>&#x958B;&#x653E;&#x8CC7;&#x6599;&#x4E0D;&#x53EA;&#x5728;&#x6CD5;&#x4EE4;&#x9762;&#x4E0A;&#x8981;&#x958B;&#x653E;&#xFF0C;&#x5728;&#x6280;&#x8853;&#x9762;&#x4E0A;&#x4E5F;&#x4E00;&#x6A23;&#x9700;&#x8981;&#x958B;&#x653E;&#x3002;&#x63A1;&#x7528;&#x6A5F;&#x5668;&#x53EF;&#x8B80;&#x53D6;&#x7684;&#x6A94;&#x6848;&#x683C;&#x5F0F;&#x3002;API&#xFF08;Application Program Interface&#xFF0C;&#x61C9;&#x7528;&#x7A0B;&#x5E8F;&#x63A5;&#x53E3;&#xFF09;&#x63D0;&#x4F9B;&#x7A0B;&#x5F0F;&#x9023;&#x63A5;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x7A0B;&#x5F0F;&#x8A2D;&#x8A08;&#x5E2B;&#x53EF;&#x4EE5;&#x9078;&#x64C7;&#x8CC7;&#x6599;&#x4E2D;&#x8981;&#x8B80;&#x53D6;&#x7684;&#x7279;&#x5B9A;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x628A;&#x6574;&#x6279;&#x8CC7;&#x6599;&#x4E8B;&#x5148;&#x5B8C;&#x6574;&#x4E0B;&#x8F09;&#x56DE;&#x4F86;&#x3002;&#x300C;API &#x4E00;&#x822C;&#x90FD;&#x662F;&#x76F4;&#x63A5;&#x9023;&#x63A5;&#x5230;&#x4E00;&#x500B;&#x8CC7;&#x6599;&#x5EAB;&#xFF0C;&#x800C;&#x8CC7;&#x6599;&#x5EAB;&#x5167;&#x5132;&#x5B58;&#x7684;&#x90FD;&#x662F;&#x5373;&#x6642;&#x66F4;&#x65B0;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;&#x8CC7;&#x6599;&#x3002;&#x9019;&#x610F;&#x5473;&#x8457;&#xFF0C;&#x900F;&#x904E; API &#x7684;&#x547C;&#x53EB;&#x4F86;&#x91CB;&#x51FA;&#x8CC7;&#x6599;&#xFF0C;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6700;&#x5373;&#x6642;&#x7684;&#x65B0;&#x8CC7;&#x8A0A;&#x3002;&#xFF08;<a href="http://opendatahandbook.org/guide/zh_TW/how-to-open-up-data/" target="_blank" rel="noopener">&#x5982;&#x4F55;&#x5C07;&#x8CC7;&#x6599;&#x958B;&#x653E;&#x91CB;&#x51FA;</a>&#xFF09;&#x300D;&#x7121;&#x8AD6;&#x5728;&#x884C;&#x52D5;&#x3001;&#x5927;&#x6578;&#x64DA;&#x61C9;&#x7528;&#x7684;&#x9700;&#x6C42;&#x4E0B;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x958B;&#x653E;&#x8CC7;&#x6599;&#x900F;&#x904E; API &#x70BA;&#x4ECB;&#x63A5;&#x3002;API &#x5C07;&#x4F7F;&#x5F97;&#x8CC7;&#x6599;&#x7684;&#x516C;&#x958B;&#x66F4;&#x52A0;&#x5F48;&#x6027;&#xFF0C;&#x9054;&#x5230;&#x66F4;&#x591A;&#x7684;&#x52A0;&#x503C;&#x4F7F;&#x7528;&#x3002;</p>
<h2 id="&#x8DE8;&#x9818;&#x57DF;&#x6574;&#x5408;&#x7684;&#x5951;&#x6A5F;"><a href="#&#x8DE8;&#x9818;&#x57DF;&#x6574;&#x5408;&#x7684;&#x5951;&#x6A5F;" class="headerlink" title="&#x8DE8;&#x9818;&#x57DF;&#x6574;&#x5408;&#x7684;&#x5951;&#x6A5F;"></a>&#x8DE8;&#x9818;&#x57DF;&#x6574;&#x5408;&#x7684;&#x5951;&#x6A5F;</h2><p>&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x5E2D;&#x6372;&#x800C;&#x4F86;&#x7684;&#x4E0D;&#x53EA;&#x662F;&#x8CC7;&#x8A0A;&#x754C;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x5834;&#x5168;&#x9762;&#x6027;&#x7684;&#x9769;&#x65B0;&#x3002;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x5E36;&#x4F86;&#x7684;&#x662F;&#x5404;&#x500B;&#x9818;&#x57DF;&#x7684;&#x6539;&#x8B8A;&#xFF0C;&#x50CF;&#x662F; FinTech (&#x91D1;&#x878D;+&#x79D1;&#x6280;)&#x3001;Growth Hacking (&#x884C;&#x92B7;+&#x79D1;&#x6280;)&#x3001;Health Care&#xFF08;&#x91AB;&#x5B78;+&#x79D1;&#x6280;&#xFF09;&#x7B49;&#x7B49;&#x90FD;&#x662F;&#x96A8;&#x8457;&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x4E0B;&#x5728;&#x8DE8;&#x9818;&#x57DF;&#x6574;&#x5408;&#x4E0B;&#x800C;&#x8208;&#x8D77;&#x7684;&#x8DA8;&#x52E2;&#x3002;&#x63DB;&#x53E5;&#x8A71;&#x8AAA;&#xFF0C;&#x5DE8;&#x91CF;&#x8CC7;&#x6599;/&#x8CC7;&#x6599;&#x601D;&#x7DAD;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x662F;&#x4E00;&#x7A2E;&#x8DE8;&#x57DF;&#x7684;&#x5B8F;&#x89C0;&#x8996;&#x91CE;&#x3002;&#x5F9E;&#x5E7E;&#x500B;&#x5E02;&#x5834;&#x71B1;&#x9580;&#x7684;&#x8A0E;&#x8AD6;&#x8B70;&#x984C;&#x4F86;&#x770B;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8CC7;&#x6599;&#x61C9;&#x7528;&#x626E;&#x6F14;&#x7684;&#x89D2;&#x8272;&#x3002;</p>
<h2 id="reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><p>[1]<a href="http://www.ifuun.com/a20161130676539/" target="_blank" rel="noopener">&#x76E4;&#x9EDE;&#x4E16;&#x754C;&#x56DB;&#x6B21;&#x79D1;&#x6280;&#x9769;&#x547D;&#x7684;&#x6A19;&#x8A8C;&#x6027;&#x6210;&#x5C31;&#x8207;&#x4EBA;&#x7269;</a><br>[2]<a href="http://www.cw.com.tw/article/article.action?id=5074023" target="_blank" rel="noopener">&#x4E0B;&#x4E00;&#x4EF6;&#x5927;&#x4E8B;&#xFF1A;&#x7B2C;&#x56DB;&#x6B21;&#x5DE5;&#x696D;&#x9769;&#x547D;</a><br>[3]<a href="http://www.bnext.com.tw/article/35807/BN-2015-03-31-151014-36" target="_blank" rel="noopener">&#x4E00;&#x6B21;&#x641E;&#x61C2;&#x5927;&#x6578;&#x64DA;</a><br>[4]<a href="http://www.digitimes.com.tw/tw/b2b/Seminar/shwnws_new.asp?CnlID=18&amp;cat=99&amp;product_id=051A20117&amp;id=0000323392_49L2VW5JLIPRYJ13MIRYF" target="_blank" rel="noopener">&#x5DE8;&#x91CF;&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x7684;&#x7149;&#x91D1;&#x8853;</a><br>[5]<a href="https://www.inside.com.tw/2015/02/13/big-data-2-7-definitions-you-should-know-about" target="_blank" rel="noopener">7 &#x500B;&#x4F60;&#x4E0D;&#x53EF;&#x4E0D;&#x77E5;&#x7684;&#x5927;&#x6578;&#x64DA;&#x5B9A;&#x7FA9;</a><br>[6]<a href="https://www.inside.com.tw/2015/12/28/5-predictions-of-big-data-in-2016" target="_blank" rel="noopener">2016 &#x53F0;&#x7063; Big Data &#x5E02;&#x5834;&#x4E94;&#x5927;&#x8DA8;&#x52E2;&#x9810;&#x6E2C;</a></p>
<hr>
<h2 id="license"><a href="#License" class="headerlink" title="License"></a>License</h2><p><img src="http://i.creativecommons.org/l/by-sa/3.0/88x31.png" style="    margin: 0;"><br>&#x672C;&#x8457;&#x4F5C;&#x7531;<a href="https://www.facebook.com/v123582" target="_blank" rel="noopener">Chang Wei-Yaun (v123582)</a>&#x88FD;&#x4F5C;&#xFF0C;<br>&#x4EE5;<a href="http://creativecommons.org/licenses/by-sa/3.0/deed.zh_TW" target="_blank" rel="noopener">&#x5275;&#x7528;CC &#x59D3;&#x540D;&#x6A19;&#x793A;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5206;&#x4EAB; 3.0 Unported</a>&#x6388;&#x6B0A;&#x689D;&#x6B3E;&#x91CB;&#x51FA;&#x3002;</p>
</div><div class="post-nav"><a href="/2020/05/30/資料專案團隊組成/" class="pre"><i class="icon-previous">資料專案團隊組成</i></a><a href="/2020/05/29/計概考古題準備策略-轉學考-資管所-公職考科/" class="next">計概考古題準備策略 - 轉學考/資管所/公職考科<i class="icon-next"></i></a></div><div id="disqus_thread"><script>var disqus_shortname = 'v123582';
var disqus_identifier = '2020/05/30/資料時代的來臨/';
var disqus_title = '資料時代的來臨';
var disqus_url = 'https://blog.v12358.tw/2020/05/30/資料時代的來臨/';
(function() {
  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();</script><script id="dsq-count-scr" src="//v123582.disqus.com/count.js" async="async"></script></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><div class="widget-title">Information</div><ul><div class="tags">標籤：<a href="/tags/後端開發筆記/">後端開發筆記 </a></div><div class="categories">分類：<a href="/categories/Data-Science/">Data Science</a></div></ul></div><div class="widget"><div class="widget-title">Table of Content</div><div class="clear"><div id="toc" class="toc-article"><div class="toc"></div></div></div></div><script type="text/javascript" src="//js1.bloggerads.net/ShowAds.aspx?blogid=20190326000001" async=""></script></div></div></div><div id="footer">© <a href="/" rel="nofollow">Let's Note Weiwei.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><script src="/js/jquery.min.js"></script>
<script src="/js/share.js"></script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script><a id="rocket" href="#top" class="show"></a><script src="/js/jquery.min.js"></script>
<script src="/js/totop.js"></script><script src="/js/fancybox.pack.js"></script>
<script src="/js/jquery.fancybox.js"></script><link rel="stylesheet" href="/css/jquery.fancybox.css"><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
ga('create','UA-59103909-1','auto');ga('send','pageview');
</script></div><!-- hexo-inject:begin --><!-- hexo-inject:end --></body></html>