<!DOCTYPE html><html lang="zh-TW"><head><meta name="generator" content="Hexo 3.9.0"><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><meta property="og:image" content="https://avatars2.githubusercontent.com/u/5959524?v=3&amp;s=300"><meta property="og:description" content="WeiYuan Note | 有了模型然後呢？從資料模型到數據產品"><meta property="og:title" content="有了模型然後呢？從資料模型到數據產品"><title>有了模型然後呢？從資料模型到數據產品 | 資料科學家的工作日常</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"><link rel="stylesheet" type="text/css" href="/css/pure-min.css"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css"><link rel="stylesheet" type="text/css" href="/css/profile-card.css"><link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.4.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"><link href="//cdn-images.mailchimp.com/embedcode/slim-10_7.css" rel="stylesheet" type="text/css"><script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><script><!-- hexo-inject:begin --><!-- hexo-inject:end -->(adsbygoogle = window.adsbygoogle || []).push({
google_ad_client: "ca-pub-7913880396333307",
enable_page_level_ads: true
});


</script><!-- hexo-inject:begin --><!-- hexo-inject:end --></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">有了模型然後呢？從資料模型到數據產品</h1><a id="logo" href="https://v123582.github.io">資料科學家的工作日常</a><p class="description">#遠端 #斜槓 #教學 #資料科學 #網站開發</p></div><div id="nav-menu"><a href="https://v123582.github.io/about"><i class="icon-about"> 關於</i></a><a href="https://v123582.github.io/project"><i class="fa fa-tasks"> 專案</i></a><a href="https://v123582.github.io/blog"><i class="icon-archive"> 技術</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post post-page"><h1 class="post-title"><span><i class="fa fa-star"></i></span>有了模型然後呢？從資料模型到數據產品</h1><div class="post-meta">2021-04-30 | WeiYuan (@v123582)</div><a data-url="https://blog.v12358.tw/2021/04/30/有了模型然後呢？從分析模型到數據產品/" data-id="cktgnccsk007cuwobxuwvac8f" class="article-share-link">Share</a><div class="post-content"><h2 id="&#x5F9E;&#x77E5;&#x8B58;&#x7BA1;&#x7406;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;"><a href="#&#x5F9E;&#x77E5;&#x8B58;&#x7BA1;&#x7406;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;" class="headerlink" title="&#x5F9E;&#x77E5;&#x8B58;&#x7BA1;&#x7406;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;"></a>&#x5F9E;&#x77E5;&#x8B58;&#x7BA1;&#x7406;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;</h2><p>&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x662F;&#x4E00;&#x7A2E;&#x5F9E;&#x8CC7;&#x6599;&#x5230;&#x6C7A;&#x7B56;&#x904E;&#x7A0B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x63A2;&#x8A0E;&#x7528;&#x6A21;&#x578B;&#x53BB;&#x89E3;&#x8B80;&#x4E0D;&#x540C;&#x7684;&#x8CC7;&#x6599;&#x8207;&#x5176;&#x610F;&#x6DB5;&#x3002;&#x5728;&#x7BA1;&#x7406;&#x5B78;&#x9662;&#x4E2D;&#x6709;&#x4E00;&#x9580;&#x77E5;&#x8B58;&#x7BA1;&#x7406;&#x7684;&#x8AB2;&#x7A0B;&#xFF0C;&#x5C07;&#x5229;&#x7528;&#x539F;&#x59CB;&#x8CC7;&#x6599;&#x7522;&#x751F;&#x77E5;&#x8B58;&#x7684;&#x904E;&#x7A0B;&#x5206;&#x6210;&#x56DB;&#x500B;&#x968E;&#x6BB5;&#x3002;&#x6839;&#x64DA;<a href="https://zh.wikipedia.org/zh-tw/%E7%9F%A5%E8%AF%86%E7%AE%A1%E7%90%86" target="_blank" rel="noopener">&#x7DAD;&#x57FA;&#x767E;&#x79D1;</a>&#x7684;&#x5B9A;&#x7FA9;&#xFF0C;&#x77E5;&#x8B58;&#x7BA1;&#x7406;&#xFF08;Knowledge Management&#xFF0C;KM&#xFF09;&#x5305;&#x62EC;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5B9A;&#x7FA9;&#x3001;&#x5275;&#x5EFA;&#x3001;&#x50B3;&#x64AD;&#x3001;&#x63A1;&#x7528;&#x65B0;&#x7684;&#x77E5;&#x8B58;&#x548C;&#x7D93;&#x9A57;&#x7684;&#x6230;&#x7565;&#x548C;&#x5BE6;&#x8E10;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x65BC;&#x500B;&#x4EBA;&#x77E5;&#x8B58;&#x6216;&#x7D44;&#x7E54;&#x4E2D;&#x5546;&#x696D;&#x6D41;&#x7A0B;&#x7684;&#x5BE6;&#x8E10;&#x3002;&#x77E5;&#x8B58;&#x7BA1;&#x7406;&#x7684;&#x76EE;&#x6A19;&#x662F;&#x5E6B;&#x52A9;&#x4EBA;&#x985E;&#x5982;&#x4F55;&#x7CFB;&#x7D71;&#x6027;&#x5730;&#x7D2F;&#x7A4D;&#x7D93;&#x9A57;&#x3001;&#x7BA1;&#x7406;&#x77E5;&#x8B58;&#xFF0C;&#x6210;&#x70BA;&#x4E00;&#x500B;&#x66F4;&#x6709;&#x667A;&#x6167;&#x7684;&#x4EBA;&#x985E;&#xFF0C;&#x9019;&#x5176;&#x4E2D;&#x300C;&#x7D93;&#x9A57;&#x300D;&#x626E;&#x6F14;&#x91CD;&#x8981;&#x7684;&#x9F52;&#x8F2A;&#x3002;&#x5F9E;&#x77E5;&#x8B58;&#x7BA1;&#x7406;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#xFF0C;&#x77E5;&#x8B58;&#x6216;&#x6C7A;&#x7B56;&#x7684;&#x7522;&#x751F;&#x65B9;&#x5F0F;&#x6B63;&#x5728;&#x6539;&#x8B8A;&#x3002;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x6A5F;&#x5668;&#x7684;&#x512A;&#x52E2;&#x4F86;&#x8F49;&#x63DB;&#x77E5;&#x8B58;&#xFF0C;&#x964D;&#x4F4E;&#x5C0D;&#x7D93;&#x9A57;&#x7684;&#x4F9D;&#x8CF4;&#xFF0C;&#x90A3;&#x4EBA;&#x5011;&#x5C31;&#x5F97;&#x4EE5;&#x66F4;&#x52A0;&#x5C08;&#x6CE8;&#x65BC;&#x300C;&#x6C7A;&#x7B56;&#x300D;&#x3002;&#x63DB;&#x53E5;&#x8A71;&#x8AAA;&#xFF0C;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x662F;&#x4E00;&#x7A2E;&#x5229;&#x7528;&#x6578;&#x64DA;&#x5E6B;&#x52A9;&#x4EBA;&#x9032;&#x884C;&#x6C7A;&#x7B56;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><p><img src="https://i.imgur.com/xVdKQov.png" alt="&#x6578;&#x4F4D;&#x5316;&#x8207;&#x4EBA;&#x5DE5;&#x667A;&#x6167;"></p>
<blockquote>
<p>&#x300C;&#x5F9E;&#x8CC7;&#x6599;&#x958B;&#x59CB;&#xFF0C;&#x900F;&#x904E;&#x4E00;&#x9023;&#x4E32;&#x7684;&#x904E;&#x7A0B;&#x767C;&#x73FE;&#x96B1;&#x85CF;&#x5728;&#x8CC7;&#x6599;&#x4E2D;&#x7684;&#x898F;&#x5247;&#xFF0C;&#x5229;&#x7528;&#x9019;&#x4E9B;&#x898F;&#x5247;&#x5B8C;&#x6210;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x61C9;&#x7528;&#x3002;&#x300D;&#x3002;</p>
</blockquote>
<p>&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5F9E;&#x8CC7;&#x6599;&#x4E2D;&#x627E;&#x95DC;&#x4FC2;&#xFF0C;&#x5177;&#x9AD4;&#x4F86;&#x8AAA;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x5E7E;&#x500B;&#x968E;&#x6BB5;&#xFF1A;&#x300C;&#x53D6;&#x5F97;&#x8CC7;&#x6599;&#x300D;&#x2192;&#x300C;&#x8CC7;&#x6599;&#x524D;&#x8655;&#x7406;&#x300D;&#x2192;&#x300C;&#x8CC7;&#x6599;&#x8F49;&#x63DB;&#x300D;&#x2192;&#x300C;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x300D;&#x2192;&#x300C;&#x8CC7;&#x6599;&#x89E3;&#x91CB;&#x300D;&#x2192;&#x300E;&#x767C;&#x73FE;&#x77E5;&#x8B58;&#x300D;&#x7684;&#x516D;&#x500B;&#x968E;&#x6BB5; &#x3002; &#x5C31;&#x50CF;&#x4EE5;&#x4E0B;&#x9019;&#x5F35;&#x5716;&#x4F86;&#x81EA; Fayyad &#x5728; The KDD Process for Extracting Useful Knowledge from Volumes of Data &#x6240;&#x63D0;&#x5230;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x8655;&#x7406;&#x6D41;&#x7A0B;&#x3002;&#x4E0D;&#x904E;&#x9019;&#x500B;&#x904E;&#x7A0B;&#x4E26;&#x770B;&#x4F3C;&#x55AE;&#x4E00;&#x7684;&#x7DDA;&#x6027;&#x6D41;&#x7A0B;&#xFF0C;&#x4E0D;&#x904E;&#x5BE6;&#x969B;&#x4E0A;&#x4E26;&#x975E;&#x5F9E;&#x5DE6;&#x908A;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x505A;&#x5230;&#x53F3;&#x908A;&#x5C31;&#x53EF;&#x4EE5;&#x6253;&#x5B8C;&#x6536;&#x5DE5;&#x3002;&#x9019;&#x500B;&#x904E;&#x7A0B;&#x5176;&#x5BE6;&#x662F;&#x9700;&#x8981;&#x91CD;&#x8907;&#x4E0D;&#x65B7;&#x7684;&#x5617;&#x8A66;&#xFF0C;&#x4E00;&#x5C64;&#x4E00;&#x5C64;&#x63A2;&#x7D22;&#xFF0C;&#x6700;&#x7D42;&#x624D;&#x5F97;&#x4EE5;&#x627E;&#x5230;&#x771F;&#x6B63;&#x5177;&#x6709;&#x50F9;&#x503C;&#x7684;&#x77E5;&#x8B58;&#x3002;</p>
<p><img src="https://d3i71xaburhd42.cloudfront.net/6d962e9f04c653f732da82073a3446f75a371055/3-Figure1-1.png" alt="The KDD Process for Extracting Useful Knowledge from Volumes of Data "></p>
<p>KDD&#xFF08;Knowledge Discovery in Database&#xFF09;&#x662F;&#x8CC7;&#x6599;&#x5EAB;&#x9818;&#x57DF;&#x5728;&#x8CC7;&#x6599;&#x63A2;&#x52D8;&#xFF08;Data Mining&#xFF09;&#x524D;&#x6163;&#x7528;&#x7684;&#x4E00;&#x7A2E;&#x540D;&#x7A31;&#xFF08;&#x4E5F;&#x6709;&#x4EBA;&#x8AAA; Data mining &#x662F; KDD &#x7684;&#x4E00;&#x500B;&#x74B0;&#x7BC0;&#xFF09;&#xFF0C;&#x8CC7;&#x6599;&#x63A2;&#x52D8;&#x9818;&#x57DF;&#x4E2D;&#x7684;&#x77E5;&#x540D;&#x7684;&#x6703;&#x8B70;&#x5C31;&#x53EB;&#x505A; <a href="https://www.kdd.org/" target="_blank" rel="noopener">SIGKDD</a>&#x3002;&#x9019;&#x908A;&#x7528;&#x300C;Knowledge&#x300D;&#x9019;&#x500B;&#x5B57;&#x5176;&#x5BE6;&#x5C31;&#x662F;&#x547C;&#x61C9;&#x77E5;&#x8B58;&#x7BA1;&#x7406;&#x4E2D;&#x7684;&#x300C;Knowledge&#x300D;&#x3002;</p>
<h2 id="&#x5F9E;&#x8CC7;&#x6599;&#x6A21;&#x578B;&#x5230;&#x6578;&#x64DA;&#x7522;&#x54C1;"><a href="#&#x5F9E;&#x8CC7;&#x6599;&#x6A21;&#x578B;&#x5230;&#x6578;&#x64DA;&#x7522;&#x54C1;" class="headerlink" title="&#x5F9E;&#x8CC7;&#x6599;&#x6A21;&#x578B;&#x5230;&#x6578;&#x64DA;&#x7522;&#x54C1;"></a>&#x5F9E;&#x8CC7;&#x6599;&#x6A21;&#x578B;&#x5230;&#x6578;&#x64DA;&#x7522;&#x54C1;</h2><p>&#x50B3;&#x7D71;&#x7684;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x6A21;&#x578B;&#x901A;&#x5E38;&#x53EA;&#x8003;&#x616E;&#x5230;&#x300C;&#x7522;&#x51FA;&#x6A21;&#x578B;&#x300D;&#x70BA;&#x6B62;&#xFF0C;&#x8457;&#x91CD;&#x7684;&#x662F;&#x5982;&#x4F55;&#x8A13;&#x7DF4;&#x4E00;&#x500B;&#x300C;&#x597D;&#x300D;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x7522;&#x751F;&#x4EA4;&#x4ED8;&#x7684;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x500B;&#x6A21;&#x578B;&#x3002;&#x4F46;&#x6709;&#x4E86;&#x4E00;&#x500B;&#x597D;&#x7684;&#x6A21;&#x578B;&#x4E4B;&#x5F8C;&#xFF0C;&#x7136;&#x5F8C;&#x5462;&#xFF1F;</p>
<p><img src="https://imgur.com/qWyL2QZ.png" alt="&#x5F9E;&#x8CC7;&#x6599;&#x6A21;&#x578B;&#x5230;&#x6578;&#x64DA;&#x7522;&#x54C1;"></p>
<p>&#x6A21;&#x578B;&#x76F8;&#x5C0D;&#x4F86;&#x8AAA;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x6578;&#x5B78;&#x516C;&#x5F0F;&#x6216;&#x662F;&#x7A0B;&#x5F0F;&#x6F14;&#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x5BE6;&#x4E0D;&#x6613;&#x76F4;&#x63A5;&#x8B93;&#x9762;&#x5411;&#x4F7F;&#x7528;&#x8005;&#x3002;&#x5927;&#x90E8;&#x5206;&#x7684;&#x60C5;&#x6CC1;&#x662F;&#x5177;&#x6709;&#x300C;&#x8CC7;&#x6599;&#x7D20;&#x990A;&#x300D;&#x7684;&#x5C08;&#x696D;&#x5DE5;&#x4F5C;&#x8005;&#xFF0C;&#x4F8B;&#x5982;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5E2B;&#x3001;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x6703;&#x5C07;&#x6A21;&#x578B;&#x89E3;&#x8B80;&#x6210;&#x4E00;&#x822C;&#x4EBA;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x8CC7;&#x8A0A;&#x3002;&#x56E0;&#x6B64;&#x300C;&#x7522;&#x751F;&#x4E00;&#x500B;&#x5206;&#x6790;&#x5831;&#x543F;&#x3001;&#x8AAA;&#x4E00;&#x500B;&#x597D;&#x6545;&#x4E8B;&#x300D;&#x662F;&#x8A31;&#x591A;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5DE5;&#x4F5C;&#x8005;&#x9700;&#x8981;&#x8A13;&#x7DF4;&#x7684;&#x57FA;&#x790E;&#x80FD;&#x529B;&#xFF0C;&#x4F8B;&#x5982;&#x8CC7;&#x6599;&#x8996;&#x89BA;&#x5316;&#xFF08;Data Visualization&#xFF09;&#x6216;&#x8AAA;&#x6545;&#x4E8B;&#xFF08;Storytelling&#xFF09;&#x7684;&#x6280;&#x80FD;&#x3002;</p>
<p>&#x4E0D;&#x904E;&#x7576;&#x4F60;&#x60F3;&#x8981;&#x6253;&#x9020;&#x7684;&#x662F;&#x4E00;&#x500B;&#x300C;&#x6578;&#x64DA;&#x7522;&#x54C1;&#x300D;&#x6642;&#xFF0C;&#x50C5;&#x6709;&#x8CC7;&#x6599;&#x6A21;&#x578B;&#x7684;&#x89E3;&#x8B80;&#x975C;&#x614B;&#x7684;&#x5831;&#x544A;&#x662F;&#x9060;&#x9060;&#x4E0D;&#x8DB3;&#x7684;&#x3002;&#x6211;&#x5011;&#x9700;&#x8981;&#x7684;&#x662F;&#x66F4;&#x8CBC;&#x8FD1;&#x4F7F;&#x7528;&#x8005;&#x61C9;&#x7528;&#x5834;&#x666F;&#x7684;&#x89E3;&#x6C7A;&#x65B9;&#x6848;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x4F86;&#x8AAA;&#xFF0C;&#x5F9E;&#x8CC7;&#x6599;&#x6A21;&#x578B;&#x5230;&#x6578;&#x64DA;&#x7522;&#x54C1;&#x9700;&#x8981;&#x601D;&#x8003;&#x7684;&#x662F;&#x300C;&#x5982;&#x4F55;&#x5C07;&#x6A21;&#x578B;&#x90E8;&#x7F72;&#x6210;&#x4E00;&#x500B;&#x53EF;&#x6301;&#x7E8C;&#x4F7F;&#x7528;&#x7684;&#x7DDA;&#x4E0A;&#x7CFB;&#x7D71;&#x300D;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x4E5F;&#x5FC5;&#x9808;&#x601D;&#x8003;&#x5982;&#x4F55;&#x5C07;&#x6A21;&#x578B;&#x61C9;&#x7528;&#x66F4;&#x771F;&#x5BE6;&#x3001;&#x66F4;&#x5927;&#x91CF;&#x7684;&#x8CC7;&#x6599;&#x4E2D;&#x3002;</p>
<h2 id="&#x5F9E;&#x5BE6;&#x9A57;&#x8CC7;&#x6599;&#x5230;&#x771F;&#x5BE6;&#x8CC7;&#x6599;"><a href="#&#x5F9E;&#x5BE6;&#x9A57;&#x8CC7;&#x6599;&#x5230;&#x771F;&#x5BE6;&#x8CC7;&#x6599;" class="headerlink" title="&#x5F9E;&#x5BE6;&#x9A57;&#x8CC7;&#x6599;&#x5230;&#x771F;&#x5BE6;&#x8CC7;&#x6599;"></a>&#x5F9E;&#x5BE6;&#x9A57;&#x8CC7;&#x6599;&#x5230;&#x771F;&#x5BE6;&#x8CC7;&#x6599;</h2><p>&#x5728;&#x521D;&#x671F;&#x6A21;&#x578B;&#x8A13;&#x7DF4;&#x904E;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x6703;&#x6709;&#x300C;&#x6BD4;&#x8F03;&#x56B4;&#x8B39;&#x300D;&#x7684;&#x5206;&#x6790;&#x904E;&#x7A0B;&#x3002;&#x4F8B;&#x5982;&#x8CC7;&#x6599;&#x6703;&#x7D93;&#x904E;&#x6A19;&#x6E96;&#x7684;&#x62BD;&#x6A23;&#x904E;&#x7A0B;&#xFF0C;&#x8CC7;&#x6599;&#x4E5F;&#x5FC5;&#x9808;&#x6EFF;&#x8DB3;&#x4E00;&#x5B9A;&#x7684;&#x7D71;&#x8A08;&#x4EE3;&#x8868;&#x6027;&#x3002;&#x4F46;&#x96A8;&#x8457;&#x5927;&#x6578;&#x64DA;&#xFF08;Big Data&#xFF09;&#x7684;&#x89C0;&#x5FF5;&#x8DDF;&#x65B9;&#x6CD5;&#x9010;&#x6F38;&#x6210;&#x719F;&#xFF0C;&#x6BD4;&#x8D77;&#x56B4;&#x8B39;&#x53EF;&#x80FD;&#x66F4;&#x91CD;&#x8996;&#x300C;&#x53EF;&#x7528;&#x300D;&#x8207;&#x300C;&#x6709;&#x6548;&#x300D;&#x3002;&#x5728;&#x300A;Big Data&#x300B;&#x9019;&#x672C;&#x66F8;&#x4E2D;&#xFF0C;&#x544A;&#x8A34;&#x6211;&#x5011;&#x5728;&#x8CC7;&#x6599;&#x91CF;&#x5920;&#x5B8C;&#x6574;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#x5C0D;&#x65BC;&#x8CC7;&#x6599;&#x7684;&#x8AA4;&#x5DEE;&#x5BB9;&#x5FCD;&#x6027;&#x662F;&#x6BD4;&#x8F03;&#x5F37;&#x7684;&#x3002;&#x4E0D;&#x904E;&#x9019;&#x4E0D;&#x4EE3;&#x8868;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x8CC7;&#x6599;&#x641C;&#x96C6;&#x7684;&#x91CF;&#x6E2C;&#x8AA4;&#x5DEE;&#xFF0C;&#x5EFA;&#x8B70;&#x5C0D;&#x7D71;&#x8A08;&#x89E3;&#x8B80;&#x6709;&#x8208;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x53EF;&#x4EE5;&#x53C3;&#x8003; <a href="https://medium.com/@taweihuang1/%E9%82%A3%E4%BA%9B%E9%97%9C%E6%96%BC-%E5%A4%A7%E6%95%B8%E6%93%9A-%E7%9A%84%E8%AC%AC%E8%AB%96-%E8%AB%8B%E4%B8%8D%E8%A6%81%E5%9C%A8%E8%AA%AA%E6%A8%A3%E6%9C%AC%E5%8D%B3%E6%AF%8D%E9%AB%94%E4%BA%86-181329b53dd5" target="_blank" rel="noopener">&#x90A3;&#x4E9B;&#x95DC;&#x65BC;&#x300C;&#x5927;&#x6578;&#x64DA;&#x300D;&#x7684;&#x8B2C;&#x8AD6;&#xFF1A;&#x4E0D;&#x8981;&#x518D;&#x8AAA;&#x6A23;&#x672C;&#x5373;&#x6BCD;&#x9AD4;&#x4E86;&#xFF01;</a> &#x548C; <a href="http://yenchic-blog.logdown.com/posts/3071851-large-samples-of-data-and-errors" target="_blank" rel="noopener">&#x5927;&#x6578;&#x64DA;&#x8207;&#x504F;&#x5DEE;&#x6A23;&#x672C;</a> &#x9019;&#x5169;&#x7BC7;&#x6587;&#x7AE0;&#x3002;&#x6240;&#x4EE5;&#x5F9E;&#x5BE6;&#x9A57;&#x8CC7;&#x6599;&#x5230;&#x771F;&#x5BE6;&#x8CC7;&#x6599;&#x7684;&#x60C5;&#x5883;&#x4E2D;&#xFF0C;&#x6703;&#x6709;&#x5E7E;&#x500B;&#x73FE;&#x5BE6;&#x9700;&#x8981;&#x9762;&#x5C0D;&#xFF1A;</p>
<ol>
<li>&#x6536;&#x96C6;&#x5230;&#x7684;&#x8CC7;&#x6599;&#x53EF;&#x80FD;&#x66F4;&#x591A;&#x3001;&#x66F4;&#x5FEB;&#x3001;&#x66F4;&#x9AD2;</li>
<li>&#x7522;&#x751F;&#x7684;&#x7D50;&#x679C;&#x901A;&#x5E38;&#x662F;&#x6BD4;&#x8F03;&#x6A21;&#x7CCA;&#x7684;</li>
</ol>
<p>&#x9700;&#x8981;&#x601D;&#x8003;&#x7684;&#x662F;&#x5982;&#x4F55;&#x5728;&#x6709;&#x9650;&#x7684;&#x6642;&#x9593;&#x4E2D;&#xFF0C;&#x7522;&#x751F;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<h2 id="&#x5F9E;&#x6A21;&#x578B;&#x5230;&#x7CFB;&#x7D71;&#x90E8;&#x7F72;"><a href="#&#x5F9E;&#x6A21;&#x578B;&#x5230;&#x7CFB;&#x7D71;&#x90E8;&#x7F72;" class="headerlink" title="&#x5F9E;&#x6A21;&#x578B;&#x5230;&#x7CFB;&#x7D71;&#x90E8;&#x7F72;"></a>&#x5F9E;&#x6A21;&#x578B;&#x5230;&#x7CFB;&#x7D71;&#x90E8;&#x7F72;</h2><p>&#x6A21;&#x578B;&#x8DDF;&#x5831;&#x544A;&#x662F;&#x76F8;&#x5C0D;&#x62BD;&#x8C61;&#x8DDF;&#x975C;&#x614B;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x96E3;&#x4EE5;&#x8B93;&#x4F7F;&#x7528;&#x8005;&#x76F4;&#x63A5;&#x6709;&#x611F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F9E;&#x8CC7;&#x6599;&#x6A21;&#x578B;&#x5230;&#x6578;&#x64DA;&#x7522;&#x54C1;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x500B;&#x91CD;&#x9EDE;&#x5728;&#x65BC;&#x300C;&#x5982;&#x4F55;&#x5C07;&#x6A21;&#x578B;&#x90E8;&#x7F72;&#x6210;&#x4E00;&#x500B;&#x53EF;&#x6301;&#x7E8C;&#x4F7F;&#x7528;&#x7684;&#x7DDA;&#x4E0A;&#x7CFB;&#x7D71;&#x300D;&#x3002;&#x4F8B;&#x5982;&#x50CF;&#x63A8;&#x85A6;&#x7CFB;&#x7D71;&#x6216;&#x662F;&#x5716;&#x5F62;&#x8FA8;&#x8B58;&#x7CFB;&#x7D71;&#x4E4B;&#x985E;&#x7684;&#x7CFB;&#x7D71;&#xFF0C;&#x5C31;&#x662F;&#x4EE5;&#x61C9;&#x7528;&#x70BA;&#x76EE;&#x7684;&#xFF0C;&#x6A21;&#x578B;&#x53EA;&#x662F;&#x5176;&#x4E2D;&#x7684;&#x90E8;&#x5206;&#x800C;&#x5DF2;&#x3002;&#x5F9E;&#x9019;&#x4E9B;&#x89D2;&#x5EA6;&#x4F86;&#x770B;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x66F4;&#x65E9;&#x671F;&#x5C31;&#x628A;&#x6700;&#x7D42;&#x7684;&#x61C9;&#x7528;&#x8003;&#x616E;&#x9032;&#x4F86;&#xFF0C;&#x6216;&#x662F;&#x9700;&#x4E0D;&#x9700;&#x8981;&#x8B93;&#x8CC7;&#x6599;&#x6599;&#x5DE5;&#x4F5C;&#x8005;&#x4E5F;&#x5177;&#x5099;&#x7CFB;&#x7D71;&#x90E8;&#x5C6C;&#x7684;&#x7522;&#x51FA;&#x80FD;&#x529B;&#x90FD;&#x662F;&#x6253;&#x9020;&#x6578;&#x64DA;&#x7522;&#x54C1;&#x6642;&#x7684;&#x91CD;&#x9EDE;&#x3002;</p>
<p>&#x800C;&#x6700;&#x8FD1;&#x6D41;&#x884C;&#x7684; DataOps&#x3001;MLOps &#x548C; AIOps &#x5404;&#x7A2E; Operation &#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x63A2;&#x8A0E;&#x5982;&#x4F55;&#x5C0E;&#x5165;&#x654F;&#x6377;&#x958B;&#x767C;&#x7684;&#x539F;&#x5247;&#x3002;&#x8B93;&#x8CC7;&#x6599;&#x958B;&#x767C;&#x7684; Pipeline &#x53EF;&#x4EE5;&#x6709;&#x66F4;&#x597D;&#x7684;&#x5206;&#x6790;&#x3001;&#x90E8;&#x7F72;&#x3001;&#x8FED;&#x4EE3;&#x7684;&#x904E;&#x7A0B;&#xFF0C;&#x9032;&#x800C;&#x5BE6;&#x8E10;&#x81EA;&#x52D5;&#x5316;&#x904B;&#x884C;&#x7684;&#x76EE;&#x6A19;&#x3002;</p>
<p><img src="https://miro.medium.com/max/2000/1*SQP1pjIA1DeAWRAkTw6ODA.png" alt="https://towardsdatascience.com/what-the-ops-are-you-talking-about-518b1b1a2694"></p>
<!-- Begin Mailchimp Signup Form -->
<p><div id="mc_embed_signup"><form action="https://accupass.us6.list-manage.com/subscribe/post?u=840b112be5bede36036e19d3e&amp;id=d23f3a8e3a" method="post" id="mc-embedded-subscribe-form" name="mc-embedded-subscribe-form" class="validate" target="_blank" novalidate><div id="mc_embed_signup_scroll"><label for="mce-EMAIL">&#x5982;&#x679C;&#x60F3;&#x7372;&#x5F97;&#x6700;&#x65B0;&#x7684;&#x6280;&#x8853;&#x8CC7;&#x8A0A;&#xFF0C;&#x6B61;&#x8FCE;&#x8A02;&#x95B1;&#x8FFD;&#x8E64;&#xFF1A;</label><input type="email" value name="EMAIL" class="email" id="mce-EMAIL" placeholder="email address" required><div style="position: absolute; left: -5000px;" aria-hidden="true"><input type="text" name="b_840b112be5bede36036e19d3e_d23f3a8e3a" tabindex="-1" value></div><div class="clear"><input type="submit" value="Subscribe" name="subscribe" id="mc-embedded-subscribe" class="button"></div></div></form></div><br><!--End mc_embed_signup--></p>
<h2 id="reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><ul>
<li><a href="https://www.ithome.com.tw/news/88806" target="_blank" rel="noopener">Big Data&#x6B0A;&#x5A01;&#xFF1A;&#x5927;&#x8CC7;&#x6599;&#x554F;What&#x6BD4;Why&#x66F4;&#x91CD;&#x8981;</a></li>
<li><a href="https://medium.com/@taweihuang1/%E9%82%A3%E4%BA%9B%E9%97%9C%E6%96%BC-%E5%A4%A7%E6%95%B8%E6%93%9A-%E7%9A%84%E8%AC%AC%E8%AB%96-%E8%AB%8B%E4%B8%8D%E8%A6%81%E5%9C%A8%E8%AA%AA%E6%A8%A3%E6%9C%AC%E5%8D%B3%E6%AF%8D%E9%AB%94%E4%BA%86-181329b53dd5" target="_blank" rel="noopener">&#x90A3;&#x4E9B;&#x95DC;&#x65BC;&#x300C;&#x5927;&#x6578;&#x64DA;&#x300D;&#x7684;&#x8B2C;&#x8AD6;&#xFF1A;&#x4E0D;&#x8981;&#x518D;&#x8AAA;&#x6A23;&#x672C;&#x5373;&#x6BCD;&#x9AD4;&#x4E86;&#xFF01;</a></li>
<li><a href="http://yenchic-blog.logdown.com/posts/3071851-large-samples-of-data-and-errors" target="_blank" rel="noopener">&#x5927;&#x6578;&#x64DA;&#x8207;&#x504F;&#x5DEE;&#x6A23;&#x672C;</a></li>
<li><a href="https://bigdatafinance.tw/index.php/others/203-2015-08-08-14-23-54" target="_blank" rel="noopener">&#x5927;&#x6578;&#x64DA;&#xFF0C;&#x9084;&#x662F;&#x5927;&#x932F;&#x8AA4;&#xFF1F;</a></li>
</ul>
<hr>
<p style="color: #6d9eeb"><br>&#x55E8;&#xFF0C;&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x7DAD;&#x5143;&#xFF0C;&#x6301;&#x7E8C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x767C;&#x8868;&#x5C0D; #&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x3001; #&#x7DB2;&#x9801;&#x958B;&#x767C; &#x6216; #&#x8EDF;&#x9AD4;&#x8077;&#x6DAF; &#x76F8;&#x95DC;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x5982;&#x679C;&#x5C0D;&#x65BC;&#x5167;&#x6587;&#x6709;&#x7591;&#x554F;&#x90FD;&#x6B61;&#x8FCE;&#x8207;&#x6211;&#x5011;&#x9032;&#x4E00;&#x6B65;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x8FFD;&#x8E64;&#x6211;&#x7684; <a href="https://pse.is/3cazqk" style="color: #ff0000; font-weight: bold; text-decoration: underline;" target="_blank" rel="noopener">Facebook &#x7C89;&#x5C08;&#xFF1A;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684;&#x5DE5;&#x4F5C;&#x65E5;&#x5E38;</a> &#xFF0C;&#x4E5F;&#x6703;&#x4E0D;&#x5B9A;&#x6642;&#x7684;&#x8209;&#x8FA6;&#x5206;&#x4EAB;&#x6D3B;&#x52D5;&#xFF0C;&#x4E00;&#x8D77;&#x4F86;&#x73A9;&#x73A9;&#x5427; &#x30FD;(&#x25CF;&#xB4;&#x2200;`&#x25CF;)&#xFF89;<br><br>&#x6700;&#x8FD1;&#x8209;&#x8FA6;&#x4E86;&#x3010;<a href="https://pse.is/3bae23" style="color: #ff0000; font-weight: bold; text-decoration: underline;" target="_blank" rel="noopener">&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x7684; 12 &#x5802;&#x5FC3;&#x6CD5;&#x990A;&#x6210;&#x8AB2;</a>&#x3011;&#x7684;&#x76F4;&#x64AD;&#x8AB2;&#x7A0B;&#xFF0C;&#x672C;&#x7CFB;&#x5217;&#x8AB2;&#x7A0B;&#x6703;&#x5F9E;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x9019;&#x500B;&#x6280;&#x8853;&#x7684;&#x767C;&#x5C55;&#x8207;&#x6F14;&#x9032;&#x8AC7;&#x8D77;&#xFF0C;&#x7D50;&#x5408;&#x7406;&#x8AD6;&#x8207;&#x5BE6;&#x4F5C;&#x53BB;&#x63A2;&#x7D22;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x771F;&#x5BE6;&#x4E16;&#x754C;&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#x57F9;&#x990A;&#x8CC7;&#x6599;&#x6642;&#x4EE3;&#x4E0B;&#x7684;&#x601D;&#x7DAD;&#x8207;&#x6280;&#x8853;&#x3002;&#x6211;&#x5011;&#x900F;&#x904E; 12 &#x5802;&#x8AB2;&#x7A0B;&#xFF0C;&#x5167;&#x5BB9;&#x5C07;&#x6703;&#x8AC7;&#x5230;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x7684;&#x767C;&#x5C55;&#x8108;&#x7D61;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x500B;&#x8CC7;&#x6599;&#x5C08;&#x6848;&#x8A72;&#x5982;&#x4F55;&#x767C;&#x8D77;&#xFF0C;&#x958B;&#x59CB;&#x5F8C;&#x8A72;&#x5982;&#x4F55;&#x5BE6;&#x73FE;&#xFF0C;&#x9010;&#x6B65;&#x5EFA;&#x69CB;&#x5168;&#x9762;&#x7684;&#x8CC7;&#x6599;&#x5206;&#x6790;&#x5FC3;&#x6CD5;&#x3002;&#x6703;&#x7528;&#x767D;&#x8A71;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x6700;&#x4F4E;&#x9650;&#x5EA6;&#x7684;&#x6578;&#x5B78;&#x8207;&#x7A0B;&#x5F0F;&#x4E4B;&#x4E0B;&#x5E36;&#x4F60;&#x57F9;&#x990A;&#x8CC7;&#x6599;&#x79D1;&#x5B78;&#x5BB6;&#x6240;&#x9700;&#x7684;&#x6838;&#x5FC3;&#x5FC3;&#x6CD5; &#x1F680;&#x1F680;&#x1F680;<br><br><img src="https://imgur.com/gU2xKg5.png" alt><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://weiyuan.pse.is/3bcu7c" target="_blank" rel="noopener">https://weiyuan.pse.is/3bcu7c</a><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://weiyuan.pse.is/3bcu7c" target="_blank" rel="noopener">https://weiyuan.pse.is/3bcu7c</a><br>&#x1F4CD; &#x5831;&#x540D;&#x9801;&#x9762;&#xFF1A; <a href="https://weiyuan.pse.is/3bcu7c" target="_blank" rel="noopener">https://weiyuan.pse.is/3bcu7c</a><br></p>

<p><img src="https://imgur.com/Dv7dkMJ.png" alt></p>
<hr>
<h2 id="license"><a href="#License" class="headerlink" title="License"></a>License</h2><p><img src="http://i.creativecommons.org/l/by-sa/3.0/88x31.png" style="    margin: 0;"><br>&#x672C;&#x8457;&#x4F5C;&#x7531; <a href="https://www.facebook.com/v123582" target="_blank" rel="noopener">Chang Wei-Yaun (v123582)</a> &#x88FD;&#x4F5C;&#xFF0C;<br>&#x4EE5; <a href="http://creativecommons.org/licenses/by-sa/3.0/deed.zh_TW" target="_blank" rel="noopener">&#x5275;&#x7528;CC &#x59D3;&#x540D;&#x6A19;&#x793A;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5206;&#x4EAB; 3.0 Unported</a> &#x6388;&#x6B0A;&#x689D;&#x6B3E;&#x91CB;&#x51FA;&#x3002;</p>
</div><div class="post-nav"><a href="/2021/05/17/Python-網頁爬蟲的學習地圖與策略/" class="pre"><i class="icon-previous">Python 網頁爬蟲的學習地圖與策略</i></a><a href="/2021/03/10/程式碼持續優化的秘訣-Code-Review/" class="next">程式碼持續優化的秘訣 - Code Review<i class="icon-next"></i></a></div><div id="disqus_thread"><script>var disqus_shortname = 'v123582';
var disqus_identifier = '2021/04/30/有了模型然後呢？從分析模型到數據產品/';
var disqus_title = '有了模型然後呢？從資料模型到數據產品';
var disqus_url = 'https://blog.v12358.tw/2021/04/30/有了模型然後呢？從分析模型到數據產品/';
(function() {
  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();</script><script id="dsq-count-scr" src="//v123582.disqus.com/count.js" async="async"></script></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><div class="widget-title">Information</div><ul><div class="tags">標籤：<a href="/tags/資料科學系列/">資料科學系列 </a></div><div class="categories">分類：<a href="/categories/Data-Science/">Data Science</a></div></ul></div><div class="widget"><div class="widget-title">Table of Content</div><div class="clear"><div id="toc" class="toc-article"><div class="toc"></div></div></div></div><script type="text/javascript" src="//js1.bloggerads.net/ShowAds.aspx?blogid=20190326000001" async></script></div></div></div><div id="footer">© <a href="/" rel="nofollow">資料科學家的工作日常.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><script src="/js/jquery.min.js"></script>
<script src="/js/share.js"></script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script><a id="rocket" href="#top" class="show"></a><script src="/js/jquery.min.js"></script>
<script src="/js/totop.js"></script><script src="/js/fancybox.pack.js"></script>
<script src="/js/jquery.fancybox.js"></script><link rel="stylesheet" href="/css/jquery.fancybox.css"><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
ga('create','UA-59103909-1','auto');ga('send','pageview');
</script></div><!-- hexo-inject:begin --><!-- hexo-inject:end --></body></html>