<!DOCTYPE html><html lang="zh-TW"><head><meta name="generator" content="Hexo 3.9.0"><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><meta property="og:image" content="https://avatars2.githubusercontent.com/u/5959524?v=3&amp;s=300"><meta property="og:description" content="WeiYuan Note | 遠端團隊成功的五個小秘密"><meta property="og:title" content="遠端團隊成功的五個小秘密"><title>遠端團隊成功的五個小秘密 | 資料科學家的工作日常</title><link rel="stylesheet" type="text/css" href="/css/normalize.css"><link rel="stylesheet" type="text/css" href="/css/pure-min.css"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css"><link rel="stylesheet" type="text/css" href="/css/style.css"><link rel="stylesheet" type="text/css" href="/css/profile-card.css"><link rel="stylesheet" type="text/css" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.4.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"><link href="//cdn-images.mailchimp.com/embedcode/slim-10_7.css" rel="stylesheet" type="text/css"><script async src="//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><script><!-- hexo-inject:begin --><!-- hexo-inject:end -->(adsbygoogle = window.adsbygoogle || []).push({
google_ad_client: "ca-pub-7913880396333307",
enable_page_level_ads: true
});


</script><!-- hexo-inject:begin --><!-- hexo-inject:end --></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">遠端團隊成功的五個小秘密</h1><a id="logo" href="https://v123582.github.io">資料科學家的工作日常</a><p class="description">#遠端 #斜槓 #教學 #資料科學 #網站開發</p></div><div id="nav-menu"><a href="https://v123582.github.io/about"><i class="icon-about"> 關於</i></a><a href="https://v123582.github.io/project"><i class="fa fa-tasks"> 專案</i></a><a href="https://v123582.github.io/blog"><i class="icon-archive"> 技術</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post post-page"><h1 class="post-title"><span><i class="fa fa-star"></i></span>遠端團隊成功的五個小秘密</h1><div class="post-meta">2016-04-12 | WeiYuan (@v123582)</div><a data-url="https://blog.v12358.tw/2016/04/12/遠端團隊成功的五個小秘密/" data-id="ckti44exz008ytfobrq9c4kfc" class="article-share-link">Share</a><div class="post-content"><h2 id="introduction"><a href="#Introduction" class="headerlink" title="Introduction"></a>Introduction</h2><p>&#x9060;&#x7AEF;&#x5718;&#x968A;&#x4E00;&#x76F4;&#x662F;&#x5F88;&#x591A;&#x7A0B;&#x5F0F;&#x958B;&#x767C;&#x8005;&#x5922;&#x60F3;&#x7684;&#x5718;&#x968A;&#xFF0C;&#x7576;&#x7136;&#x5176;&#x4E2D;&#x4E5F;&#x6709;&#x8A31;&#x591A;&#x9700;&#x8981;&#x514B;&#x670D;&#x7684;&#x8B70;&#x984C;&#x3002;&#x7531;&#x65BC;&#x6210;&#x54E1;&#x5011;&#x53EF;&#x80FD;&#x8EAB;&#x8655;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x5982;&#x4F55;&#x6709;&#x6548;&#x7684;&#x5408;&#x4F5C;&#x662F;&#x9019;&#x6A23;&#x7684;&#x5718;&#x968A;&#x80FD;&#x5426;&#x6210;&#x529F;&#x7684;&#x95DC;&#x9375;&#x53CA;&#x6311;&#x6230;&#x3002;</p>
<!-- hexo-inject:begin --><!-- hexo-inject:end --><h2 id="1-stop-analyze-and-absorb"><a href="#1-Stop-analyze-and-absorb" class="headerlink" title="1. Stop, analyze and absorb."></a>1. Stop, analyze and absorb.</h2><p>&#x5728;&#x898F;&#x5283;&#x672A;&#x4F86;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x9808;&#x5148;&#x5206;&#x6790;&#x904E;&#x53BB;&#x7684;&#x6210;&#x6548;&#x3002;&#x5F88;&#x591A;&#x6642;&#x5019;&#x6211;&#x5011;&#x90FD;&#x6703;&#x5C0D;&#x672A;&#x4F86;&#x5145;&#x6EFF;&#x60F3;&#x50CF;&#x8DDF;&#x898F;&#x5283;&#xFF0C;&#x4F46;&#x9019;&#x662F;&#x5F88;&#x4E0D;&#x5207;&#x5BE6;&#x969B;&#x7684;&#x3002;&#x66F4;&#x6709;&#x6548;&#x7684;&#x4F5C;&#x6CD5;&#x662F;&#xFF0C;&#x61C9;&#x8A72;&#x662F;&#x57F7;&#x884C;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#x5F8C;&#xFF0C;&#x505C;&#x4E0B;&#x4F86;&#x8A55;&#x4F30;&#x9019;&#x6A23;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x4E0D;&#x662F;&#x503C;&#x5F97;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8A55;&#x4F30;&#x904E;&#x53BB;&#x7684;&#x6210;&#x6548;&#xFF0C;&#x6BD4;&#x898F;&#x5283;&#x672A;&#x4F86;&#x7684;&#x9032;&#x5C55;&#x662F;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x900F;&#x904E;&#x4EE5;&#x4E0B;&#x7684;&#x554F;&#x984C;&#xFF0C;&#x4F86;&#x8A55;&#x4F30;&#x4E00;&#x500B;&#x9060;&#x7AEF;&#x5718;&#x968A;&#x7684;&#x6210;&#x6548;&#xFF1A;</p>
<ul>
<li>&#x5718;&#x968A;&#x4E2D;&#x6709;&#x8DB3;&#x5920;&#x7684;&#x6E9D;&#x901A;&#x55CE;&#xFF1F;</li>
<li>&#x9060;&#x7AEF;&#x53EF;&#x4EE5;&#x89E3;&#x6C7A;&#x4EC0;&#x9EBC;&#x6A23;&#x7684;&#x554F;&#x984C;&#x55CE;&#xFF1F;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x89E3;&#x6C7A;&#x4EC0;&#x9EBC;&#xFF1F;</li>
<li>&#x7576;&#x65B0;&#x5718;&#x54E1;&#x52A0;&#x5165;&#x4EE5;&#x5F8C;&#xFF0C;&#x80FD;&#x5920;&#x5FEB;&#x901F;&#x8DDF;&#x4E0A;&#x7BC0;&#x594F;&#x55CE;&#xFF1F;</li>
<li>&#x9060;&#x7AEF;&#x5718;&#x968A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x53CA;&#x7522;&#x503C;&#x662F;&#x53EF;&#x4EE5;&#x52DD;&#x4EFB;&#x4E00;&#x9593;&#x516C;&#x53F8;&#x55CE;&#xFF1F;</li>
</ul>
<p>&#x5718;&#x968A;&#x7684;&#x7D50;&#x69CB;&#x662F;&#x6703;&#x96A8;&#x8457;&#x5718;&#x968A;&#x7684;&#x6210;&#x9577;&#x800C;&#x8B8A;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x7576;&#x898F;&#x6A21;&#x6210;&#x9577;&#x4E4B;&#x5F8C;&#xFF0C;&#x5FC5;&#x9808;&#x6642;&#x6642;&#x523B;&#x523B;&#x8003;&#x91CF;&#x662F;&#x4E0D;&#x662F;&#x9084;&#x9069;&#x5408;&#x7528;&#x9060;&#x7AEF;&#x4F5C;&#x70BA;&#x4E3B;&#x8981;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<h2 id="2-gather-data-and-insights-from-your-team"><a href="#2-Gather-data-and-insights-from-your-team" class="headerlink" title="2. Gather data and insights from your team."></a>2. Gather data and insights from your team.</h2><p>&#x5718;&#x968A;&#x4E2D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x8A0E;&#x8AD6;&#xFF0C;&#x4F46;&#x6700;&#x7D42;&#x53EF;&#x80FD;&#x53EA;&#x6703;&#x8B8A;&#x6210;&#x7D50;&#x8AD6;&#x88AB;&#x8A18;&#x9304;&#x4E0B;&#x4F86;&#xFF0C;&#x6216;&#x57F7;&#x884C;&#x3002;&#x800C;&#x6C92;&#x6709;&#x52A0;&#x5165;&#x8A0E;&#x8AD6;&#x7684;&#x5718;&#x54E1;&#xFF0C;&#x5C31;&#x5C07;&#x932F;&#x904E;&#x90A3;&#x4E9B;&#x73CD;&#x8CB4;&#x7684;&#x8A0E;&#x8AD6;&#x300C;&#x904E;&#x7A0B;&#x300D;&#xFF0C;&#x53EA;&#x80FD;&#x5F97;&#x5230;&#x4E00;&#x500B;&#x7C21;&#x55AE;&#x7684;&#x547D;&#x4EE4;&#x6216;&#x7D50;&#x8AD6;&#x3002;&#x9019;&#x4E9B;&#x8A0E;&#x8AD6;&#x7684;&#x904E;&#x7A0B;&#xFF0C;&#x60F3;&#x6CD5;&#xFF0C;&#x53CA;&#x8CC7;&#x6599;&#xFF0C;&#x90FD;&#x662F;&#x91CD;&#x8981;&#x7684;&#x8CC7;&#x6599;&#xFF0C;&#x6BCF;&#x4E00;&#x500B;&#x7D50;&#x8AD6;&#x7684;&#x80CC;&#x5F8C;&#x4E00;&#x5B9A;&#x5145;&#x6EFF;&#x7684;&#x4E0D;&#x540C;&#x89C0;&#x9EDE;&#x7684;&#x5F59;&#x6574;&#x3002;&#x5728;&#x50B3;&#x7D71;&#x8FA6;&#x516C;&#x5BA4;&#xFF0C;&#x5BE6;&#x9AD4;&#x7684;&#x6E9D;&#x901A;&#x53EF;&#x4EE5;&#x50B3;&#x9054;&#x9019;&#x7A2E;&#x6BD4;&#x8F03;&#x96F6;&#x6563;&#x7684;&#x8CC7;&#x8A0A;&#x3002;&#x4F46;&#x662F;&#x5728;&#x9060;&#x7AEF;&#x74B0;&#x5883;&#x4E0B;&#xFF0C;&#x6E9D;&#x901A;&#x3001;&#x8A0E;&#x8AD6;&#x7684;&#x6A5F;&#x6703;&#x6703;&#x6BD4;&#x8F03;&#x5C11;&#xFF0C;&#x56E0;&#x6B64;&#x6536;&#x96C6;&#x6574;&#x7406;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x7684;&#x8A0E;&#x8AD6;&#x904E;&#x7A0B;&#x80FD;&#x5920;&#x4F7F;&#x5F97;&#x6240;&#x6709;&#x4EBA;&#x7684;&#x6B65;&#x8ABF;&#x7DCA;&#x5BC6;&#x3002;</p>
<h2 id="3-communicate-your-vision-clearly"><a href="#3-Communicate-your-vision-clearly" class="headerlink" title="3. Communicate your vision clearly."></a>3. Communicate your vision clearly.</h2><p>&#x518D;&#x4F86;&#xFF0C;&#x5C31;&#x662F;&#x610F;&#x898B;&#x7684;&#x8868;&#x9054;&#x3002;&#x6E9D;&#x901A;&#x7684;&#x6E05;&#x695A;&#xFF0C;&#x6709;&#x6548;&#xFF0C;&#x53C8;&#x4E0D;&#x6D41;&#x65BC;&#x5634;&#x7832;&#x662F;&#x8868;&#x9054;&#x610F;&#x898B;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x9EDE;&#x3002;&#x7528;&#x5B57;&#x5FC5;&#x9808;&#x7CBE;&#x6E96;&#x4E14;&#x660E;&#x78BA;&#xFF0C;&#x78BA;&#x4FDD;&#x4E0D;&#x6703;&#x56E0;&#x70BA;&#x6587;&#x5B57;&#x7684;&#x4E0D;&#x78BA;&#x5B9A;&#x7522;&#x751F;&#x8AA4;&#x89E3;&#x3002;&#x4E00;&#x500B;&#x91CD;&#x9EDE;&#x5C31;&#x662F;&#xFF0C;&#x5718;&#x968A;&#x7684;&#x76EE;&#x6A19;&#x8DDF;&#x5171;&#x8B58;&#x8981;&#x660E;&#x78BA;&#xFF0C;&#x4E26;&#x4E14;&#x8981;&#x91CD;&#x8907;&#x7684;&#x51DD;&#x805A;&#x9019;&#x500B;&#x5171;&#x8B58;&#x3002;&#x78BA;&#x4FDD;&#x5C31;&#x7B97;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x65B9;&#x7684;&#x5718;&#x54E1;&#xFF0C;&#x90FD;&#x80FD;&#x671D;&#x8457;&#x540C;&#x4E00;&#x500B;&#x76EE;&#x6A19;&#x524D;&#x9032;&#x3002;&#x7576;&#x5C08;&#x6848;&#x5728;&#x4E0D;&#x540C;&#x9032;&#x5EA6;&#x6642;&#xFF0C;&#x53EF;&#x80FD;&#x6703;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x77ED;&#x671F;&#x76EE;&#x6A19;&#x3002;&#x6BCF;&#x500B;&#x5718;&#x968A;&#x90FD;&#x61C9;&#x8A72;&#x6E05;&#x695A;&#x660E;&#x78BA;&#x77E5;&#x9053;&#x9019;&#x500B;&#x5176;&#x5BE6;&#x7684;&#x5B9A;&#x4F4D;&#xFF0C;&#x4E26;&#x4E14;&#x78BA;&#x4FDD;&#x6574;&#x500B;&#x9032;&#x5EA6;&#x662F;&#x6709;&#x6548;&#x5730;&#x5728;&#x9032;&#x884C;&#x4E2D;&#x3002;</p>
<h2 id="4-plan-upfront-but-be-open-to-change"><a href="#4-Plan-upfront-but-be-open-to-change" class="headerlink" title="4. Plan upfront but be open to change."></a>4. Plan upfront but be open to change.</h2><p>&#x9032;&#x5EA6;&#x7684;&#x898F;&#x5283;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x4EE3;&#x8868;&#x8981;&#x76F2;&#x76EE;&#x7684;&#x57F7;&#x884C;&#x3002;&#x4FDD;&#x6301;&#x5F48;&#x6027;&#x53CA;&#x95DC;&#x5FC3;&#x9032;&#x5EA6;&#x662F;&#x5426;&#x6709;&#x6548;&#x7684;&#x9054;&#x6210;&#x76EE;&#x6A19;&#x3002;&#x5982;&#x679C;&#x767C;&#x73FE;&#x898F;&#x5283;&#x8207;&#x76EE;&#x6A19;&#x6709;&#x885D;&#x7A81;&#xFF0C;&#x5C31;&#x61C9;&#x8A72;&#x5FEB;&#x901F;&#x7684;&#x8ABF;&#x6574;&#x5230;&#x6B63;&#x78BA;&#x7684;&#x822A;&#x9053;&#x4E0A;&#x3002;&#x5982;&#x679C;&#x6709;&#x9700;&#x8981;&#x6539;&#x8B8A;&#x539F;&#x6709;&#x7684;&#x898F;&#x5283;&#x6642;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6539;&#x597D;&#x6539;&#x6EFF;&#xFF0C;&#x9078;&#x64C7;&#x4E00;&#x500B;&#x6700;&#x5408;&#x9069;&#x7684;&#x4FEE;&#x6B63;&#x3002;&#x800C;&#x4E14;&#x6539;&#x8B8A;&#x7684;&#x6642;&#x6A5F;&#x9EDE;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x5145;&#x88D5;&#x7684;&#x7DE9;&#x885D;&#x671F;&#x624D;&#x53EF;&#x4EE5;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5C0D;&#x65BC;&#x76EE;&#x524D;&#x7684;&#x9032;&#x5EA6;&#x53CA;&#x76EE;&#x6A19;&#x4FDD;&#x6301;&#x95DC;&#x6CE8;&#xFF0C;&#x78BA;&#x5B9A;&#x65B9;&#x5411;&#xFF0C;&#x624D;&#x80FD;&#x76E1;&#x529B;&#x885D;&#x523A;&#x3002;</p>
<h2 id="5-make-strategic-planning-a-time-bound-process"><a href="#5-Make-strategic-planning-a-time-bound-process" class="headerlink" title="5. Make strategic planning a time-bound process."></a>5. Make strategic planning a time-bound process.</h2><p>&#x5236;&#x5B9A;&#x4E00;&#x500B;&#x6709;&#x6548;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x52A0;&#x4E0A;&#x6642;&#x7A0B;&#x3002;&#x5728;&#x50B3;&#x7D71;&#x7684;&#x5718;&#x968A;&#x88E1;&#xFF0C;&#x901A;&#x5E38;&#x6703;&#x82B1;&#x5F88;&#x591A;&#x6642;&#x9593;&#x7684;&#x8A0E;&#x8AD6;&#x6574;&#x9AD4;&#x7684;&#x898F;&#x5283;&#xFF08;&#x5C31;&#x50CF;&#x8DDF;&#x6307;&#x5C0E;&#x6559;&#x6388;&#x7684;&#x5197;&#x9577;&#x6703;&#x8B70;&#xFF09;&#x3002;&#x4F46;&#x9019;&#x5C0D;&#x65BC;&#x9060;&#x7AEF;&#x5718;&#x968A;&#x4E0D;&#x662F;&#x4E00;&#x500B;&#x597D;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x4F60;&#x559C;&#x6B61;&#x9019;&#x6A23;&#x7684;&#x6703;&#x8B70;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4F60;&#x5C31;&#x4E0D;&#x6703;&#x51FA;&#x73FE;&#x5728;&#x9060;&#x7AEF;&#x5718;&#x968A;&#x4E2D;&#x3002;&#x9060;&#x7AEF;&#x5718;&#x968A;&#x4E0D;&#x9700;&#x8981;&#x8A02;&#x592A;&#x7D30;&#x7BC0;&#x7684;&#x6230;&#x7565;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5B9A;&#x7FA9;&#x597D;&#x5354;&#x4F5C;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x5FC5;&#x9808;&#x6709;&#x6E05;&#x695A;&#x7684;&#x6642;&#x7A0B;&#x898F;&#x5283;&#x3002;&#x958B;&#x59CB;&#x7684;&#x6642;&#x7A0B;&#xFF0C;&#x6574;&#x5408;&#x6642;&#x7A0B;&#xFF0C;&#x5230;&#x4E0A;&#x7DDA;&#x6642;&#x7A0B;&#x5FC5;&#x9808;&#x6E05;&#x695A;&#x3002;&#x7576;&#x7136;&#xFF0C;&#x9019;&#x500B;&#x6642;&#x9593;&#x9EDE;&#x5FC5;&#x9808;&#x8B93;&#x6BCF;&#x500B;&#x4EBA;&#x6709;&#x8DB3;&#x5920;&#x7684;&#x6642;&#x9593;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8D95;&#x9D28;&#x5B50;&#x4E0A;&#x67B6;&#xFF01;</p>
<h2 id="&#x7D50;&#x8AD6;"><a href="#&#x7D50;&#x8AD6;" class="headerlink" title="&#x7D50;&#x8AD6;"></a>&#x7D50;&#x8AD6;</h2><p>&#x6211;&#x8A8D;&#x70BA;&#xFF0C;&#x4E00;&#x500B;&#x9060;&#x7AEF;&#x5718;&#x968A;&#x80FD;&#x5426;&#x6210;&#x529F;&#x7684;&#x6838;&#x5FC3;&#x95DC;&#x9375;&#x5C31;&#x662F;&#x4FE1;&#x4EFB;&#x3002;&#x552F;&#x6709;&#x5F7C;&#x6B64;&#x9593;&#x4FE1;&#x4EFB;&#xFF0C;&#x624D;&#x80FD;&#x5EFA;&#x69CB;&#x51FA;&#x6700;&#x5F37;&#x5927;&#x7684;&#x6230;&#x529B;&#x3002;&#x9664;&#x4E86;&#x7406;&#x6027;&#x7684;&#x898F;&#x5283;&#x5B89;&#x6392;&#x4E4B;&#x5916;&#xFF0C;&#x611F;&#x6027;&#x7684;&#x5718;&#x968A;&#x6B78;&#x5C6C;&#x611F;&#x4E5F;&#x662F;&#x4E00;&#x500B;&#x597D;&#x7684;&#x5718;&#x968A;&#x6240;&#x64C1;&#x6709;&#x7684;&#x6587;&#x5316;&#x3002;</p>
<h2 id="reference"><a href="#Reference" class="headerlink" title="Reference"></a>Reference</h2><p>[1] <a href="https://www.entrepreneur.com/article/270172" target="_blank" rel="noopener">Top 5 Tips for Strategic Planning in a Virtual Company</a><br>[2] <a href="https://www.entrepreneur.com/article/248248" target="_blank" rel="noopener">Keep Virtual Workers Engaged From the Start With These 4 Simple Onboarding Practices</a><br>[3] <a href="https://www.entrepreneur.com/article/199002" target="_blank" rel="noopener">Virtual Office Management Means Effective Communication</a><br>[4] <a href="https://www.entrepreneur.com/article/237813" target="_blank" rel="noopener">How to Build a Culture Across Your Virtual Workforce</a></p>
<hr>
<h2 id="license"><a href="#License" class="headerlink" title="License"></a>License</h2><blockquote>
<p>&#x672C;&#x6587;&#x4E3B;&#x8981;&#x8F49;&#x8F09;&#x7FFB;&#x8B6F;&#x81EA; <a href="https://www.entrepreneur.com/article/270172" target="_blank" rel="noopener">Top 5 Tips for Strategic Planning in a Virtual Company</a>&#xFF0C;&#x5982;&#x6709;&#x4FB5;&#x72AF;&#x6B0A;&#x76CA;&#x4E4B;&#x60C5;&#x5F62;&#xFF0C;&#x8ACB;&#x53CA;&#x6642;&#x806F;&#x7E6B;&#x6211;&#x5011;&#x3002;</p>
</blockquote>
<p><img src="https://i.creativecommons.org/l/by-sa/3.0/88x31.png" style="    margin: 0;"><br>&#x672C;&#x8457;&#x4F5C;&#x7531;<a href="https://www.facebook.com/v123582" target="_blank" rel="noopener"> Chang, Wei-Yaun (v123582) </a>&#x88FD;&#x4F5C;&#xFF0C;<br>&#x4EE5;<a href="https://creativecommons.org/licenses/by-sa/3.0/deed.zh_TW" target="_blank" rel="noopener">&#x5275;&#x7528;CC &#x59D3;&#x540D;&#x6A19;&#x793A;-&#x76F8;&#x540C;&#x65B9;&#x5F0F;&#x5206;&#x4EAB; 3.0 Unported</a>&#x6388;&#x6B0A;&#x689D;&#x6B3E;&#x91CB;&#x51FA;&#x3002;</p>
</div><div class="post-nav"><a href="/2016/04/24/Responsive-Web-Design-RWD/" class="pre"><i class="icon-previous">Responsive Web Design (RWD)</i></a><a href="/2016/04/08/Jenkins-2-0-來了！/" class="next">Jenkins 2.0 Beta 來了！<i class="icon-next"></i></a></div><div id="disqus_thread"><script>var disqus_shortname = 'v123582';
var disqus_identifier = '2016/04/12/遠端團隊成功的五個小秘密/';
var disqus_title = '遠端團隊成功的五個小秘密';
var disqus_url = 'https://blog.v12358.tw/2016/04/12/遠端團隊成功的五個小秘密/';
(function() {
  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
})();</script><script id="dsq-count-scr" src="//v123582.disqus.com/count.js" async="async"></script></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><div class="widget-title">Information</div><ul><div class="tags">標籤：<a href="/tags/團隊養成系列/">團隊養成系列 </a><a href="/tags/Team-Working/">Team Working </a><a href="/tags/Growth-Strategies/">Growth Strategies </a><a href="/tags/Remote-Workers/">Remote Workers </a></div><div class="categories">分類：<a href="/categories/Team-Working/">Team Working</a></div></ul></div><div class="widget"><div class="widget-title">Table of Content</div><div class="clear"><div id="toc" class="toc-article"><div class="toc"></div></div></div></div><script type="text/javascript" src="//js1.bloggerads.net/ShowAds.aspx?blogid=20190326000001" async></script></div></div></div><div id="footer">© <a href="/" rel="nofollow">資料科學家的工作日常.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><script src="/js/jquery.min.js"></script>
<script src="/js/share.js"></script><script type="text/javascript" src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script><a id="rocket" href="#top" class="show"></a><script src="/js/jquery.min.js"></script>
<script src="/js/totop.js"></script><script src="/js/fancybox.pack.js"></script>
<script src="/js/jquery.fancybox.js"></script><link rel="stylesheet" href="/css/jquery.fancybox.css"><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
ga('create','UA-59103909-1','auto');ga('send','pageview');
</script></div><!-- hexo-inject:begin --><!-- hexo-inject:end --></body></html>